cir=0
lscheck=1
mincaiyao,maxcaiyao=专业信息("草药学")
minck,maxck=专业信息("采矿")
jianyushiqu=0
if mldcc == nil then
	mldcc=0
end
cdtime=os.clock()
zz=种族()
xb=性别()
zy=职业()
zhiye=zy
zhenying=阵营()
maxfree=16
xsmax=60
gdmax=60
zzmax=60
mldmax=60
eymax=60
bingdongtime=os.clock()
if zz == "侏儒" then
	zr=1
else
	zr=0
end
if fbtime == nil then
	fbtime=0
	cztime=0
end
function 挂机结束()
	local val = 检查挂机方案()
	if val >= 404 or val == 11 or val == 22 then
		return true
	end
	return false
end
function 沙城回主城()
	if 地图名() == "沙塔斯城" then
		if 在坐标范围(-1901.32, 5767.95, 131.213,20) then
			走到(-1901.32, 5767.95, 131.213,1)
			if zy == "圣骑士" then
				num = 背包物品数量("清洁的德拉诺之水")
				if num < 40 then
					走到(-1911.99, 5781.6, 132.244,1)
					if 打开NPC("加卢尔") then
						延时(500)
						出售垃圾()
						延时(1000)
						local ci=math.modf((40-num)/20)
						local i=0
						for i=1,ci do
							购买物品(6,20)
							延时(1000)
						end
						if (40-num)%20 > 0 then
							购买物品(6,(40-num)%20)
							延时(1000)
						end
						延时(500)
					end
					走到(-1899.85, 5767.21, 131.31,1)
				end
			end
			走到(-1887.63, 5768.26, 129.802,1)
		end
		if 在坐标范围(-1887.63, 5768.26, 129.802,10) then
			走到(-1887.63, 5768.26, 129.802,1)
			发送邮件()
			运行宏("/click StaticPopup1Button1")
			if 打开NPC("技师哈尔玛哈") then
				延时(500)
				出售垃圾()
				延时(1000)
			end
			走到(-1883.99, 5766.39, 129.558,1)
			上马()
			按键("space",1)
			延时(1000)
			按键("space",2)
			x,y,z = 当前坐标()
			if z > 130 then
				纵向角度(0.01)
				走到(-1830.57, 5641.15, 134.062,1)
				纵向角度(-0.77)
				走到(-1834.6, 5519.59, 0.949057,1)
				纵向角度(-0.77)
				走到(-1849.23, 5472.32, 0.857469)
				延时(2000)
			else
				走到(-1851.62, 5757.11, 129.558)
				走到(-1803.4, 5741.38, 128.117)
				走到(-1785.41, 5724.42, 127.295)
				走到(-1790.76, 5660.41, 129.493)
				走到(-1801.98, 5617.13, 130.812)
				走到(-1807.1, 5599.87, 130.812,1)
				坐船()
				走到(-1822.07, 5556.77, 1.32778)
				走到(-1836.23, 5513.48, 0.857326)
				走到(-1850.08, 5470.57, 0.857326,1)
			end
		end
		if 在坐标范围(-1849.23, 5472.32, 0.857469,30) or 在坐标范围(-1795.62, 5399.67, -12.4279,20) or 在坐标范围(-1931.43, 5460.64, -12.4295,20) then
			纵向角度(-0.74)
			if zhenying == "联盟" then
				走到(-1821.74, 5418.66, -12.4273)
				纵向角度(-0.77)
				走到(-1795.62, 5399.67, -12.4279,1)
				下马()
				打开身边目标("沙塔斯传送门：铁炉堡")
			else
				走到(-1905.14, 5445.52, -12.4273)
				走到(-1913.59, 5446.69, -12.4271)
				纵向角度(-0.77)
				走到(-1931.43, 5460.64, -12.4295,1)
				下马()
				打开身边目标("沙塔斯传送门：幽暗城")
			end
			延时(1000)
			while 过图中() do 
				延时(1000)
			end
		end
		if 在坐标范围(-2183.13, 5401.51, 51.8831,20) then
			走到(-2171.46, 5410.04, 50.2285)
			走到(-2183.34, 5400.98, 51.8831,1)
			if zy == "圣骑士" then
				for i=1,10 do
					num = 背包物品数量("清洁的德拉诺之水")
					if num >= 40 then
						break
					end
					延时(1000)
					if 打开NPC("旅店老板海索恩") then
						延时(1000)
						对话选项(2)
						延时(1000)
						--[[延时(1000)
						if 背包物品数量("糖果包")>0 then
							延时(100)
							if 打开NPC("旅店老板海索恩") then
								延时(500)
								对话选项(2)
								延时(1000)
							end
						end--]]
						出售垃圾()
						延时(2000)
						if num < 40 then
							local ci=math.modf((40-num)/20)
							local i=0
							for i=1,ci do
								购买物品(12,20)
								延时(1000)
							end
							if (40-num)%20 > 0 then
								购买物品(12,(40-num)%20)
								延时(1000)
							end
						end
						销毁物品("糖果包")
					end
				end
			end
			走到(-2171.46, 5410.04, 50.2285)
			走到(-2174.5, 5412.21, 50.2285,1)
		end
		if 在坐标范围(-2174.53, 5411.92, 50.228,20) then
			走到(-2174.91, 5412.77, 50.2283,1)
			延时(1000)
			发送邮件()
			运行宏("/click StaticPopup1Button1")
			走到(-2174.43, 5416.19, 50.228)
			走到(-2194.87, 5421.11, 50.228,1)
			if 打开NPC("曼西尔·红箭") then
				延时(1000)
				出售垃圾()
				延时(1000)
				出售垃圾()
				延时(1000)
			end
			走到(-2180.15, 5417.26, 50.228,1)
		end
		if 在坐标范围(-2180.15, 5417.26, 50.228,20) then
			走到(-2180.15, 5417.26, 50.228,1)
			上马()
			按键("space",1)
			延时(1000)
			按键("space",2)
			x,y,z = 当前坐标()
			if z > 55 then
				纵向角度(0.01)
				走到(-2043.92, 5435.76, 66.6966,1)
				纵向角度(-0.71)
				走到(-1947.88, 5458.56, 0.87003,1)
				纵向角度(-0.3)
				走到(-1893.97, 5438.79, -11.2815)
			else
				走到(-2178.47, 5435.46, 50.228)
				走到(-2176.37, 5455.31, 50.228)
				走到(-2151.97, 5498.41, 50.2508)
				走到(-2137.69, 5504.55, 48.6639)
				走到(-2086.9, 5504.32, 50.4279)
				走到(-2071.53, 5501.21, 51.2129)
				走到(-2044.46, 5490.05, 54.5417)
				走到(-2031.33, 5486.17, 54.5417,1)
				while HP() / MaxHP() < 0.8 do
					if zy == "圣骑士" then
						使用技能("圣光术")
						延时(1500)
						while 读条中() do 
							延时(100)
						end
					end
					延时(500)
				end
				走到(-1972.67, 5466.53, 0.970123)
				走到(-1947.32, 5457.49, 0.858419)
				走到(-1903.75, 5443.67, 0.857576)
				走到(-1891.32, 5430.84, -12.4276,1)
			end
		end
		if 在坐标范围(-1893.97, 5438.79, -11.2815,30) or 在坐标范围(-1795.62, 5399.67, -12.4279,20) or 在坐标范围(-1931.43, 5460.64, -12.4295,20) then
			if zhenying == "联盟" then
				走到(-1821.74, 5418.66, -12.4273)
				纵向角度(-0.74)
				走到(-1795.62, 5399.67, -12.4279,1)
				下马()
				打开身边目标("沙塔斯传送门：铁炉堡")
			else
				走到(-1913.59, 5446.69, -12.4271)
				纵向角度(-0.74)
				走到(-1931.43, 5460.64, -12.4295,1)
				下马()
				打开身边目标("沙塔斯传送门：幽暗城")
			end
			延时(1000)
			while 过图中() do 
				延时(1000)
			end
		end
	end
	if zhenying == "部落" then
		幽暗城补充材料()
		for i=1,2 do
			if 金币达标() then
				AH转金()
			end
		end
	else
		铁炉堡补充材料()
		for i=1,2 do
			if 金币达标() then
				AH转金()
			end
		end
	end
end
function 炉石()
	local lsmap = 炉石位置()
	local lsd=0
	while 小地图名() ~= lsmap and 地图名() ~= lsmap do 
		if 地图名() == "沙塔斯城" and 小地图名() == "旅店" and lsmap == "占星者之台" then
			lsd=1
			break
		end
		下马()
		使用物品("炉石")
		延时(3000)
		while 读条中() do 
			延时(1000)
		end
		if 地图名() == "死亡矿井" or 地图名() == "奥达曼" then
			while 战斗中() do
				技能输出()
			end
		end
		延时(3000)
		while 过图中() do 
			延时(500)
		end
		延时(1000)
		if 小地图名() ~= lsmap then
			跳()
			延时(2000)
		end
		if HP() <= 1 then
			释放灵魂()
			虚弱复活()
		end
		if 地图名() == lsmap or 小地图名() == "旅店" and lsmap == "占星者之台" then
			lsd=1
			break
		end
	end
	沙城回主城()
	if 在坐标范围(1631.6, 222.833, -43.1025,10) then
		幽暗城补充材料()
	end
	if 在坐标范围(-1297.67, 39.333, 129.209,20) then
		雷霆崖补充材料(1)
		if zy == "潜行者" then
			num = 背包物品数量("闪光粉")
			if num < 20 then
				路径走到("雷霆崖到飞机点",-1197.18, 27.5771, 176.948)
				打开NPC("塔尔")
				延时(500)
				打开NPC("塔尔")
				延时(1000)
				if 坐飞机到("奥格瑞玛") then
					while 在飞机上() do 
						延时(1000)
					end
				end
				if 地图名() == "奥格瑞玛" then
					路径走到("奥格飞行点下到法师传送",1656.82, -4357.65, 25.3364)
					奥格补充材料()
					路径走到("奥格飞行点下到法师传送",1674.78, -4322.38, 61.2465)
					if 在坐标范围(1674.78, -4322.38, 61.2465,10) then
						走到(1676.46, -4315.67, 61.5217,1)
						if 打开NPC("多拉斯") then
							延时(500)
						else
							打开NPC("多拉斯")
							延时(500)
						end
						if 坐飞机到("雷霆崖") then
						end
					end
				end
			end
			while 在飞机上() do 
				延时(1000)
			end
			if 地图名() == "雷霆崖" then
				路径走到("雷霆崖到飞机点",-1252.88, 65.2824, 127.355)
			end
		end
	end
	if 地图名() == "暴风城" then
		if lsd==1 then
			自动寻路(-8806.69, 628.75, 94.2283)
			走到(-8800.4, 623.82, 96.7738,1)
			走到(-8789.01, 611.279, 97.7687,1)
			打开NPC("玛尔达·维勒")
			延时(1500)
			对话选项(1)
			延时(1500)
			出售垃圾()
			走到(-8800.4, 623.82, 96.7738,1)
		end
	end
	铁炉堡补充材料()
	提升草药技能()
end
function 铁炉堡补充材料()
	if 地图名() == "铁炉堡" then
		if zy == "法师" then
			local num = 背包物品数量("传送符文")
			if 存在技能("召唤餐桌") then
				num2 = 背包物品数量("魔粉")
			else
				num2 = 100
			end
			if num < 4 or num2 < 20 then
				自动寻路(-4866.4, -867.937, 502.192)
				打开NPC("巴瑞姆·贾根斯塔德")
				延时(1000)
				if num < 4 then
					购买物品(7,20-num)
				end
				if num2 < 20 then
					购买物品(9,20-num2)
				end
				延时(2000)
				自动寻路(-4864.96, -883.073, 501.66)
			end
		elseif zy == "圣骑士" then
			num = 背包物品数量("王者印记")
			if num < 20 then
				自动寻路(-4866.4, -867.937, 502.192)
				打开NPC("巴瑞姆·贾根斯塔德")
				延时(1000)
				购买物品(19,100-num)
				延时(2000)
				自动寻路(-4864.96, -883.073, 501.66)
			end
		end
		if 背包空格() < 20 then
			自动寻路(-4876.7, -967.509, 505.074)
			打开NPC("曼高恩·火锤")
			延时(1000)
			出售垃圾()
			出售垃圾()
			自动寻路(-4879.56, -946.395, 501.459)
		end
		if zy == "潜行者" then
			盗贼补充()
		end
	end
end
function 炉石回城()
	local lmap=炉石位置()
	if lmap ~= "尼耶尔前哨站" and lmap ~= "葬影村" and lmap~="石爪峰" and lmap ~= "烈日石居" then
		提示("炉石在"..lmap.."，准备去正确地点绑定")
		--[[while lmap ~= "尼耶尔前哨站" and lmap ~= "葬影村" and lmap~="石爪峰" do 
			延时(10000)
			lmap=炉石位置()
			按键("space")
		end--]]
		玛拉顿出本()
		while lscheck==1 and lmap ~= "尼耶尔前哨站" and lmap ~= "葬影村" and lmap~="石爪峰" and lmap ~= "烈日石居" do 
			if zz == "亡灵" or zz=="巨魔" then
				if 地图名() == "雷霆崖" then
					if 在坐标范围(-1261.44, 24.9744, 128.187,15) then
						路径走到("雷霆崖旅店到银行",-1261.51, 45.6542, 127.442)
					end
					if 在路径范围("雷霆崖传送点到电梯") then
						路径走到("雷霆崖传送点到电梯",-1209.47, 130.584, 134.497)
						路径走到("雷霆崖到飞机点",-1251.01, 66.7901, 127.379)
						走到(-1261.51, 45.6542, 127.442,1)
					end
					路径走到("雷霆崖到飞机点",-1197.18, 27.5771, 176.948)
					打开NPC("塔尔")
					延时(500)
					打开NPC("塔尔")
					延时(1000)
					if 坐飞机到("烈日石居") then
					elseif 坐飞机到("葬影村") then
					end
				end
				if HP() > 1 then
					if 在坐标范围(-1440.1, 1974.97, 85.8554,100) then
						自动寻路(-1593.5, 3149.69, 46.4947,35)
					end
					执行脚本("玛拉顿到葬影村.lua")
				end
				if HP() <= 1 then
					释放灵魂()
					虚弱复活()
					使用技能("冰甲术")
					if 炉石位置() ~= "烈日石居" then
						上马()
						自动寻路(-1593.5, 3149.69, 46.4947,35)
						路径走到("玛拉顿到葬影村",-1593.5, 3149.69, 46.4947)
						打开NPC("旅店老板希科瓦")
						延时(1000)
						对话选项(1)
						延时(1000)
						运行宏("/click StaticPopup1Button1")
						延时(1000)
					end
				end
			else
				if HP() > 1 then
					if 在坐标范围(-1440.1, 1974.97, 85.8554,100) then
						自动寻路(-1593.5, 3149.69, 46.4947,35)
					end
					执行脚本("玛拉顿到尼耶尔前哨站.lua")
				end
				if HP() <= 1 then
					释放灵魂()
					虚弱复活()
					使用技能("冰甲术")
					if 炉石位置() ~= "石爪峰" then
						上马()
						自动寻路(137.748, 1325.52, 193.499)
					end
				end
			end
			lmap=炉石位置()
		end
		提示("炉石已绑定："..炉石位置())
	end
	while lscheck==1 and 小地图名() ~= lmap and HP()>1 do
		if 地图名() == "玛拉顿" then
			while 战斗中() do
				x,y,z = 当前坐标()
				if 坐标范围怪物数量(x,y,z,10) == 0 then
					x,y,z = 目标坐标()
					朝向坐标(x,y,z)
					使用技能("寒冰箭")
					延时(300)
					while 读条中() do 
						延时(100)
					end
				else
					使用技能("魔爆术")
					延时(1400)
				end
			end
		end
		使用技能("寒冰护体")
		延时(1500)
		提示("炉石回城")
		使用物品("炉石")
		延时(10000)
		for i=1,10,1 do 
			if 过图中() or 地图名() == "凄凉之地" or 地图名()=="石爪山脉" then
				break
			end
			延时(1000)
		end
		while 过图中() do 
			延时(1000)
		end
		if 地图名() ~= "凄凉之地" and 地图名() ~= "石爪山脉" then
			提示("炉石可能未冷却或绑错了地方")
			按键("space")
			玛拉顿出本()
			if zhenying == "联盟" then
				执行脚本("玛拉顿到尼耶尔前哨站.lua")
			else
				执行脚本("玛拉顿到葬影村.lua")
			end
		end
		延时(3000)
		if HP() == 0 then
			释放灵魂()
		end
	end
end
function 玛拉顿进本()
	if 在坐标范围(-1182.86, 2872.28, 85.7709,60) then
		if 是否队长() then
			运行宏("/p 进本")
			自由拾取()
		end
		--MLD门口处理()
		--走到(-1182.86, 2872.28, 85.7709,1)
		取消BUFF("寒冰屏障")
		朝向坐标(-1181.17, 2855.86, 85.2396)
		按键("w")
		延时(300)
		--使用技能("闪现术")
		移动("前",5000)
		while 过图中() do 
			延时(1000)
		end
		waitTime=0
		while 在坐标范围(751.262, -605.442, -33.186,20) == false and HP()>0 do 
			延时(1000)
			waitTime = waitTime+1
			if waitTime > 5 then
				if 在坐标范围(-1182.86, 2878.28, 85.92,100) then
					走到(-1182.86, 2878.28, 85.92,1)
					延时(30000)
					if HP() == 0 or 等级() < 58 then
						return
					end
					--MLD门口处理()
					朝向坐标(-1181.17, 2855.86, 85.2396)
					延时(300)
					移动("前",5000)
					while 过图中() do 
						延时(1000)
					end
					for iii=1,10 do 
						if 在坐标范围(751.262, -605.442, -33.186,20) then 
							return
						end
						延时(1000)
						if HP() == 0 then
							return
						end
					end
					val = 检查挂机方案()
					if val == 11 or val == 22 then
						return
					end
				end
			end
			if HP() == 0 then
				return
			end
		end
		if not 在副本() then
			走到(-1182.86, 2878.28, 85.92,1)
		end
	end
end
function 主城存取仓(cunqu)
	if cunqu == nil then
		cunqu = 0
	end
	if zy == "法师" and 背包物品数量("传送符文") == 0 then
		mldcc=0
		return
	end
	if zy == "法师" and 背包物品数量("传送符文") > 0 then
		销毁物品("法力蓝宝石",1)
		销毁物品("法力红宝石",1)
		销毁物品("法力黄水晶",1)
		if zhenying == "部落" then
			if mldcc == 1 then
				if 法师传送到("幽暗城") then
				elseif 法师传送到("奥格瑞玛") then
				end
				if 地图名() == "奥格瑞玛" then
					奥格到提瑞斯法林地()
				end
				if 地图名() == "提瑞斯法林地" or 小地图名() == "洛丹伦废墟" then
					提瑞斯法林地到幽暗城()
				end
				if 地图名() == "幽暗城" then
					幽暗城补充材料()
					路径走到("幽暗城法师传送到旅店电梯",1601.29, 240.396, -51.1799)
					下马()
					延时(1000)
					if 打开NPC("伦道夫·蒙泰古") then
						延时(1000)
						if cunqu == nil or cunqu==0 then
							存仓()
						else
							取仓()
						end
						延时(1000)
					end
				end
			else
				if 法师传送到("雷霆崖") then
				elseif 法师传送到("奥格瑞玛") then
				elseif 法师传送到("幽暗城") then
				end
				提瑞斯法林地到奥格()
				if 地图名() == "奥格瑞玛" or 地图名() == "雷霆崖" then
					奥格到雷霆崖()
					雷霆崖补充材料(1)
				end
				if 地图名() == "雷霆崖" then
					if not 在坐标范围(-1261.23, 22.8048, 128.187,5) then
						if 在路径范围("雷霆崖传送点到电梯") then
							路径走到("雷霆崖传送点到电梯",-1209.47, 130.584, 134.497)
							路径走到("雷霆崖到飞机点",-1251.01, 66.7901, 127.379)
							走到(-1261.51, 45.6542, 127.442,1)
						else
							路径走到("雷霆崖旅店到草药训练师",-1261.51, 45.6542, 127.442)
						end
						路径走到("雷霆崖旅店到银行",-1261.23, 22.8048, 128.187)
					end
					if 打开NPC("阿特帕") then
						延时(1000)
						if cunqu == nil or cunqu==0 then
							存仓()
						else
							取仓()
						end
						延时(1000)
					end
				end
			end
			
		else
			if 法师传送到("铁炉堡") then
			elseif 法师传送到("暴风城") then
			end
			暴风城巫师圣殿出门()
			if 地图名() == "暴风城" or 地图名() == "矿道地铁" then
				暴风城到铁炉堡()
			end
			if 地图名() == "铁炉堡" then
				法师补充()
				自动寻路(-4876.7, -967.509, 505.074)
				if 打开NPC("曼高恩·火锤") then
					延时(1000)
					出售垃圾()
					出售垃圾()
				end
				自动寻路(-4879.56, -946.395, 501.459)
				自动寻路(-4888.45, -995.103, 504.758)
				走到(-4888.49, -994.984, 504.723,1)
				if 打开NPC("拜雷·石衣") then
					延时(1000)
					if cunqu == nil or cunqu==0 then
						存仓()
					else
						取仓()
					end
					延时(1000)
				end
			end
		end
	end
end
function 回城售卖()
	local done=0
	if HP() > 1 then
		if 地图名() ~= "凄凉之地" and 地图名() ~= "玛拉顿" and 地图名()~="石爪山脉" and not 在副本() or 背包空格() < maxfree or 需要修理() then
			local lmap=炉石位置()
			if mldcc >= 1 then
				if lmap == "尼耶尔前哨站" or lmap == "葬影村" or lmap=="石爪峰" or lmap == "烈日石居" then
					主城存取仓()
				end
			end
			val = 检查挂机方案()
			if val >= 404 or val == 11 or val == 22 then
				return
			end
			炉石回城()
		end
		for hci=1,1 do
			if 地图名() == "凄凉之地" or 地图名() == "玛拉顿" and not 在副本() then
				if lscheck==1 and 在坐标范围(251.424, 1254.33, 192.15,50) then
					路径走到("凄凉之地到石爪峰",146.274, 1322.45, 192.61)
					走到(135.789, 1326.32, 193.499,1)
					打开NPC("巴瑞特·克罗斯")
					延时(1000)
					坐飞机到("石爪峰")
					延时(1000)
					if 在飞机上() then
						while 在飞机上() do 
							延时(1000)
						end
					else
						路径走到("凄凉之地到石爪峰",2681.9, 1466.21, 233.476)
						打开NPC("泰罗伦")
					end
					while 炉石位置() ~= "石爪峰 " do
						路径走到("凄凉之地到石爪峰",2730.21, 1498.42, 236.827)
						打开NPC("旅店老板法拉莉亚")
						延时(1000)
						对话选项(1)
						延时(1000)
						运行宏("/run ConfirmBinder()/n/click StaticPopup1Button1")
					end
					break			
					--[[走到(248.575, 1244.63, 192.169)
					走到(242.811, 1284.59, 191.096)
					走到(246.98, 1292.78, 190.645,1)
					发送邮件()
					走到(242.811, 1284.59, 191.096)
					走到(248.575, 1244.63, 192.169)
					走到(243.969, 1239.08, 192.156,1)
					if 打开NPC("克里斯蒂·加瓦尼斯") then
						local n1=背包空格()
						延时(500)
						for i=1,3 do 
							延时(1000)
							出售垃圾()
						end
					end
					走到(248.575, 1244.63, 192.169)
					走到(235.311, 1288.59, 189.76,1)--]]
				end
				if 在坐标范围(-1594.03, 3149.62, 46.4943,150) and 炉石位置() ~= "烈日石居" and lscheck==1 then
					路径走到("葬影村旅店到飞行点",-1769.17, 3262.7, 5.19827)
					打开NPC("萨隆")
					延时(1000)
					坐飞机到("烈日石居")
					延时(1000)
					if 在飞机上() then
						while 在飞机上() do 
							延时(1000)
						end
					else
						路径走到("葬影村飞行点到烈日石居",967.227, 1041.66, 104.357)
						打开NPC("萨尔姆")
					end
					while 炉石位置() ~= "烈日石居" do
						路径走到("葬影村飞行点到烈日石居",895.093, 926.658, 106.258)
						打开NPC("旅店老板杰卡")
						延时(1000)
						对话选项(1)
						延时(1000)
						运行宏("/run ConfirmBinder()/n/click StaticPopup1Button1")
					end
					break			
					
				end
				if not 在坐标范围(-1182.86, 2878.28, 85.92,30) then
					下马()
					延时(500)
					使用技能("冰甲术")
					延时(300)
					上马()
					if zhenying == "联盟" then
						if 在坐标范围(233.548, 1290.57, 189.765,200) then
							路径走到("玛拉顿售卖路径",246.1,1291.8,190.5)
							if mldcc == 0 then
								发送邮件()
							end
							上马()
							路径寻路("玛拉顿售卖路径")
							使用技能("寒冰护体")
							if 打开NPC("玛克斯顿·斯坦恩") then
								清除目标()
								延时(1000)
								出售垃圾()
								if 战斗中() then
									x,y,z = 当前坐标()
									使用技能("冰霜新星(等级 1)")
									朝向坐标(233.548, 1290.57, 189.765)
									移动("前",3000)
									朝向坐标(x,y,z)
									使用技能("火焰冲击")
									while 战斗中() and HP() > 1 do
										x,y,z = 当前坐标()
										朝向坐标(x,y,z)
										走到(x,y,z,1,1,35)
										延时(100)
										使用技能("寒冰箭")
										延时(500)
										while 读条中() do 
											延时(100)
										end
										使用技能("法术反制")
									end
									if HP() > 1 then
										路径寻路("玛拉顿售卖路径")
										使用技能("寒冰护体")
										if 打开NPC("玛克斯顿·斯坦恩") then
											延时(1000)
											运行宏("/run RepairAllItems()")
										end
									end
								end
								延时(1000)
								出售垃圾()
								if 战斗中() then
									x,y,z = 当前坐标()
									使用技能("冰霜新星(等级 1)")
									朝向坐标(233.548, 1290.57, 189.765)
									移动("前",3000)
									朝向坐标(x,y,z)
									使用技能("火焰冲击")
									while 战斗中() and HP() > 1 do
										x,y,z = 当前坐标()
										朝向坐标(x,y,z)
										走到(x,y,z,1,1,35)
										延时(100)
										使用技能("寒冰箭")
										延时(500)
										while 读条中() do 
											延时(100)
										end
										使用技能("法术反制")
									end
									if HP() > 1 then
										路径寻路("玛拉顿售卖路径")
										使用技能("寒冰护体")
										if 打开NPC("玛克斯顿·斯坦恩") then
											延时(1000)
											运行宏("/run RepairAllItems()")
										end
									end
								end
								延时(1000)
							end
							走到(178.91, 1189.41, 165.97,1)
							延时(300)
							上马()
						end
						if HP() > 1 then
							while 在飞机上 () do
								延时(1000)
							end
							if 在坐标范围(124.274, 1328.9, 190.471,40) then
								x,y,z = 当前坐标()
								if z>188 then
									走到(124.274, 1328.9, 190.471)
								end
								x,y,z = 当前坐标()
								if z>186 then
									走到(89.8839, 1343.1, 175.432)
								end
								x,y,z = 当前坐标()
								if z>94 then
									走到(14.5523, 1391.62, 93.2659,1,0,20)
								end
								上马()
								路径寻路("石爪峰到玛拉顿")
							end
							if 在坐标范围(-1440.1, 1974.97, 85.8554,100) then
								路径走到("玛拉顿虚弱路径_联盟",-1422.66, 2924.11, 136.344)
							end
							路径寻路("凄凉之地到玛拉顿")
						end
					else
						if 在坐标范围(-1593.5, 3149.69, 46.4947,30) then
							走到(-1599.46, 3139.88, 46.4947,1)
							走到(-1614.21, 3117.48, 44.1057)
							走到(-1610.13, 3117.5, 44.6171,1)
							if mldcc == 0 then
								发送邮件()
							end
							走到(-1614.21, 3117.48, 44.1057)
							走到(-1593.5, 3149.69, 46.4947,1)
							if 打开NPC("旅店老板希科瓦") then
								延时(800)
								对话选项(2)
								延时(1000)
								for i=1,3 do 
									延时(1000)
									出售垃圾()
								end
							end
							走到(-1599.46, 3139.88, 46.4947,1)
							走到(-1614.21, 3117.48, 44.1057)
							done=1
						end
						if 在坐标范围(-1669.95, 3083.15, 30.692,100) then
							走到(-1641.91, 3093.48, 31.5739)
							走到(-1669.95, 3083.15, 30.692)
							走到(-1676.99, 3073.89, 34.5375,1) ---海维拉尼   修理
							if 打开NPC("海维拉尼") then
								延时(1000)
								出售垃圾()
							end
							走到(-1669.95, 3083.15, 30.692,1)
							移动("前",800)
							上马()
							done=1
						end 
						if 在坐标范围(-1440.1, 1974.97, 85.8554,100) then
							提示("在墓地附近")
							延时(1000)
							路径走到("玛拉顿虚弱路径_部落",-1422.66, 2924.11, 136.344)
							使用技能("寒冰护体")
							done=1
						end
						if done == 1 then
							路径寻路("葬影村到玛拉顿")
						else
							自动寻路(-1423.73, 2924.9, 136.344,10)
							if HP() == 1 then
							else
								打开身边目标()
								走到(-1430.17,2946.69,134.629,1)
							end
						end
					end
				end
				if HP() == 0 then
					return
				end
			end
		end
		if 地图名() == "石爪山脉" or 地图名() == "玛拉顿" and not 在副本() then
			石爪峰修理()
		end
	end
end
function 玛拉顿出本(chu)
	if mldbuchu ~= nil and mldbuchu == 1 then
		return
	end
	if 在副本() and 地图名() == "玛拉顿" then
		路径寻路("玛拉顿出副本")
		寻路结束()
		朝向坐标(761.285, -626.233, -32.7031)
		使用技能("寒冰护体")
		if chu == nil then
			if 是否队长() then
				运行宏("/p 出本")
				延时(1000)
			end
			自动跑()
			延时(3000)
			local wt=1
			while not 在坐标范围(-1182.86, 2878.28, 85.92,30) and HP()>0 do 
				延时(1000)
				wt=wt+1
				if wt>30 then
					if 在坐标范围(758.968, -608.089, -32.8245,80) then
						走到(758.968, -608.089, -32.8245,1)
						延时(5000)
						朝向坐标(761.285, -626.233, -32.7031)
						自动跑()
						wt=0
					end
				end
				while 过图中() do 
					延时(300)
				end
				val = 检查挂机方案()
				if val == 11 or val == 22 then
					return
				end
			end
			寻路结束()
			if 战斗中() then
				使用技能("寒冰屏障")
			end
		end
	end
end
function 回蓝()
	if MP() < 3500 then
		使用物品("强效法力药水")
	end
	if MP() < 1200 then
		使用物品("法力红宝石")
		--使用物品("法力黄水晶")
	end
end
function 回血()
	if HP() / MaxHP() < 0.7 then
		运行宏("/use 特效治疗药水/n/use 优质治疗药水")
	end
end
function 绷带回血()
	if HP() < 1000 then
		if 背包物品数量("厚符文布绷带") > 0 then
			if 存在DEBUFF() then
				使用技能("寒冰屏障")
				延时(100)
				取消BUFF("寒冰屏障")
			end
			使用物品("厚符文布绷带")
			延时(3000)
			return true
		end
	end
	return false
end
function 跑圈(da,la,lvl)
	if 精英剩余数量() == 0 or HP() <= 1 or 地图名() ~= "玛拉顿" then
		return
	end
	cir=cir+1
	回血()
	使用技能("寒冰护体")
	走到(778.939, -485.245, -40.4882)
	朝向坐标(772.636, -479.04, -40.9185)
	if da==1 then
		if 小鬼剩余数量() > 6  then
			使用技能("魔爆术")
		else
			使用技能("寒冰护体")
		end
	else
		延时(500)
		反身吹风(1)
	end
	走到(772.636, -479.04, -40.9185)
	朝向坐标(767.504, -472.73, -40.9592)
	回血()
	if da==1 then
		if 小鬼剩余数量() > 6  then
			使用技能("魔爆术")
		else
			使用技能("寒冰护体")
		end
	end
	回血()
	走到(767.504, -472.73, -40.9592,0,0,0.5)
	朝向坐标(757.26, -472.002, -39.3872)
	if da==1 then
		if 小鬼剩余数量() > 10  then
			朝向坐标(757.26, -472.002, -39.3872)
			使用技能("冰霜新星(等级 1)")
		elseif 小鬼剩余数量() > 6 then
			使用技能("魔爆术")
		else
			使用技能("冰霜新星(等级 1)")
		end
	else
		使用技能("冰霜新星(等级 1)")
	end
	回血()
	走到(757.26, -472.002, -39.3872,0,0,0.5)
	朝向坐标(750.224, -471.647, -38.5483)
	if da==1 then
		if 小鬼剩余数量() > 10  then
			反身吹风(1)
		end
	end
	走到(750.224, -471.647, -38.5483,0,0,0.5)
	朝向坐标(743.001, -472.575, -39.1108)
	if da==1 then
		if 小鬼剩余数量() > 6  then
			使用技能("魔爆术")
		end
	end
	走到(743.001, -472.575, -39.1108,0,0,0.5)
	朝向坐标(736.261, -482.969, -40.9316)
	if da==1 then
		if 小鬼剩余数量() > 6  then
			使用技能("魔爆术")
		end
	end
	回蓝()
	走到(736.261, -482.969, -40.9316,0,0,0.5)
	朝向坐标(737.597, -491.177, -40.8763)
	使用技能("寒冰护体")	
	走到(737.597, -491.177, -40.8763,0,0,0.5)
	朝向坐标(744.054, -532.396, -35.0943)
	if la==1 then
		范围选怪(716.689,-502.125,-36.6243,8)
	end
	朝向坐标(744.054, -532.396, -35.0943)
	跳()
	延时(250)
	if MP() < 100 then
		if la==1 then
			朝向坐标(716.689,-502.125,-36.6243)
			使用技能("火焰冲击(等级 1)")
			延时(100)
			朝向坐标(744.054, -532.396, -35.0943)
			延时(1300)
			使用技能("闪现术")
			延时(100)
		end
		朝向坐标(744.054, -532.396, -35.0943)
		使用技能("闪现术")
	else
		if la==1 then
			使用技能("法术反制")
		end
		朝向坐标(744.054, -532.396, -35.0943)
		使用技能("闪现术")
	end
	if HP() == 0 then
		return
	end
	if la==1 then
		使用技能("法术反制")
		延时(150)
		使用技能("法术反制")
		延时(150)
		使用技能("法术反制")
		延时(150)
	end
	走到(744.054, -532.396, -35.0943)
	朝向坐标(751.013, -540.788, -32.6939)
	走到(751.013, -540.788, -32.6939,0,0,0.5)
	朝向坐标(786.666, -541.803, -32.8686)
	使用技能("法力护盾")
	走到(786.666, -541.803, -32.8686,1)
	延时(200)
	while 坐标范围怪物数量(759.285, -554.135, -33.2717, 10) == 0 and 战斗中() do 
		延时(200)
		if HP() <= 1 then
			return
		end
	end
	if lvl==1 then
		使用技能("暴风雪(等级 1)")
	else
		if MP() > 1300 then
			使用技能("暴风雪")
		else
			使用技能("暴风雪(等级 1)")
		end
	end
	if cir % 2 == 1 then
		指向坐标(759.285, -554.135, -33.2717)
	else
		指向坐标(759.509, -553.262, -33.5204)
	end
	for i=1,25,1 do 
		if 坐标范围怪物数量(786.666, -541.803, -32.8686, 8) > 0 then 
			break
		end
		延时(300)
		if HP() == 0 then
			break
		end
	end
	走到(795.966, -531.181, -46.8516)
	朝向坐标(807.761, -507.303, -41.1352)
	闪现走到(807.761, -507.303, -41.1352)
	走到(797.112, -496.481, -39.9121,0,0,0.5)
	朝向坐标(784.332, -492.69, -40.0008)
	使用技能("寒冰护体")
	走到(784.332, -492.69, -40.0008,1)
	上树() --下面
	if 绷带回血() then
		延时(4000)
		while MLD_坐标范围精英数量(766.92, -475.087, -40.5517,15) ==0 do 
			延时(100)
			if 精英剩余数量() == 0 or HP() <= 1 then
				return
			end
			延时(100)
		end
	else
		回血()
		if MLD_坐标范围精英数量(781.26, -497.573, -42.8242,10) > 0 then
			使用技能("冰霜新星(等级 1)")
			延时(1400)
		end
		while MLD_坐标范围精英数量(766.92, -475.087, -40.5517,15) ==0 do 
			延时(200)
			if 精英剩余数量() == 0 or HP() <= 1 then
				return
			end
			延时(100)
		end
		if lvl == 1 then
			使用技能("暴风雪(等级 1)")
		else
			if MP() > 1300 then
				使用技能("暴风雪")
			elseif 存在BUFF("节能施法") then
				使用技能("暴风雪")
			else
				使用技能("暴风雪(等级 1)")
			end
		end
		x,y,z = 最前坐标(2)
		if x<780 then
			指向坐标(767.504, -475.74, -40.1071)
		else
			指向坐标(x,y,z+1.5)
		end
		延时(1000)
		for i=1,12 do 
			延时(500)
			if not 读条中() then
				break
			end
			--[[if MLD_坐标范围精英数量(784.771, -491.128, -40.0365,8) > 0 then
				使用技能("冰霜新星(等级 1)")
				延时(1400)
				break
			end--]]
		end
		
		x,y,z = 最前坐标(2)
		if x==0 and y==0 and z==0 then
			if 低处下雪() then
			else
				使用技能("暴风雪(等级 1)")
				指向坐标(767.504, -475.74, -40.1071)
			end
			for iii=1,13 do 
				延时(500)
				if not 读条中() then
					break
				end
			end
		end
	end
	local fight=0
	x,y,z = 最前坐标(2)
	while x~=0 and y~=0 and z~=0 do
		if z<-40 then
			if MP()>3000 then
				使用技能("暴风雪")
			elseif 存在BUFF("节能施法") then
				使用技能("暴风雪")
			else
				使用技能("暴风雪(等级 1)")
			end
		else
			if MP()>3000 then
				使用技能("暴风雪")
			elseif 存在BUFF("节能施法") then
				使用技能("暴风雪")
			else
				使用技能("暴风雪(等级 1)")
			end
		end
		指向坐标(x,y,z)
		for iii=1,14 do 
			延时(500)
			if not 读条中() then
				break
			end
		end
		if HP() == 0 then
			break
		end
		x,y,z = 最前坐标(2)
		if 精英剩余数量() == 0 or HP() <= 1 then
			return
		end
	end
	清除目标()
end
function 传送处理()
	GM传送处理()
	local map = 地图名()
	if map == "奥格瑞玛" then
		延时(10000)
		if 背包物品数量("传送符文") < 5 then
			路径走到("奥格瑞玛法师传送到飞行点",1474.09, -4217.54, 42.9589)
			自动寻路(1634.97, -4265.83, 49.0335)
			num=背包物品数量("传送符文")
			if num < 5 then
				走到(1684.65, -4277.89, 32.0049)
				走到(1716.2, -4303.71, 30.3827)
				走到(1730.22, -4327.14, 28.7524,1)
				走到(1743.38, -4318.63, 33.3815,1)
				打开NPC("霍苏斯")
				延时(1000)
				购买物品(7,20-num)
				走到(1730.22, -4327.14, 28.7524,1)
			end
			自动寻路(1686.37, -4461.68, 18.8211)
			打开NPC("拍卖师萨苏恩")
			t=0
			while 地图名() == "暴风城" do
				延时(60000)
				t=t+1
				if t>50 then
					break
				end
				跳()
			end
			if 地图名() == "暴风城" then
				炉石回城()
			end
			
		end
	elseif map == "暴风城" then
		if 小地图名() == "巫师圣殿" then
			走到(-8991.76, 848.053, 29.6207,1)
			打开NPC("拉瑞麦尼·普尔度")
			延时(1000)
			对话选项(1)
			延时(1000)
			学习技能()
			延时(1000)
			走到(-8990.52, 861.724, 29.6207,1)
			打开NPC("詹妮亚·坎农")
			对话选项(1)
			延时(1000)
			for i=1,15 do
				学习技能()
				延时(2000)
			end
			执行脚本("暴风城传送出门.lua")
			走到(-8949.44, 888.771, 108.102)
			延时(300)
			走到(-8950.17, 897.858, 109.177,1)
			打开NPC("欧文·沃弗恩")
			延时(1000)
			对话选项(1)
			延时(1000)
			num=背包物品数量("传送符文")
			if num < 5 then
				延时(1000)
				购买物品(7,20-num)
			end
			走到(-8949.47, 889.04, 108.103)
			走到(-8966.65, 875.67, 106.153,1)
		end
		自动寻路(-8809.82, 648.052, 94.3843)
		走到(-8805.09, 664.28, 96.2001)
		走到(-8823.24, 666.077, 95.4254,1)
		打开NPC("拍卖师希尔顿")
		t=0
		while 地图名() == "暴风城" do
			延时(60000)
			t=t+1
			if t>50 then
				break
			end
			跳()
		end
		if 地图名() == "暴风城" then
			炉石回城()
		end
	elseif 在副本() then
		t=0
		while 在副本() do
			延时(60000)
			t=t+1
			if t>50 then
				break
			end
			跳()
		end
		炉石回城()
	end
	--[[退出游戏()
	重启脚本()--]]
end
function 上台子()
	if HP() <= 1 then
		return
	end
	local at=70
	x,y,z = 当前坐标()
	if z>-42 then
		return
	end
	if not 在坐标范围(781.498, -497.127, -42.7763,30) then
		传送处理()
		return
	end
	使用技能("寒冰护体")
	--走到(782.195, -496.069, -42.6161,1,0,1.4)
	朝向坐标(783.468, -493.808, -41.0609) --783.468, -493.808, -41.0609
	x,y,z = 当前坐标()
	if y <= -496.9 then
		按键("w",1)
		延时(90)
		按键("w",2)
	end
	x,y,z = 当前坐标()
	if y >= -496.5 then
		按键("s",1)
		延时(120)
		按键("s",2)
		at=70
	end
	延时(20)
	at=30
	朝向坐标(783.468, -493.808, -41.0609) --783.731, -493.198, -40.3067
	按键("w",1)
	按键("space")
	延时(50)
	按键("w",2)
	延时(550)
	按键("w",1)
	延时(150)
	按键("w",2)
end
fztime=os.clock()
function 上树()
	if HP() <= 1 then
		return
	end
	if not 在坐标范围(781.498, -497.127, -42.7763,30) then
		传送处理()
		return
	end
	x,y,z = 当前坐标()
	if z > -42.556 then
		使用技能("寒冰护体")
	end
	朝向坐标(781.589, -497.322, -42.7763)
	按键("w",1)
	for i=1,50 do 
		延时(10)
		x,y,z = 当前坐标()
		if z < -42.5 then
			break
		end
	end
	按键("w",2)
	--走到(781.7, -497.002, -42.7158,1,0,1)
	走到(781.589, -497.322, -42.7763,1,0,1.2) --下面
	if os.clock()-fztime>24 and 坐标范围怪物数量(781.205, -521.436, -50.842,6,"毒劣魔") < 3 then
		if 反制小鬼() then
			fztime=os.clock()
			清除目标()
		end
	end
end
function 上台子2()
	if HP() <= 1 then
		return
	end
	if not 在坐标范围(781.498, -497.127, -42.7763,30) then
		传送处理()
		return
	end
	x,y,z = 当前坐标()
	if z>-42 then
		return
	end
	朝向坐标(784.332, -492.69, -40.0008)
	使用技能("寒冰护体")
	if not 存在BUFF("寒冰护体|法力护盾") then
		cdtime=os.clock()
		使用技能("法力护盾")
	end
	右键寻路(784.366, -492.213, -40.0146)
	跳()
		延时(1400)
	--[[走到(782.079, -496.19, -42.6475,1)
	延时(50)
	朝向坐标(784.332, -492.69, -40.0008)
	按键("w",1)
	延时(50)
	跳()
	for i=1,7 do
		延时(100)
		x,y,z = 当前坐标()
		if z>-40.08 then
			break
		end
	end
	按键("w",2)--]]
	--走到(782.079, -496.19, -42.6475,0,0,0.5)
	--走到(784.332, -492.69, -40.0008,1,1,0.3)
	--走到(784.344, -491.667, -40.0322,1,1,0.5)--上面
end
function 上树2()
	if HP() <= 1 then
		return
	end
	if not 在坐标范围(781.498, -497.127, -42.7763,30) then
		传送处理()
		return
	end
	--[[if 存在DEBUFF("断筋") then
		使用技能("急速冷却")
		使用技能("寒冰屏障")
		延时(200)
		取消BUFF("寒冰屏障")
	end--]]
	x,y,z = 当前坐标()
	if z <-42 then
		return
	end
	朝向坐标(781.076, -497.592, -42.8866)
	右键寻路(781.076, -497.592, -42.8866)
	if z > -41 then
		使用技能("寒冰护体")
		--[[if not 存在BUFF("寒冰护体|法力护盾") then
			cdtime=os.clock()
			使用技能("法力护盾")
		end--]]
	end
	x,y,z = 当前坐标()
	while z > -42.7 and HP() > 0 do 
		延时(200)
		x,y,z = 当前坐标()
	end
	--走到(781.498, -497.127, -42.7763,1) --下面
end
function 树杈上打怪()
	if 精英剩余数量() == 0 or HP() <= 1 or 地图名() ~= "玛拉顿" then
		延时(500)
		return
	end
	local done=0
	while HP()>1 do
		if 精英剩余数量() == 0 or HP() <= 1 then
			return
		end
		回蓝()
		回血()
		if 低处下雪() then
			local st=os.clock()
			延时(500)
			if 读条中() then
				延时(500)
				for ii=1,60,1 do 
					延时(100)
					if not 读条中() then
						break
					end
					if MLD_坐标范围精英数量(784.771, -491.128, -40.0365, 8) < 3 and 需上() then
						done=1
						break
					end
					if os.clock()-st>=7 then
						break
					end
				end
			end
			if done == 1 then
				return
			end
			if 存在BUFF("寒冰护体") == false then
				使用技能("寒冰护体")
				if done == 1 or 需上() then
					return
				end
				延时(200)
				if 存在BUFF("寒冰护体") then
					for iii=1,10 do
						延时(100)
						if 需上() then
							done=1
							break
						end
					end
				end
			end
			if done==1 then
				return
			end
		else
			return
		end
	end
end
function 台子上打怪()
	if 精英剩余数量() == 0 or HP() <= 1 or 地图名() ~= "玛拉顿" then
		return
	end
	local done=0
	local f=0
	while HP()>1 do
		if 精英剩余数量() == 0 or HP() <= 1 or 小鬼剩余数量() > 8 and HP()/MaxHP() < 0.8 and 精英剩余数量() > 10 then
			return
		end
		if 需下() or 需要跑圈() then
			done=1
			return
		end
		回蓝()
		回血()
		if 高处下雪() then
			local st=os.clock()
			f=f+1
			延时(200)
			for ii=1,60,1 do 
				if 需下() then
					done=1
					return
				end
				延时(100)
				if not 读条中() then
					break
				end
				if os.clock()-st>=7.3 then
					break
				end
			end
			if f>2 and 小鬼剩余数量() > 8 and HP()/MaxHP() < 0.8 and 精英剩余数量() > 10 then
				return
			end
		else
			return
		end
	end
end
function 销毁低价物品()
	销毁物品("法力药水",1)
	while 背包物品数量("浮渣覆盖的袋子")>0 and HP()>1 do 
		使用物品("浮渣覆盖的袋子")
		延时(1000)
		销毁物品("法力药水",1)
		if 背包空格()==0 then
			销毁物品("浮渣覆盖的袋子",1)
		end
	end
	销毁物品("治疗药水",1)
	销毁物品("初级治疗药水",1)
	销毁物品("次级法力药水",1)
	销毁物品("初级法力药水",1)
	销毁物品("亚麻布|地根|荆棘|银叶|莓汁|熏肉|宝箱|魔皇|黑蘑|性之心|活根|南草|胡须|神花|卷轴|配方|结构图|设计图|图样：|跌打|斯之泪|力红")
	if 背包空格() < maxfree and not 炉石可用() then
		销毁物品("法甜|苏打|晶水")
		if 背包空格() < maxfree and not 炉石可用() then
			销毁物品("面包|丝绸")
		end
	end
	--[[if 存在技能("分解") then
		while 背包物品数量("花苗头饰") > 0 and 背包空格()>0 do
			运行宏("/cast 分解/n/use 花苗头饰")
			延时(5000)
		end
		while 背包物品数量("自然的拥抱") > 0 and 背包空格()>0 do
			运行宏("/cast 分解/n/use 自然的拥抱")
			延时(5000)
		end
		while 背包物品数量("蘑菇护甲") > 0 and 背包空格()>0 do
			运行宏("/cast 分解/n/use 蘑菇护甲")
			延时(5000)
		end
	end--]]
end
function 扫地阶段(lx,chu)
	if lx==nil then
		lx=1
	end
	if HP() > 1 then
		销毁物品("法力蓝宝石",1)
		销毁物品("法力红宝石",1)
		销毁物品("法力黄水晶",1)
		销毁物品("魔法肉桂面包",1)
		销毁物品("魔法晶水",1)
		MLD摸尸体(lx)
		if 在副本() then
			路径寻路("玛拉顿出副本")
			销毁低价物品()
		end
		if 队伍人数() > 1 then
			队伍拾取()
		end
		if 背包空格() < maxfree then
			--[[路径寻路("玛拉顿出副本")
			寻路结束()--]]
			回城售卖()
		else
			if 在副本() then
				if mldbuchu==nil or mldbuchu==0 then
					玛拉顿出本(chu)
				end
			end
		end
	else
		释放灵魂()
	end
end
function 扫地阶段2()
	if HP() > 1 then
		销毁物品("法力蓝宝石",1)
		销毁物品("法力红宝石",1)
		销毁物品("法力黄水晶",1)
		销毁物品("魔法肉桂面包",1)
		销毁物品("魔法晶水",1)
		MLD摸尸体2()
		if 在副本() then
			--闪现走到(768.207, -471.603, -40.9729,1)
			路径寻路("玛拉顿出副本")
			销毁低价物品()
		end
		if 队伍人数() > 1 then
			队伍拾取()
		end
		if 背包空格() < maxfree then
			--[[路径寻路("玛拉顿出副本")
			寻路结束()--]]
			回城售卖()
		else
			if 在副本() then
				玛拉顿出本()
			end
		end
	else
		释放灵魂()
	end
end
function 扫地阶段3(chu)
	if HP() > 1 then
		销毁物品("法力蓝宝石",1)
		销毁物品("法力红宝石",1)
		销毁物品("法力黄水晶",1)
		销毁物品("魔法肉桂面包",1)
		销毁物品("魔法晶水",1)
		MLD摸尸体3()
		if 在副本() then
			if mincaiyao >= 245 then
				if 坐标范围有采集物(716.341, -509.04, -36.413,6) then
					路径走到("玛拉顿出副本",721.4, -480.01, -41.0782)
					走到(717.421, -510.043, -36.3309,1)
					范围采集(5)
					走到(729.204, -516.251, -41.2953,1)
				end
			end
			--闪现走到(768.207, -471.603, -40.9729,1)
			销毁低价物品()
			路径寻路("玛拉顿出副本")
			销毁低价物品()
		end
		if 队伍人数() > 1 then
			队伍拾取()
		end
		if 背包空格() < maxfree then
			--[[路径寻路("玛拉顿出副本")
			寻路结束()--]]
			回城售卖()
		else
			if 在副本() then
				if mldbuchu==nil or mldbuchu==0 then
					路径寻路("玛拉顿出副本")
					玛拉顿出本(chu)
				end
			end
		end
	else
		释放灵魂()
	end
end
function MLD进本(cz)
	if cz~=nil then
		需要重置=0
	end
	local fb=0
	if HP() <= 1 then
		延时(1000)
		if 在副本() and HP() == 0 then
			fb=1
		end
		释放灵魂()
		if fb==0 then
			x,y,z = 尸体坐标()
			if x > -900 or x < -1520 then
				虚弱复活()
				延时(5000)
				if HP() > 1 then
					使用技能("冰甲术")
					上马()
					return
				end
			else
				if math.abs(x+1443.49) > 0.5 or math.abs(y-1973.37) > 0.5 then
					提示("副本外死亡")
					延时(1000)
					
					路径走到("玛拉顿完美复活",1194.16,2877.97,85.8749)
					--[[按键("w",1)
					延时(1500)
					复活()
					延时(300)
					使用技能("寒冰护体")
					延时(1500)
					if HP() > 1 then
						使用技能("冰甲术")
					end
					按键("w",2)--]]
				end
			end
		end
		路径寻路("玛拉顿完美复活")
		if HP() == 1 then
			if 背包空格() >= maxfree then
				if 需要重置==1 then
					队伍拾取()
					重置副本()
					需要重置=0
					if 已重置次数 ~= nil then
						已重置次数=已重置次数+1
						置重置次数(已重置次数)
					end
				end
			end
			延时(3000)
			复活()
			if HP()>=1 then
				朝向坐标(-1181.17, 2855.86, 85.2396)
				移动("前",5000)
				延时(1000)
				while 过图中() do 
					延时(1000)
				end
				延时(3000)
				寻路结束()
			elseif HP() == 0 then
				释放灵魂()
				return
			end
			while 过图中() do 
				延时(1000)
			end
			if not 在副本() and HP()==1 and not 可复活() then
				脱离卡死()
				延时(1000)
				虚弱复活()
				延时(1000)
				return
			end
			if not 在副本() and HP() >= 1 then
				走到(-1171.22, 2880.92, 85.3206,1)
				延时(1000)
				while not 在副本() and HP()>0 do 
					if 可复活() then
						复活()
					end
					朝向坐标(-1181.17, 2855.86, 85.2396)
					按键("w",1)
					使用技能("闪现术")
					延时(500)
					移动("前",5000)
					while 过图中() do 
						延时(1000)
					end
					延时(1000)
					if not 在副本() then
						走到(-1171.22, 2880.92, 85.3206,1)
						延时(15000)
					end
					if HP() == 0 then
						释放灵魂()
						路径寻路("玛拉顿")
						复活()
					end
				end
			end
		end
	end
	map = 地图名()
	if HP() > 1 and (map ~= "凄凉之地" and map ~= "玛拉顿" or not 在副本() or 背包空格()<maxfree) then
		回城售卖()
		if HP() > 0 then
			if 需要重置==1 then
				重置副本()
				需要重置=0
				if 已重置次数 ~= nil then
					已重置次数=已重置次数+1
					置重置次数(已重置次数)
				end
			end
		end
		玛拉顿进本()
	end
end
function 回复状态()
	if 等级() >= 50 then
		mmp=4000
	else
		mmp=2500
	end
	if MP()<mmp then
		回满()
	end
	if HP() == 0 then
		return
	end
	清除目标()
	跳()
	延时(200)
	while MP() > mmp do
		使用技能("奥术智慧")
		延时(1400)
		if 存在BUFF("奥术智慧") then
			break
		end
	end
	使用技能("冰甲术")
	延时(1400)
	回满()
	跳()
	延时(1000)
	if 背包物品数量("法力红宝石") < 1 then
		使用技能("制造魔法红宝石")
		延时(1500)
		while 读条中() do 
			延时(200)
		end
		延时(500)
	end
	if 背包物品数量("法力黄水晶") < 1 then
		使用技能("制造魔法黄水晶")
		延时(1500)
		while 读条中() do 
			延时(200)
		end
		延时(500)
	end
	if HP() == 0 then
		return
	end
	回满()
	跳()
	延时(1000)
end
function MLD一阶段()
	if 队伍人数() > 1 then
		自由拾取()
	end
	回复状态()
	if 种族() == "侏儒" and not 存在BUFF("精神错乱") and not 存在BUFF("呀啊啊啊啊") then
		使用物品("美味风蛇")
	end
end
function MLD拉怪()
	if HP() == 0 then
		return
	end
	跳()
	走到(751.262, -605.442, -33.186)
	走到(765.464, -603.991, -32.8351)
	走到(791.864, -592.619, -32.9057)
	走到(788.364, -579.399, -33.0661)
	闪现走到(778.759, -542.218, -34.3246)
	走到(783.055, -541.336, -34.0412,1)
	延时(1000)
	if HP() == 0 then
		return
	end
	--[[if 打开身边目标() then
		延时(7000)
	end--]]
	x,y,z = 怪物坐标("深腐践踏者")
	if z ~= 0 then
		选怪("深腐践踏者",100)
		while z < -49.5 do 
			if HP() == 0 then
				return
			end
			延时(500)
			x,y,z = 怪物坐标("深腐践踏者")
			if z == 0 then
				break
			end
		end
	end
	if HP() == 0 then
		return
	end
	使用技能("寒冰护体")
	延时(1500)
	使用技能("魔法抑制")
	if 存在技能ID(10140) then
		使用物品("魔法晶水")
		使用物品("魔法山泉水")
	else
		使用物品("魔法苏打水")
	end
	延时(7000)
	走到(793.711, -525.551, -46.0753,1)
	延时(100)
	使用技能("暴风雪(等级 1)")
	指向坐标(762.13, -516.808, -52.8902)
	延时(4000)
	走到(808.172, -516.203, -41.6402,0,0,0.5)
	走到(805.393, -500.958, -40.4509,0,0,0.5)
	使用技能("魔爆术(等级 1)")
	走到(784.6, -488.165, -40.1336,0,0,0.5)
	使用技能("寒冰护体")
	走到(766.929, -471.941, -41.03,0,0,0.5)
	使用技能("冰霜新星(等级 1)")
	走到(742.839, -470.899, -39.0849,0,0,0.5)
	使用技能("魔爆术(等级 1)")
	走到(736.261, -482.969, -40.9316,0,0,0.5)
	朝向坐标(737.597, -491.177, -40.8763)
	选怪("深腐践踏者",100)
	使用技能("法术反制")
	走到(737.597, -491.177, -40.8763,0,0,0.5)
	闪现走到(740.668, -518.828, -40.7623)
	朝向坐标(744.054, -532.396, -35.0943)
	选怪("深腐践踏者",100)
	使用技能("法术反制")
	走到(744.054, -532.396, -35.0943,0,0,0.5)
	选怪("深腐践踏者",100)
	使用技能("法术反制")
	走到(753.166, -539.797, -32.4282,0,0,0.5)
	使用技能("寒冰护体")
	走到(765.417, -540.856, -36.6416)
	走到(778.875, -535.412, -36.7197,1)
	延时(200)
	while 坐标范围怪物数量(759.285, -554.135, -33.2717, 10) == 0 do 
		延时(200)
		if HP() <= 1 then
			return
		end
	end
	使用技能("暴风雪(等级 1)")
	指向坐标(759.101, -554.002, -33.283)
	延时(7000)
	走到(792.598, -513.369, -52.8067)
	闪现走到(813.267, -477.465, -55.144)
	走到(820.337, -454.567, -56.3118)
	走到(802.043, -421.41, -53.5252)
	走到(803.299, -414.031, -54.5767)
	使用技能("寒冰护体")
	走到(823.172, -394.247, -58.6471, 1)
	范围选怪(856.248,-386.299,-64.1306,8)
	延时(100)
	使用技能("寒冰箭(等级 1)")
	延时(500)
	while 读条中() do 
		延时(100)
	end
	走到(818.509, -392.043, -59.117)
	闪现走到(795.779, -371.375, -59.1942)
	范围选怪(771.807,-348.971,-61.6844,10)
	使用技能("法术反制")
	延时(700)
	使用技能("法术反制")
	走到(796.623, -376.905, -59.0984)
	范围选怪(814.626,-377.309,-59.168,8)
	朝向坐标(802.434, -422.334, -53.5242)
	if HP() == 0 then
		return
	end
	跳()
	延时(300)
	朝向坐标(814.626,-377.309,-59.168)
	使用技能("火焰冲击(等级 1)")
	走到(802.434, -422.334, -53.5242)
	使用技能("冰霜新星(等级 1)")
	走到(806.899, -428.053, -53.7044)
	延时(400)
	使用技能("法力护盾")
	走到(828.715, -438.713, -56.2303)
	朝向坐标(841.345, -433.722, -56.1337)
	if HP() == 0 then
		return
	end
	跳()
	延时(200)
	朝向坐标(829.067,-446.719,-56.2932)
	使用技能("冰锥术(等级 1)")
	走到(841.345, -433.722, -56.1337)
	走到(848.231, -430.806, -54.8314)
	闪现走到(879.538, -409.719, -51.9091)
	范围选怪(894.477,-406.576,-52.7567,5)
	朝向坐标(881.927, -380.961, -52.0494)
	if HP() == 0 then
		return
	end
	跳()
	延时(200)
	朝向坐标(894.477,-406.576,-52.7567)
	使用技能("火焰冲击(等级 1)")
	走到(879.15, -384.466, -52.0495)
	使用技能("寒冰护体")
	走到(875.658, -363.416, -52.0485)
	使用技能("魔爆术(等级 1)")
	走到(860.359, -345.361, -51.6704)
	范围选怪(865.298,-331.491,-50.2814)
	朝向坐标(827.889, -344.116, -51.8433)
	if HP() == 0 then
		return
	end
	跳()
	延时(200)
	朝向坐标(868.174,-335.398,-50.2694)
	使用技能("火焰冲击(等级 1)")
	走到(832.82, -345.924, -52.003)
	使用技能("冰霜新星(等级 1)")
	走到(805.392, -350.678, -51.6764)
	使用技能("寒冰护体")
	走到(802.037, -348.377, -51.7226)
	走到(784.04, -338.172, -50.1994)
	使用技能("法力护盾")
	走到(767.821, -332.316, -50.9622)
	if HP() == 0 then
		return
	end
	反身吹风()
	走到(744.799, -333.104, -50.633)
	闪现走到(661.785, -323.833, -52.0189)
	使用技能("寒冰护体")
	走到(645.824, -312.992, -52.0189)
	使用技能("冰霜新星(等级 1)")
	走到(645.579, -286.467, -52.5489)
	使用技能("寒冰护体")
	if HP() == 0 then
		return
	end
	范围选怪(616.387, -257.019, -53.0956, 20, "践踏")
	走到(650.159, -253.16, -53.2761)
	使用技能("法术反制")
	走到(653.139, -236.646, -64.3912)
	朝向坐标(657.819, -205.953, -64.3912)
	闪现走到(657.819, -205.953, -64.3912)
	走到(663.06, -207.045, -62.8846)
	走到(672.492, -211.44, -59.9411)
	范围选怪(660.342, -225.367, -64.3912,12)
	走到(676.23, -214.082, -60.4412,1)
	朝向坐标(666.342, -225.367, -64.3912)
	延时(100)
	使用技能("寒冰箭(等级 1)")
	延时(1500)
	使用技能("暴风雪(等级 1)")
	指向坐标(649.314, -209.068, -60.3911)
	范围选怪(684.78, -196.663, -60.5195)
	延时(6400)
	朝向坐标(686.322,-196.2,-60.5154)
	使用技能("火焰冲击(等级 1)")
	走到(678.81, -229.569, -58.6202)
	使用技能("寒冰护体")
	走到(687.563, -253.006, -53.0719)
	走到(691.964, -255.313, -53.0529)
	使用技能("魔爆术(等级 1)")
	走到(690.806, -255.105, -53.0547)
	使用技能("魔爆术(等级 1)")
	走到(696.324, -242.473, -49.9384)
	闪现走到(717.331, -219.962, -47.2508)
	使用技能("魔爆术(等级 1)")
	走到(702.878, -199.916, -47.262)
	使用技能("冰霜新星(等级 1)")
	走到(689.714, -181.469, -48.6497)
	使用技能("寒冰护体")
	走到(682.194, -170.043, -48.7286)
	使用技能("魔爆术(等级 1)")
	走到(664.316, -162.509, -50.6785)
	使用技能("魔爆术(等级 1)")
	--[[使用技能("急速冷却")
	使用技能("冰霜新星(等级 1)")--]]
	走到(651.674, -159.396, -52.1103)
	使用技能("法力护盾")
	走到(623.876, -156.285, -54.7834,1)
	--[[范围选怪(597.286,-159.13,-55.1889)
	使用技能("法术反制")--]]
	闪现走到(628.964, -189.824, -52.1438,1)
	延时(500)
	走到(621.669, -237.343, -55.3467,1)
	范围选怪(613.888,-205.292,-64.3985,8)
	朝向坐标(613.888,-205.292,-64.3985)
	延时(1400)
	使用技能("寒冰箭(等级 1)")
	延时(500)
	while 读条中() do 
		延时(100)
	end
	延时(300)
	走到(629.653, -282.032, -53.4191)
	if MP() < 4000 then
		使用物品("法力红宝石")
		延时(200)
		if MP() < 600 then
			使用物品("法力黄水晶")
		end
	end
	闪现走到(641.536, -324.428, -52.0381)
	走到(640.573, -337.134, -52.0204)
	使用技能("寒冰护体")
	走到(627.176, -352.929, -52.0208)
	使用技能("法力护盾")
	走到(622.33, -357.485, -52.0193)
	走到(613.68, -368.543, -52.0185,1)
	使用技能("暴风雪(等级 1)")
	指向坐标(588.218, -383.807, -52.0205)
	延时(1500)
	使用技能("暴风雪(等级 1)")
	指向坐标(608.091, -399.767, -52.0185)
	延时(1500)
	if MP() < 2000 then
		使用物品("法力红宝石")
		延时(200)
		if MP() < 600 then
			使用物品("法力黄水晶")
		end
	end
	走到(622.029, -357.864, -52.0186)
	使用技能("冰霜新星(等级 1)")
	走到(628.344, -361.784, -52.0186)
	朝向坐标(636.91, -359.034, -52.0186)
	if 存在DEBUFF("断筋") then
		使用技能("寒冰屏障")
		延时(200)
		取消BUFF("寒冰屏障")
	end
	走到(636.91, -359.034, -52.0186)
	朝向坐标(648.405, -361.859, -52.0186)
	跳()
	延时(200)
	朝向坐标(640.573, -337.134, -52.0204)
	使用技能("冰锥术(等级 1)")
	朝向坐标(648.405, -361.859, -52.0186)
	if 存在DEBUFF("断筋") then
		使用技能("寒冰屏障")
		延时(200)
		取消BUFF("寒冰屏障")
	end

	走到(648.405, -361.859, -52.0186)
	闪现走到(688.48, -365.314, -52.2181)

	范围选怪(696.108,-372.306,-52.0192,8)
	走到(710.058, -349.689, -51.9105)
	使用技能("法术反制")
	走到(723.734, -335.434, -51.4976)
	使用技能("寒冰护体")
	走到(754.824, -349.395, -50.7262)
	走到(778.089, -366.192, -60.8207)
	走到(785.321, -374.054, -58.9556,1)
	if HP()<=1 then
		return
	end
	延时(500)
	使用技能("暴风雪(等级 1)")
	指向坐标(793.1313,-347.5857,-51.3452)
	延时(6000)
	闪现走到(799.252, -405.405, -57.2116)
	使用物品("法力红宝石")
	走到(803.02, -425.538, -53.7001)
	走到(820.607, -456.05, -56.3027)
	使用技能("法师护甲")
	走到(809, -484.866, -54.3675)
	走到(795.802, -499.837, -53.2484)
	闪现走到(779.193, -519.931, -51.7424)
	走到(782.678, -524.495, -49.5528)
	走到(789.625, -525.991, -47.3932)
	走到(798.571, -520.625, -43.3019)
	走到(802.75, -514.325, -41.5522)
	走到(802.367, -506.102, -40.8236)
	走到(799.762, -500.777, -40.2843)
	使用技能("寒冰护体")
	走到(795.659, -496.68, -39.9487)
	走到(784.3, -490.919, -40.0578,1)
	朝向坐标(784.319, -493.147, -39.9877)
	if HP() == 0 then
		return
	end
	延时(100)
	使用技能("唤醒")
	延时(1500)
	while 坐标范围怪物数量(792.749, -500.267, -53.0573) < 1 and HP()>0 do 
		延时(100)
	end
	if HP() == 0 then
		return
	end
	延时(1800)
	if MP() > 1300 then
		使用技能("暴风雪")
	else
		使用技能("暴风雪(等级 1)")
	end
	指向坐标(778.152, -516.777, -49.7173)
	延时(7000)
	if MP() > 1300 then
		使用技能("暴风雪")
	else
		使用技能("暴风雪(等级 1)")
	end
	指向坐标(782.517, -523.566, -49.1065)
	延时(7000)
	if HP() == 0 then
		return
	end
	走到(785.634, -488.177, -40.0987,1)
	for i=1,2,1 do
		if 高处下雪() then
			延时(200)
			for ii=1,30 ,1 do 
				if 读条中() then 
					延时(200)
				else
					break
				end
				if MLD_坐标范围精英数量(785.634, -488.177, -40.0987,11)>0 then
					break
				end
			end
		else
			break
		end
	end
	if HP() > 1 then
		需要重置=1
	end
end
function MLD杀怪(lvl)
	if lvl == nil then
		lvl=0
	end
	--[[if 无需跑圈() then
		上树()
		树杈上打怪()
		上台子()
		台子上打怪()
	else--]]
		跑圈(0,1,lvl)
--	end
	while 精英剩余数量() > 0 and HP() > 1 do 
		上树()
		树杈上打怪()
		上台子()
		台子上打怪()
		if 小鬼剩余数量() > 8 and HP()/MaxHP() < 0.8 and 精英剩余数量() > 10 or 需要跑圈() then
			使用技能("冰霜新星(等级 1)")
			跑圈(1,1,1)
		end
	end
end
function MLD收尾(sq,chu)
	清除目标()
	if HP() > 0 then
		使用技能("寒冰护体")
		延时(1500)
		上台子()
		使用技能("暴风雪")
		指向坐标(767.504, -475.74, -40.7071)
		for i=1,8 do
			延时(1000)
			if not 战斗中() or 坐标范围怪物数量(767.504, -475.74, -40.7071,12) == 0 then
				break
			end
		end
	end
	for i=1,2 do
		local f=0
		while 战斗中() and HP() > 0 do
			上台子()
			f=f+1
			local fight=0
			x,y,z = 最前坐标(0)
			while x~=0 and y~=0 and z~=0 and HP()>0 do
				使用技能("暴风雪")
				指向坐标(x,y,z)
				for i=1,7 do
					延时(1000)
					if not 读条中() or not 战斗中() or 坐标范围怪物数量(x,y,z,12) == 0 then
						break
					end
				end
				if not 存在BUFF("寒冰护体") then
					使用技能("寒冰护体")
					延时(500)
					if 存在BUFF("寒冰护体") then
						延时(1000)
					end
				end
				if MP() < 1300 then
					break
				end
				x,y,z = 最前坐标(0)
				fight = fight +1
				if fight > 1 then
					break
				end
			end
			清除目标()
			按键("Tab")
			延时(300)
			x,y,z = 目标坐标()
			if x~=0 and y~=0 and z~=0 then
				朝向坐标(x,y,z)
				使用技能("寒冰箭")
				while 读条中() do 
					延时(100)
				end
			end
			if MP() < 900 then
				使用物品("法力红宝石")
				延时(200)
				if MP() < 900 then
					使用物品("法力黄水晶")
				end
			end
			if not 存在BUFF("寒冰护体") then
				使用技能("寒冰护体")
				延时(500)
				if 存在BUFF("寒冰护体") then
					延时(1000)
				end
			end
		end
		延时(500)
	end
	if HP() > 1 then
		销毁物品("法力蓝宝石",1)
		销毁物品("法力红宝石",1)
		销毁物品("法力黄水晶",1)
		if sq == nil or sq==0 then
			上树()
			扫地阶段(1,chu)
		elseif sq==1 then
			上台子()
			玛拉顿出本(chu)
		end
	else
		释放灵魂()
	end 
end
function 教堂进本()
	if HP() == 0 then
		return
	end
	while not 在副本() and not 在坐标范围(2912.74, -825.01, 160.328,6) do
		if HP() == 0 then
			释放灵魂()
			延时(1000)
		end
		if HP() == 1 then
			x,y,z = 尸体坐标()
			路径走到("血色复活路径",x,y,z)
		end
		map = 地图名()
		if map=="希尔斯布莱德丘陵" or map == "银松森林" or zhenying == "联盟" and map=="提瑞斯法林地" then
			while not 在坐标范围(2907.68, -816.294, 160.327,30) do
				if 在坐标范围(-851.47, -545.129, 11.0545,120) then
					路径走到("南海镇到血色",-851.47, -545.129, 11.0545)
					发送邮件()
					自动寻路(-816.025, -573.763, 15.4053)
					打开NPC("罗伯特·埃比斯彻尔")
					延时(1000)
					出售垃圾()
					延时(1000)
					自动寻路(-796.697, -540.717, 16.4009)
				end
				map=地图名()
				if map=="希尔斯布莱德丘陵" or map=="银松森林" or map == "提瑞斯法林地" then
					if 炉石位置() == "南海镇" then
						路径走到("南海镇到血色",2907.68, -816.294, 160.327)
					end
				else
					路径走到("血色修理路径",949.777, -1434.65, 62.7751)
					打开NPC("莱纳德·波特")
					延时(1000)
					出售垃圾()
					延时(1000)
				end
				if 炉石位置() ~= "南海镇" then
					路径走到("血色修理路径",2907.68, -816.294, 160.327)
				end
				if HP() == 0 then
					释放灵魂()
				end
				if HP()==1 then
					x,y,z = 尸体坐标()
					自动寻路(x,y,z)
					复活()
				end
			end
		end
		路径走到("部落血色修理",2907.68, -816.294, 160.327)
		if 战斗中() then
			使用技能("寒冰护体")
			延时(1000)
			x,y,z = 目标坐标()
			朝向坐标(x,y,z)
			移动("后",300)
			while 战斗中() do 
				x,y,z = 目标坐标()
				朝向坐标(x,y,z)
				移动("后",100)
				延时(100)
				使用技能("寒冰箭")
				延时(300)
				while 读条中() do 
					延时(100)
				end
				延时(300)
			end
		end
		走到(2910.77, -815.987, 160.333,1,0,0.2)
		朝向坐标(2910.81, -818.836, 160.293)
		按键("w",1)
		延时(300)
		按键("w",2)
		if 打开身边目标()  then
			延时(500)
			while 读条中() do 
				延时(100)
			end
		end
		延时(300)
		按键("e",1)
		延时(500)
		按键("e",2)
		走到(2912.74, -825.01, 160.328,1)
	end
	while 在坐标范围(2917.16, -822.924, 160.327,40) and HP()>=1 do
		if not 在坐标范围(2912.74, -825.01, 160.328,6) then
			路径走到("血色复活路径",2915.11, -823.71, 160.328,1)
		else
			走到(2912.74, -825.01, 160.328,1)
		end
		朝向坐标(2926.97, -819.177, 160.328)
		if 是否队长() and HP()>1 then
			运行宏("/p 进本")
			延时(2000)
		end
		移动("前",3000)
		while 过图中() do 
			延时(1000)
		end
		if HP() == 1 then
			return
		end
		if not 在坐标范围(850.698, 1324.3, 18.6716,30) then
			走到(2911.51, -827.026, 160.327,1)
			延时(60000)
			if 等级() < 45 then
				return
			end
		end
		val = 检查挂机方案()
		if val == 11 or val == 22 then
			return
		end
	end
end
function 教堂出本()
	if HP() == 0 then
		return
	end
	if 在坐标范围(850.698, 1324.3, 18.6716,30) then
		走到(850.698, 1324.3, 18.6716,1)
		if 是否队长() and HP()>1 then
			运行宏("/p 出本")
			延时(2000)
		end
		朝向坐标(852.84, 1316.01, 18.6716)
		移动("前",6000)
		while 过图中() do 
			延时(1000)
		end
	end
end
function 血色进门处理()
	if 在坐标范围(853.661, 1324.07, 18.6734,30) == false or HP() <= 1 then
		return
	end
	队伍拾取()
	回复状态()
	使用技能("寒冰护体")
	延时(3000)
	范围选怪(876.352, 1322.24, 18.0061,10)
	延时(500)
	走到(853.661, 1324.07, 18.6734,1)
	延时(200)
	x,y,z = 目标坐标()
	if x~=0 and y~=0 then
		朝向坐标(x,y,z)
		for i=1,2 do 
			使用技能("寒冰箭")
			延时(200)
			while 读条中() do 
				延时(100)
			end
		end
		自由拾取()
		使用技能("火焰冲击")
		延时(1000)
		按键("W",1)
		延时(400)
		使用技能("冰锥术")
		延时(1400)
		使用技能("冰霜新星(等级 1)")
		按键("W",2)
		走到(874.635, 1325.63, 18.006,1)
		朝向坐标(862.529, 1322.85, 18.6764)
		延时(100)
		for i=1,2 do
			使用技能("寒冰箭")
			延时(300)
			while 读条中() do 
				延时(100)
			end
		end
		使用技能("火焰冲击")
		延时(1400)
		使用技能("冰锥术")
		x,y,z = 目标坐标()
		while x~=0 and y~=0 or 战斗中() do
			朝向坐标(x,y,z)
			if 在坐标范围(x,y,z,10) then
				if 技能可用("冰锥术") then
					使用技能("冰锥术")
				else	
					使用技能("魔爆术")
				end
				延时(1400)
			else
				使用技能("寒冰箭")
				延时(200)
				while 读条中() do 
					延时(100)
				end
				使用技能("火焰冲击")
				延时(1400)
			end
			x,y,z = 目标坐标()
		end
	end
	走到(870.851, 1325.83, 18.0061,1)
	自由拾取()
	while 技能可用("寒冰屏障") == false and HP()>1 do 
		延时(1000)
		提示("等待冰箱CD...")
	end
	使用技能("魔法抑制")
	延时(1400)
	回复状态()
	自由拾取()
end
function 教堂上台子()
	x,y,z = 当前坐标()
	朝向坐标(x+100, y, z)
	按键("E",1)
	while HP()>0 do
		x,y,z = 当前坐标()
		if y<1417.1 then
			按键("E",2)
			延时(100)
			跳()
			延时(100)
			按键("E",1)
			延时(500)
			--[[for iii=1,30,1 do 
				x,y,z = 当前坐标()
				if z > 19.65 or y<1416 then
					延时(100)
					按键("E",2)
					break
				else
					延时(50)
				end
			end--]]
			按键("E",2)
			延时(100)
			break
		else
			延时(50)
		end
	end
end
function 教堂杀怪()
	if HP() <= 1 then
		return
	end
	local dunt=0
	local nx,ny,nz=当前坐标()
	if HP() > 0 then
		延时(7000)
		按键("W",1)
		nx,ny,nz=当前坐标()
		while HP()>1 do 
			x,y,z = 当前坐标()
			if x~=nx or y~=ny then
				延时(200)
				使用技能("冰霜新星(等级 1)")
				break
			end
			延时(50)
		end
		延时(100)
		使用技能("冰霜新星(等级 1)")
		延时(100)
		使用技能("冰霜新星(等级 1)")
		if 移动速度() >=7 then
			延时(500)
		else
			延时(800)
		end
		按键("W",2)
		走到(956.487, 1420.06, 18.0232,1,0,3)
		朝向坐标(933.623, 1417.83, 18.0235)
		延时(1200)
		--x,y,z = 当前坐标()
		if 坐标范围怪物数量(956.487, 1420.06, 18.0232,9) > 0 then
			使用技能("急速冷却")
			使用技能("冰霜新星(等级 1)")
			按键("W",1)
		end	
		闪现走到(933.836, 1418.39, 18.0233,1)
		教堂上台子()
		回蓝()
		回血()
		延时(150)
		done=0
		for ii=1,2 do
			if MP() > 1300 then
				使用技能("暴风雪")
			else
				使用技能("暴风雪(等级 1)")
			end
			if ii==1 then
				指向坐标(965.385, 1418.63, 18.6779)
			else
				指向坐标(954.976, 1416.12, 19.7316)
			end
			for i=1,15 do 
				延时(500)
				if 坐标范围怪物数量(947, 1412, 19.7317,4) > 0 then
					done=1
					break
				end
				if not 读条中() then
					break
				end
			end
			if done==1 then
				break
			end
		end
		for f=1,9 do
			回蓝()
			回血()
			if 坐标范围怪物数量(955.351, 1415.91, 19.7318,12) == 0 then
				break
			end
			x,y,z = 当前坐标()
			朝向坐标(x+100, y, z)
			按键("Q",1)
			if not 存在BUFF("寒冰护体") then
				使用技能("寒冰护体")
				dunt=os.clock()
			end
			while HP()>0 do
				x,y,z = 当前坐标()
				if z<18.04 then
					按键("Q",2)
					延时(300)
					break
				end
			end
			按键("Q",2)
			if 坐标范围怪物数量(955.351, 1415.91, 19.7318,14) <=1 then
				break
			end
			while os.clock() - dunt <1.5 do 
				延时(100)
			end
			done=0
			for ii=1,2 do
				if MP() > 1300 then
					使用技能("暴风雪")
				else
					使用技能("暴风雪(等级 1)")
				end
				指向坐标(955.745-ii, 1417.56, 18.0233)
				for i=1,14 do 
					延时(500)
					if 坐标范围怪物数量(945, 1420, 19.7317,4) > 0 then
						done=1
						break
					end
					if not 读条中() then
						break
					end
					if 坐标范围怪物数量(955.351, 1415.91, 19.7318,14) <=1 then
						break
					end
				end
				for iii=1,1 do
					x,y,z=当前坐标()
					if 坐标范围怪物数量(x,y,z,8) > 0 then 
						使用技能("魔爆术")
						延时(800)
					else
						break
					end
				end
				if HP() == 0 or 坐标范围怪物数量(955.351, 1415.91, 19.7318,14)<=1 then
					break
				end
				if done==1 then
					break
				end
			end
			if HP() == 0 or 坐标范围怪物数量(955.351, 1415.91, 19.7318,14) <=1 then
				break
			end
			教堂上台子()
			done=0
			for ii=1,2 do
				if MP() > 1300 then
					使用技能("暴风雪")
				else
					使用技能("暴风雪(等级 1)")
				end
				指向坐标(954.976-ii, 1416.12, 19.7316)
				for i=1,14 do 
					延时(500)
					if 坐标范围怪物数量(948, 1412, 19.7317,4)>0 then
						done=1
						break
					end
					if not 读条中() then
						break
					end
					if HP() == 0 or 坐标范围怪物数量(955.351, 1415.91, 19.7318,14) <=1 then
						break
					end
				end
				for iii=1,1 do
					x,y,z=当前坐标()
					if 坐标范围怪物数量(x,y,z,8) > 0 then 
						使用技能("魔爆术")
						延时(800)
					else
						break
					end
				end
				if HP() == 0 or 坐标范围怪物数量(955.351, 1415.91, 19.7318,14) <=1 then
					break
				end
				if done==1 then
					break
				end
			end
			if HP() == 0 or 坐标范围怪物数量(955.351, 1415.91, 19.7318,14) <=1 then
				break
			end
		end
		if HP()>0 and 战斗中() then
			朝向坐标(961.92, 1419.3, 18.6779)
			按键("W",1)
			if not 存在BUFF("寒冰护体") then
				使用技能("寒冰护体")
				dunt=os.clock()
				延时(1400)
			end
			for i=1,2 do
				x,y,z=当前坐标()
				if 坐标范围怪物数量(x,y,z,10) > 0 then 
					使用技能("魔爆术")
					延时(1500)
				else
					延时(500)
				end
			end
			按键("W",2)
		end
		while HP()>0 and 战斗中() do 
			走到(961.92, 1419.3, 18.6779,1)
			x,y,z=当前坐标()
			while 坐标范围怪物数量(x,y,z,8) > 0 do 
				使用技能("魔爆术")
				延时(1400)
				if not 存在BUFF("寒冰护体") then
					使用技能("寒冰护体")
					dunt=os.clock()
				end
			end
			if 坐标范围怪物数量(963.718, 1419.4, 18.6781,10) > 0 then
				if MP() > 1300 then
					使用技能("暴风雪")
				else
					使用技能("暴风雪(等级 1)")
				end
				指向坐标(963.718, 1419.4, 18.6781)
				for i=1,15 do
					延时(500) 
					if not 读条中() then
						break
					end
				end
			end
			if not 存在BUFF("寒冰护体") then
				使用技能("寒冰护体")
				dunt=os.clock()
			end
			if 坐标范围怪物数量(963.718, 1419.4, 18.6781,10) == 0 then
				x,y,z= 目标坐标()
				if x~=0 and y~=0 then
					朝向坐标(x,y,z)
					使用技能("寒冰箭")
					延时(300)
					while 读条中() do 
						延时(100)
					end
				end
			end
		end
	end
end
function 血色拉怪1()
	if HP() <= 1 then
		return
	end
	if 在坐标范围(870.924, 1336.53, 18.0063,40)==false then
		return
	end
	自由拾取()
	走到(870.924, 1336.53, 18.0063,1)
	使用技能("寒冰护体")
	延时(15000)
	使用技能("法力护盾")
	走到(870.613, 1365.35, 18.0063)
	使用技能("魔爆术(等级 1)")
	走到(877.168, 1399.04, 18.334)
	朝向坐标(888.893, 1400.24, 18.6766)
	使用技能("魔爆术(等级 1)")
	走到(906, 1403.13, 18.0233)
	if not 战斗中() then
		走到(917.912, 1399.29, 18.0233)
		走到(932.406, 1398.72, 18.342)
		走到(932.339, 1391.94, 18.342,1)
		return
	end
	朝向坐标(898.063, 1418.72, 18.3507)
	使用技能("魔爆术(等级 1)")
	走到(898.063, 1418.72, 18.3507)
	朝向坐标(891.953, 1421.53, 18.678)
	使用技能("魔爆术(等级 1)")
	走到(891.953, 1421.53, 18.678)
	走到(892.903, 1435.25, 18.678)
	朝向坐标(916.817, 1434.39, 18.678)
	使用技能("寒冰护体")
	走到(906.411, 1436.32, 18.6763)
	闪现走到(932.455, 1434.58, 18.678)
	使用技能("魔爆术(等级 1)")
	走到(948.954, 1433.87, 18.678)
	朝向坐标(950.132, 1429.03, 18.0232)
	使用技能("魔爆术(等级 1)")
	走到(950.132, 1429.03, 18.0232)
	走到(957.166, 1422.12, 18.0232)
	走到(964.217, 1412.04, 18.6785)
	使用技能("冰霜新星(等级 1)")
	走到(964.126, 1397.47, 18.336)
	范围选怪(948.503, 1383.31, 18.4348,15)
	走到(963.759, 1386.05, 18.6777)
	使用技能("火焰冲击(等级 1)")
	走到(968.215, 1381.73, 18.769)
	走到(984.272, 1376.89, 24.2942)
	使用技能("法力护盾")
	走到(991.264, 1367.49, 27.2989)
	走到(999.539, 1365.37, 27.3052)
	使用技能("魔爆术(等级 1)")
	走到(1013.54, 1365.83, 27.3076)
	使用技能("魔爆术(等级 1)")
	走到(1025.31, 1376.06, 27.308)
	使用技能("魔爆术(等级 1)")
	走到(1032.63, 1395.14, 27.3102)
	使用技能("法力护盾")
	走到(1028.89, 1411.27, 27.3104)
	反身吹风()
	走到(1027.39, 1432.18, 27.3043)
	朝向坐标(985.906, 1429.93, 27.2988)
	使用技能("魔爆术(等级 1)")
	延时(1400)
	闪现走到(985.906, 1429.93, 27.2988)
	走到(980.649, 1422.1, 25.5934,1)
	朝向坐标(966.329, 1422.73, 19.8267)
	使用技能("寒冰护体")
	走到(966.329, 1422.73, 19.8267,1)
	朝向坐标(933.623, 1417.83, 18.0235)
	t=0
	while 坐标范围怪物数量(966.329, 1422.73, 19.8267,8) == 0 do 
		延时(100)
		t=t+1
		if t>60 then
			break
		end
	end
	使用技能("寒冰屏障")
	教堂杀怪()
end
function 血色拉怪2()
	if HP() <= 1 then
		return
	end
	if 在坐标范围(961.92, 1419.3, 18.6779,30) then
		走到(961.92, 1419.3, 18.6779)
		走到(964.903, 1404.39, 18.3421)
		走到(933.761, 1399.91, 18.3403)
		走到(932.468, 1392.01, 18.3403,1)
	end
	回复状态()
	while 技能可用("寒冰屏障") == false do 
		延时(1000)
		提示("等待冰箱CD...")
	end
	使用技能("寒冰护体")
	走到(917.708, 1366.76, 18.6778)
	走到(918.516, 1363.95, 18.6778,1)
	使用技能("暴风雪(等级 1)")
	指向坐标(897.505, 1378.08, 18.3508)
	范围选怪(891.096, 1360.71, 18.6777,7)
	延时(3000)
	使用技能("法术反制")
	范围选怪(916.455, 1385.45, 18.0214,10)
	朝向坐标(916.455, 1385.45, 18.0214)
	使用技能("火焰冲击(等级 1)")
	走到(933.105, 1363.25, 18.6777)
	闪现走到(962.441, 1363.72, 18.678)
	走到(965.97, 1377.86, 18.678)
	走到(983.747, 1376.76, 24.2955)
	使用技能("法力护盾")
	走到(990.772, 1346.18, 29.1466)
	朝向坐标(1013.46, 1347.24, 29.1466)
	使用技能("魔爆术(等级 1)")
	走到(1013.46, 1347.24, 29.1466)
	走到(1042.44, 1346.92, 29.1466)
	朝向坐标(1048.81, 1386.69, 27.3005)
	使用技能("魔爆术(等级 1)")
	走到(1048.81, 1386.69, 27.3005)
	走到(1056.58, 1391.03, 27.3995)
	朝向坐标(1056.49, 1407.43, 27.3949)
	使用技能("魔爆术(等级 1)")
	走到(1056.49, 1407.43, 27.3949)
	朝向坐标(1047.65, 1413.36, 27.2999)
	使用技能("魔爆术(等级 1)")
	走到(1047.65, 1413.36, 27.2999)
	走到(1046.53, 1420.98, 27.3003)
	反身吹风()
	走到(1041.6, 1452.4, 29.1468)
	朝向坐标(1020.59, 1452.46, 29.1468)
	使用技能("魔爆术(等级 1)")
	走到(1020.59, 1452.46, 29.1468)
	闪现走到(989.348, 1451.56, 29.1468)
	朝向坐标(984.302, 1429.3, 27.2995)
	使用技能("魔爆术(等级 1)")
	走到(984.302, 1429.3, 27.2995)
	
	走到(980.649, 1422.1, 25.5934,1)
	朝向坐标(966.329, 1422.73, 19.8267)
	使用技能("寒冰护体")
	走到(966.329, 1422.73, 19.8267,1)
	朝向坐标(933.623, 1417.83, 18.0235)
	t=0
	while 坐标范围怪物数量(966.329, 1422.73, 19.8267,8) == 0 do 
		延时(100)
		t=t+1
		if t>60 then
			break
		end
	end
	使用技能("寒冰屏障")
	教堂杀怪()
end
function 战斗处理()
	if 战斗中() then
		nx,ny,nz = 当前坐标()
		if zy == "潜行者" then
			使用技能("消失")
			寻路结束()
			延时(3000)
			if 战斗中() then
				while 战斗中() do 
					技能输出()
				end
			end
			if HP() > 1 and not 存在BUFF("潜行") then
				使用技能("潜行")
			end
			走到(nx,ny,nz,1)
		elseif zy == "法师" then
			使用技能("寒冰护体")
			延时(1500)
			while 战斗中() do 
				使用技能("寒冰护体")
				延时(1500)
				while 坐标范围怪物数量(nx,ny,nz,8,"自由的幽魂") > 0 do
					使用技能("魔爆术")
					延时(1300)
					if not 存在BUFF("寒冰护体") then
						使用技能("寒冰护体")
						延时(1400)
					end
				end
				while 有目标() and HP()>1 do
					x,y,z = 目标坐标()
					if x ~= 0 or y~=0 then
						朝向坐标(x,y,z)
					end
					使用技能("寒冰箭")
					延时(300)
					while 读条中() do 
						延时(300)
					end
					使用技能("火焰冲击")
					延时(1300)
					if not 存在BUFF("寒冰护体") then
						使用技能("寒冰护体")
						延时(1400)
					end
				end
			end
			延时(1500)
			if HP() > 1 and MP()<2000 then
				使用技能("唤醒")
				延时(8000)
				回满()
			end
		elseif zy == "德鲁伊" then
			while 战斗中() do 
				while 有目标() and HP()>1 do
					技能输出()
				end
			end
			使用技能("回春术")
			延时(1500)
			潜行()
		end
		走到(nx,ny,nz,1)
	end

end
function 部落初始化()
	local map = 地图名()
	if zhenying=="部落" then
		while not 在副本() and not 在坐标范围(2891.47, -817.534, 160.328,50) do
			map = 地图名()
			if map ~= "血色修道院" and map~= "提瑞斯法林地" and map ~= "银松森林" and map ~= "希尔斯布莱德丘陵" and map~="幽暗城" and 炉石可用() then
				炉石()
			end
			if zy=="法师" then
				map=地图名()
				if map ~= "血色修道院" and map~= "提瑞斯法林地" and map ~= "银松森林" and map ~= "希尔斯布莱德丘陵" and map~="幽暗城" then
					法师传送到("幽暗城")
				end
			end
			if 地图名() == "雷霆崖" then
				路径走到("雷霆崖旅店到草药训练师",-1252.88, 65.2824, 127.355)
				路径走到("雷霆崖到飞机点",-1197.18, 27.5771, 176.948)
				打开NPC("塔尔")
				延时(500)
				打开NPC("塔尔")
				延时(1000)
				if 坐飞机到("奥格瑞玛") then
				end
			end
			if 在飞机上() then
				while 在飞机上() do 
					延时(1000)
				end
				跳()
				延时(1000)
			end
			if 地图名() == "奥格瑞玛" then
				if 在坐标范围(1675.53, -4317.13, 61.4881,10) then
					走到(1665.2, -4336.71, 61.2462)
					走到(1666.31, -4345.79, 61.2465)
					走到(1659.19, -4378.68, 23.528,1,1)
				end
			end
			奥格到提瑞斯法林地()
			if 地图名() == "幽暗城" then
				x,y,z = 当前坐标()
				if z < 50 then
					路径走到("幽暗城法师传送到旅店电梯",1595.18, 176.086, -41.4176)
					坐船()
				end
				路径走到("布瑞尔旅店到幽暗电梯上",2200.53, 258.582, 35.8525)
			end
			if 地图名() == "提瑞斯法林地" or 地图名() == "血色修道院" then
				if 在坐标范围(2024.18, 289.523, 50.534,20) then
					自动寻路(2200.53, 258.582, 35.8525)
				end
				路径走到("部落血色修理",2911.95, -802.484, 160.333)
			end
			if HP() == 0 then
				释放灵魂()
				延时(1000)
			end
			if HP() == 1 then
				x,y,z = 尸体坐标()
				路径走到("血色复活路径",x,y,z,10)
				复活()
				延时(200)
				if not 在坐标范围(2911.95, -802.484, 160.333,10) then
					路径走到("部落血色修理",2911.95, -802.484, 160.333)
				end
			end
		end
		if 战斗中() then
			XS1进本()
		end
	else
		if 炉石位置() ~= "南海镇" and 炉石位置()~="铁炉堡" and not 在副本() then
			if 在路径范围("南海镇到血色") then
				路径走到("南海镇到血色",-855.53, -569.481, 11.0649)
				while 炉石位置() ~= "南海镇" and 炉石位置()~="铁炉堡" do
					if HP() == 0 then
						释放灵魂()
						延时(1000)
					end
					if HP() == 1 then
						x,y,z = 尸体坐标()
						自动寻路(x,y,z,10)
						复活()
					end
					路径走到("南海镇到血色",-855.53, -569.481, 11.0649)
					if HP() > 1 then
						打开NPC("旅店老板安德森")
						延时(1000)
						对话选项(1)
						延时(1000)
						运行宏("/click StaticPopup1Button1")
						延时(1000)
					end
				end
			end
		end
		map = 地图名()
		if map ~= "血色修道院" and map~= "提瑞斯法林地" and map ~= "银松森林" and map ~= "希尔斯布莱德丘陵" and map~="铁炉堡" and map~="湿地" and map~="尘泥沼泽" and 炉石可用() then
			炉石()
		end
		if 地图名() == "尘泥沼泽" then
			塞拉摩到铁炉堡()
		end
		if 地图名() == "铁炉堡" then
			if zy == "法师" then
				法师补充()
			end
			if zy == "潜行者" then
				盗贼补充()
			end
			提升草药技能()
			自动寻路(-4822.16, -1153.94, 502.209)
			if 打开NPC("格莱斯·瑟登") then
				延时(500)
			elseif 打开NPC("格莱斯·瑟登") then
				延时(500)
			end
			if 坐飞机到("南海镇") then
				
			end
		end
		while 在飞机上() do 
			延时(1000)
		end
		if 地图名() == "铁炉堡" or 在路径范围("铁炉堡到南海镇") then
			while not 在坐标范围(-855.933, -570.023, 11.0649,20) do
				if HP() == 0 then
					释放灵魂()
					虚弱复活()
				end
				路径走到("铁炉堡到南海镇",-855.933, -570.023, 11.0649)
			end
			if 在路径范围("南海镇到血色") then
				路径走到("南海镇到血色",-715.574, -513.109, 26.3778)
				打开NPC("达尔拉·哈瑞斯")
				延时(500)
			end
		end
		while not 在副本() and not 在坐标范围(2911.95, -802.484, 160.333,60) do
			路径走到("南海镇到血色",2911.95, -802.484, 160.333)
			swdd=0
			if HP() == 0 then
				if 在路径范围("血色复活路径") then
					swdd=0
				else
					swdd=1
				end
				释放灵魂()
				延时(1000)
				if swdd == 1 then
					虚弱复活()
					路径走到("血色复活路径",2911.95, -802.484, 160.333)
				end
			end
			if HP() == 1 then
				x,y,z = 尸体坐标()
				if 在路径范围("血色复活路径") then
					路径走到("血色复活路径",x,y,z,25)
				else
					自动寻路(x,y,z,25)
				end
				复活()
				延时(200)
				if not 在坐标范围(2911.95, -802.484, 160.333,40) then
					路径走到("南海镇到血色",2911.95, -802.484, 160.333)
				end
			end
		end
		if 战斗中() then
			XS1进本()
		end
	end
end
function 血色复活1()
	local fbname=""
	if HP()==0 then
		if 在副本() then
			fbname=地图名()
		end
		释放灵魂()
	end
	if HP()==1 then
		x,y,z = 尸体坐标()
		路径走到("血色复活路径",x,y,z,15)
		复活()
		延时(300)
		if zy == "潜行者" then
			while not 存在BUFF("潜行") and HP()>1 do 
				使用技能("潜行")
				延时(500)
			end
		end
		if HP() == 1 then
			XS1进本()
		end
	end
end
function XS1进本()
	if HP()==0 then
		return
	end
	if not 在副本() then
		if 在坐标范围(2888.61, -826.871, 160.331,35) then
			while true do
				x,y,z= 当前坐标()
				if y<-826.5 then
					if zy == "潜行者" then
						while 存在BUFF("潜行") and HP()>1 do 
							取消BUFF("潜行")
							延时(500)
						end
					elseif zy=="法师" then
						使用技能("冰甲术")
						延时(1500)
						使用技能("寒冰护体")
					end
					走到(2888.39, -833.456, 160.327)
					走到(2889.64, -829.396, 160.33,1)
					打开身边目标()
					延时(1000)
					朝向坐标(2883.05, -822.697, 160.328)
					按键("w",1)
					if zy=="潜行者" then
						使用技能("潜行")
						延时(2000)
					else
						延时(1700)
					end
					按键("w",2)
					x,y,z = 当前坐标()
					if y>-825 then
						break
					end
				else
					break
				end
			end
		end
		if 在坐标范围(2883.05, -822.697, 160.328,30) then
			if zy == "潜行者" then
				while not 存在BUFF("潜行") and HP()>1 do 
					使用技能("潜行")
					延时(500)
				end
			end
			if zy == "潜行者" then
				走到(2892.43, -814.097, 160.888)
			else
				走到(2887.78, -816.573, 160.333,1)
			end
			if zy=="法师" then
				闪现走到(2914.03, -803.942, 160.333,1)
			else
				走到(2914.03, -803.942, 160.333,1)
			end
		end
		if 在坐标范围(2914.03, -803.942, 160.333,25) then
			走到(2915.77, -801.63, 160.333,1)
			朝向坐标(2917.02, -801.131, 160.333)
			while not 在副本() and HP()>0 do 
				按键("w",1)
				延时(3000)
				按键("w",2)
				延时(4000)
				while 过图中() do 
					延时(1000)
				end
				延时(1000)
				if 在副本() and 在坐标范围(1687.27, 1050.09, 18.6773,30) then
					延时(1000)
					break
				else
					走到(2912.23, -803.128, 160.333,1)
					战斗处理()
					延时(60000)
					走到(2914.96, -801.938, 160.333,1)
					朝向坐标(2917.02, -801.131, 160.333)
				end
				val = 检查挂机方案()
				if val == 11 or val == 22 then
					return
				end
			end
		end
	end
end
function XS2进本()
	if HP()==0 then
		return
	end
	if not 在副本() then
		if zy == "潜行者" then
			while not 存在BUFF("潜行") and HP()>1 do 
				使用技能("潜行")
				延时(500)
			end
		elseif zy=="法师" then
			使用技能("寒冰护体")
		end
		if 在坐标范围(2912.23, -803.128, 160.333,15) then
			走到(2895.78, -813.15, 160.333)
			走到(2872.51, -819.602, 160.333,1)
		end
		if 在坐标范围(2872.51, -819.602, 160.333,15) then
			走到(2872.51, -819.602, 160.333)
			走到(2869.63, -820.664, 160.333,1)
			朝向坐标(2867.47, -821.46, 160.333)
			while not 在副本() and HP()>0 do 
				按键("w",1)
				延时(3000)
				按键("w",2)
				延时(4000)
				while 过图中() do 
					延时(1000)
				end
				延时(1000)
				if 在副本() then
					break
				else
					走到(2872.51, -819.602, 160.333,1)
					战斗处理()
					延时(60000)
					走到(2869.63, -820.664, 160.333,1)
					朝向坐标(2867.47, -821.46, 160.333)
				end
				val = 检查挂机方案()
				if val == 11 or val == 22 then
					return
				end
			end
		end
	end
end
function XS3进本()
	if HP()==0 then
		return
	end
	if not 在副本() then
		if zy == "潜行者" then
			while not 存在BUFF("潜行") and HP()>1 do 
				使用技能("潜行")
				延时(500)
			end
		elseif zy=="法师" then
			使用技能("寒冰护体")
		end
		if 在坐标范围(2870.33, -820.282, 160.333,10) then
			while true do
				走到(2888.62, -825.108, 160.334,1)
				延时(500)
				血色开门()
				延时(500)
				while 读条中() do 
					延时(300)
				end
				延时(500)
				朝向坐标(2886.7, -835.639, 160.328)
				按键("w",1)
				延时(1000)
				按键("w",2)
				x,y,z = 当前坐标()
				if y<-829 or HP()==0 then
					break
				end
			end
			走到(2886.7, -835.639, 160.328,1)
		end
		if 在坐标范围(2886.7, -835.639, 160.328,6) then
			走到(2886.7, -835.639, 160.328,1)
			朝向坐标(2883.67, -836.909, 160.328)
			while not 在副本() and HP()>0 do 
				按键("w",1)
				延时(3000)
				按键("w",2)
				延时(4000)
				while 过图中() do 
					延时(1000)
				end
				延时(1000)
				if 在副本() then
					break
				else
					走到(2886.7, -835.639, 160.328,1)
					战斗处理()
					延时(60000)
					朝向坐标(2883.67, -836.909, 160.328)
				end
				val = 检查挂机方案()
				if val == 11 or val == 22 then
					return
				end
			end
		end
	end
end
function XS0()
	血色复活1()
	教堂进本()
	if 在副本() then
		if 在坐标范围(853.179, 1319.18, 18.6714,20) then
			if zy == "德鲁伊" then
				使用技能("野性印记")
				延时(1500)
				使用技能("清晰预兆")
				延时(1500)
				使用技能("荆棘术")
				延时(1500)
			end
			走到(856.584, 1321.27, 18.6728)
			走到(867.481, 1325.45, 18.0061)
			走到(870.948, 1347.82, 18.0061)
			走到(870.967, 1365.15, 18.0061)
			走到(870.936, 1383.09, 18.0061)
			走到(876.062, 1397.48, 18.0061)
			走到(880.247, 1399.24, 18.6766)
			走到(899.016, 1398.71, 18.0239,1)
		end
		if 在坐标范围(899.016, 1398.71, 18.0239,20) then
			潜行()
			走到(906.2, 1405.23, 18.0239)
			走到(916.328, 1406.05, 18.0239)
			走到(919.59, 1399.08, 18.5087)
			走到(933.172, 1399.21, 18.3415,1)
			范围采集(20)
			mincaiyao,maxcaiyao = 专业信息("草药学")
			if mincaiyao >= 170 then
				if 坐标范围有采集物(914.773, 1381.86, 18.0142,6) then
					走到(923.899, 1394.83, 18.891)
					走到(918.979, 1383.62, 18.0233,1)
					战斗处理()
					走到(918.979, 1383.62, 18.0233,1)
					范围采集(10)
					走到(919.78, 1388.37, 18.5086)
					走到(927.385, 1390.61, 18.3429,1,1)
					战斗处理()
					走到(927.259, 1400.46, 18.3429,1)
				end
			end
			走到(928.487, 1407.52, 18.3427,1)
			走到(934.336, 1415.61, 19.7306,1)
		end
		if 在坐标范围(934.336, 1415.61, 19.7306,30) then
			mincaiyao,maxcaiyao = 专业信息("草药学")
			if mincaiyao >= 170 then
				范围采集(30)
				战斗处理()
				范围采集(30)
				战斗处理()
				走到(935.236, 1419.04, 18.0235)
				走到(934.336, 1415.61, 19.7306,1,1)
			end
			走到(959.76, 1408.08, 19.7466,1)
			潜行()
			
			走到(967.581, 1408.68, 19.8639)
			走到(971.879, 1415.42, 20.5497)
			走到(989.534, 1415.49, 24.2954)
			走到(990.14, 1430.68, 27.2987)
			走到(1000.74, 1429.55, 27.3066,1)
		end
		if 在坐标范围(1000.74, 1429.55, 27.3066,30) then
			if 坐标范围有采集物(997.709, 1402.12, 27.1375,10) then
				走到(997.709, 1402.12, 27.1375,1,1)
				范围采集(10)
				战斗处理()
				范围采集(10)
				走到(1000.74, 1429.55, 27.3066,1)
				潜行()
			end
			走到(1009.7, 1429.56, 27.3122,1)
			走到(1023.89, 1423.79, 27.3092,1)
		end
		if 在坐标范围(1023.89, 1423.79, 27.3092,20) then
			mincaiyao,maxcaiyao = 专业信息("草药学")
			if mincaiyao >= 170 then
				范围采集(40)
				战斗处理()
				范围采集(40)
				战斗处理()
				走到(1023.89, 1423.79, 27.3092,1)
			end
			潜行()
			走到(1016.64, 1398.47, 27.1362,1,1)
			走到(1020.46, 1376.7, 28.7831,1)
			mincaiyao,maxcaiyao = 专业信息("草药学")
			if mincaiyao >= 170 then
				范围采集(40)
				战斗处理()
				范围采集(40)
				战斗处理()
				走到(1014.56, 1380.39, 27.1363,1)
			end
		end
		if 在坐标范围(1014.56, 1380.39, 27.1363,30) then
			潜行()
			走到(992.418, 1383.45, 28.8389)
			走到(965.217, 1384.29, 18.6781)
			走到(964.018, 1386.12, 18.6778)
			走到(962.751, 1393.7, 18.3418,1)
			走到(946.118, 1397.99, 18.3381)
			走到(926.351, 1400.32, 18.3429,1)
			mincaiyao,maxcaiyao = 专业信息("草药学")
			if mincaiyao >= 170 then
				战斗处理()
				范围采集(40)
				战斗处理()
				范围采集(40)
			end
			走到(926.351, 1400.32, 18.3429,1)
			战斗处理()
		end
		if 在坐标范围(926.351, 1400.32, 18.3429,30) then
			取消BUFF("潜行")
			走到(915.924, 1408.4, 18.0234)
			使用技能("急奔")
			走到(897.449, 1404.37, 18.3508)
			走到(873.973, 1396.18, 18.0062)
			走到(871.114, 1374.26, 18.0062)
			走到(870.667, 1350.56, 18.0062)
			走到(866.474, 1322.16, 18.0062)
			走到(853.318, 1320.7, 18.6722,1)
		end
		if 在坐标范围(853.318, 1320.7, 18.6722,20) then
			走到(853.318, 1320.7, 18.6722,1)
			走到(853.129, 1316.85, 18.6722,1)
			移动("前",2000)
			while 过图中() do 
				延时(1000)
			end
			延时(1000)
		end
	end
	if 在坐标范围(2911.68, -825.878, 160.327,15) then
		x,y,z = 当前坐标()
		if y < -818 then
			走到(2909.79, -818.734, 160.328,1)
			打开身边目标("杠杆")
			延时(500)
			走到(2908.82, -806.773, 160.328,1)
		end
	end
end
function XS1(wait)
	if HP()==0 then
		return
	end
	if 在副本() then
		if zy == "潜行者" then
			while not 存在BUFF("潜行") and HP()>1 do 
				使用技能("潜行")
				延时(500)
			end
		elseif zy=="法师" then
			if not 存在BUFF("奥术智慧") then
				使用技能("奥术智慧")
				延时(1500)
			end
		elseif zy == "德鲁伊" then
			潜行()
		end
		if wait~=nil and HP()>1 then
			if zhiye == "法师" then
				waittime=18
			else
				waittime=17
			end
			num1=背包物品数量("墓地苔")
			num2=背包物品数量("枯叶草")
			提示("等"..tostring(waittime).."分,第"..tostring(fbtime).."次。墓地苔："..tostring(num1).."个,枯叶草："..tostring(num2).."个")
			小退()
			num=waittime*2
			local i=0
			for i=1,num do
				延时(29500)
				跳()
				延时(1000)
				if i%2==0 then
					提示("等"..tostring(waittime-i/2).."分,第"..tostring(fbtime).."次。墓地苔："..tostring(num1).."个,枯叶草："..tostring(num2).."个")
				end
			end
			进入游戏()
			if zy == "潜行者" then
				while not 存在BUFF("潜行") and HP()>1 do 
					使用技能("潜行")
					延时(500)
				end
			elseif zy == "德鲁伊" then
				潜行()
			end
		end
		if 在坐标范围(1687.27, 1050.09, 18.6773,30) then
			走到(1690.93, 1053.55, 18.6776)
			走到(1702.63, 1054.3, 18.4913)
			走到(1702.86, 1092.83, 6.82049)
			走到(1715.94, 1101.42, 6.82049)
			走到(1753.48, 1101.56, 6.82049,0,0,0.4)
			走到(1757.76, 1104.85, 7.14808,0,0,0.4)
			走到(1757.2, 1118.9, 7.49057,1)
			if zy == "法师" then
				使用技能("寒冰护体")
			end
			if 坐标范围怪物数量(1759.76, 1124.45, 7.49044,12,"血色",1)>2 and HP()>1 then
				while 坐标范围怪物数量(1759.76, 1124.45, 7.49044,12,"血色",1)>2 and HP()>1 do
					延时(1000)
				end
			end
			走到(1760.88, 1124.42, 7.49044,1,0,3)
			走到(1767.21, 1146.12, 7.49035,1)
			走到(1774.38, 1149.15, 7.49057,1)
			if 坐标范围怪物数量(1783.14, 1152.39, 7.49102,8,"血色",1)>0 and HP()>1 then
				while 坐标范围怪物数量(1783.14, 1152.39, 7.49102,8,"血色",1)>0 and HP()>1 do
					延时(1000)
				end
				延时(1000)
			end
			if 坐标范围怪物数量(1783.68, 1163.66, 6.8206,10,"血色",1)>0 and HP()>1 then
				while 坐标范围怪物数量(1783.68, 1163.66, 6.8206,10,"血色",1)>0 and HP()>1 do
					延时(1000)
				end
				延时(1000)
			end
			if 坐标范围怪物数量(1783.14, 1154.39, 7.49102,8,"血色",1)>0 and HP()>1 then
				while 坐标范围怪物数量(1783.14, 1154.39, 7.49102,8,"血色",1)>0 and HP()>1 do
					延时(1000)
				end
				延时(1000)
			end
			
			走到(1780.95, 1155.96, 7.49057,1,0,0.15)
			走到(1781.68, 1173, 6.82057)
			走到(1797.12, 1174.03, 7.06224)
			走到(1796.38, 1215.11, 18.1577,1)
			战斗处理()
		end
		if 在坐标范围(1796.38, 1215.11, 18.1577,60) then
			if zy=="法师" then
				if not 存在BUFF("冰甲术") then
					使用技能("冰甲术")
					延时(1500)
				end
				if not 存在BUFF("奥术智慧") then
					使用技能("奥术智慧")
				end
			end
			if 坐标范围有采集物(1775.9, 1224.74, 17.5028,5) and HP()>1 then ---------1
				走到(1776.44, 1222.86, 17.5028,1)
				延时(500)
				战斗处理()
				范围采集(5)
				延时(1000)
				if zy == "潜行者" then
					while not 存在BUFF("潜行") and HP()>1 do 
						使用技能("潜行")
						延时(1000)
					end
				elseif zy == "德鲁伊" then
					潜行()
				end
			end
			走到(1816.56, 1239.27, 17.5534,1)
		end
		if 在坐标范围(1816.56, 1239.27, 17.5534,20) then
			if 坐标范围有采集物(1818.96, 1240.74, 17.5482,5) and HP()>1 then --------2
				走到(1818.96, 1240.74, 17.5482,1)
				延时(500)
				战斗处理()
				范围采集(5)
			end
			if 坐标范围有采集物(1813.65, 1273.99, 17.6215,5) and HP()>1 then -------3
				走到(1814.16, 1273.2, 17.6113,1)
				延时(500)
				战斗处理()
				范围采集(5)
				if zy == "潜行者" then
					while not 存在BUFF("潜行") and HP()>1 do 
						使用技能("潜行")
						延时(1000)
					end
				elseif zy == "德鲁伊" then
					潜行()
				end
			end
			走到(1815.95, 1273.72, 17.5918,1)
			走到(1821.46, 1286.79, 17.527,1)
		end
		if 在坐标范围(1821.46, 1286.79, 17.527,20) then
			if zy == "潜行者" then
				while not 存在BUFF("潜行") and HP()>1 do 
					使用技能("潜行")
					延时(1000)
				end
			elseif zy == "德鲁伊" then
				潜行()
			end
			走到(1827.05, 1297.21, 17.4164,1)
			走到(1821.66, 1309.05, 17.4828,1)
			走到(1820.59, 1316.25, 17.4646,1)
			if 坐标范围有采集物(1833.49, 1318.68, 19.6949,5) and HP()>1 then --------4
				走到(1825.69, 1325.87, 17.3044,1)
				走到(1833.26, 1323.81, 17.2202,1)
				走到(1833.04, 1320.63, 19.0174,1,1)
				延时(500)
				战斗处理()
				范围采集(5)
				if zy == "潜行者" then
					while not 存在BUFF("潜行") and HP()>1 do 
						使用技能("潜行")
						延时(1000)
					end
				elseif zy == "德鲁伊" then
					潜行()
				end
			else
				走到(1825.69, 1325.87, 17.3044,1)
			end
			走到(1833.34, 1325.63, 17.2756,1)
		end
		if 在坐标范围(1833.34, 1325.63, 17.2756,20) then
			if 坐标范围怪物数量(1836.16, 1353.77, 18.3168,10,"幽魂|幻影|死者",1)>0 and HP()>1 then
				while 坐标范围怪物数量(1836.16, 1353.77, 18.3168,10,"幽魂|幻影|死者",1)>0 and HP()>1 do
					延时(1000)
				end
				延时(1000)
			end
			if 坐标范围怪物数量(1836.16, 1340.77, 18.3168,8,"幽魂|幻影|死者",1)>0 and HP()>1 then
				while 坐标范围怪物数量(1836.16, 1340.77, 18.3168,8,"幽魂|幻影|死者",1)>0 and HP()>1 do
					延时(1000)
				end
				延时(2000)
			end
			if 坐标范围怪物数量(1836.16, 1353.77, 18.3168,10,"幽魂|幻影|死者",1)>0 and HP()>1 then
				while 坐标范围怪物数量(1836.16, 1353.77, 18.3168,10,"幽魂|幻影|死者",1)>0 and HP()>1 do
					延时(1000)
				end
			end
			走到(1835.42, 1334.81, 17.5528,1)
			if zy == "法师" then
				走到(1836.18, 1340.76, 17.7162,1)
			end
			if 坐标范围有采集物(1840.44, 1348.1, 17.9421,5) and HP()>1 then --------5
				走到(1842.7, 1352.08, 18.064,1)
				if zy == "潜行者" and 等级() < 48 then
					while 坐标范围怪物数量(1819.75, 1372.58, 18.0814,12,"幽魂|幻影|死者",1)>0 and HP()>1 do
						延时(1000)
					end
					延时(1000)
					while 坐标范围怪物数量(1831.31, 1363, 19.2658,10,"幽魂|幻影|死者",1)>0 and HP()>1 do
						延时(1000)
					end
					延时(1000)
					if 坐标范围怪物数量(1836.16, 1353.77, 18.3168,10,"幽魂|幻影|死者",1)>0 and HP()>1 then
						while 坐标范围怪物数量(1836.16, 1353.77, 18.3168,10,"幽魂|幻影|死者",1)>0 and HP()>1 do
							延时(1000)
						end
					end
					使用技能("扰乱")
					指向坐标(1847.73, 1336.71, 18.3768)
					延时(200)
				end
				延时(300)
				战斗处理()
				范围采集(5)
				走到(1846.94, 1352.98, 18.2402,1)
				if zy == "潜行者" then
					使用技能("潜行")
					while not 存在BUFF("潜行") and HP()>1 do 
						使用技能("潜行")
						延时(1000)
					end
				elseif zy == "德鲁伊" then
					潜行()
				end
				if (坐标范围怪物数量(1819.75, 1372.58, 18.0814,12,"幽魂|幻影|死者",1)>0 or 坐标范围怪物数量(1831.31, 1363, 19.2658,10,"幽魂|幻影|死者",1)>0) and HP()>1 then
					while 坐标范围怪物数量(1819.75, 1372.58, 18.0814,12,"幽魂|幻影|死者",1)>0 and HP()>1 do
						延时(1000)
					end
					延时(1000)
					while 坐标范围怪物数量(1831.31, 1363, 19.2658,10,"幽魂|幻影|死者",1)>0 and HP()>1 do
						延时(1000)
					end
					延时(2000)
				end
			end
			if 坐标范围怪物数量(1836.16, 1353.77, 18.3168,10,"幽魂|幻影|死者",1)>0 and HP()>1 then
				while 坐标范围怪物数量(1836.16, 1353.77, 18.3168,10,"幽魂|幻影|死者",1)>0 and HP()>1 do
					延时(1000)
				end
				延时(1000)
			end
			while 坐标范围怪物数量(1835.66, 1355.32, 18.6026,8,"幽魂|幻影|死者",1)>0 and HP()>1 do
				延时(1000)
			end
			走到(1832, 1352.43, 18.4781,1)
			if (坐标范围怪物数量(1819.75, 1372.58, 18.0814,12,"幽魂|幻影|死者",1)>0 or 坐标范围怪物数量(1831.31, 1363, 19.2658,10,"幽魂|幻影|死者",1)>0) and HP()>1 then
				走到(1827.4, 1354.83, 18.7256,1)
				while 坐标范围怪物数量(1819.75, 1372.58, 18.0814,12,"幽魂|幻影|死者",1)>0 and HP()>1 do
					延时(1000)
				end
				延时(1000)
				while 坐标范围怪物数量(1831.31, 1363, 19.2658,10,"幽魂|幻影|死者",1)>0 and HP()>1 do
					延时(1000)
				end
				延时(4000)
				走到(1832, 1352.43, 18.4781,1)
			end
			if zy=="法师" then
				闪现走到(1833.72, 1383.45, 17.6103,1)
			else
				走到(1833.72, 1383.45, 17.6103,1)
			end
			战斗处理()
			if 坐标范围有采集物(1840.2, 1377.35, 18.7119,5) and HP()>1 then --------6
				走到(1834.62, 1381.67, 17.8335)
				走到(1838.08, 1380.23, 18.3175,1)
				if zy == "潜行者" then
					if 等级() < 46 then
						while 坐标范围怪物数量(1838.08, 1380.23, 18.3175,6,"幽魂|幻影|死者",1)>0 and HP()>1 do 
							延时(500)
						end
					end
					使用技能("扰乱")
					指向坐标(1848.18, 1370.87, 18.4496)
				end
				延时(500)
				战斗处理()
				范围采集(5)
				走到(1834.27, 1384.76, 17.5536,1)
				if zy == "潜行者" then
					while not 存在BUFF("潜行") and HP()>1 do 
						使用技能("潜行")
						延时(1000)
					end
				elseif zy == "德鲁伊" then
					潜行()
				end
			end
			走到(1820.16, 1384.71, 17.5566,1,0,5)
		end
		if 在坐标范围(1820.16, 1384.71, 17.5566,20) then
			if 坐标范围怪物数量(1815.58, 1387.38, 17.695,9,"幽魂|幻影|死者",1)>0 and HP()>1 then
				while 坐标范围怪物数量(1815.58, 1387.38, 17.695,9,"幽魂|幻影|死者",1)>0 and HP()>1 do
					延时(1000)
				end
				延时(1000)
			end
			
			if 坐标范围有采集物(1836.72, 1408.79, 21.7469,5) and HP()>1 then ---------7
				if 坐标范围怪物数量(1815.58, 1386.38, 17.695,13,"幽魂|幻影|死者",1)>0 and HP()>1 then
					t=0
					while 坐标范围怪物数量(1815.58, 1386.38, 17.695,13,"幽魂|幻影|死者",1)>0 and HP()>1 do
						延时(1000)
						t=t+1
						if t>10 then
							break
						end
					end
					延时(1000)
				end
				走到(1816.85, 1385.27, 17.5053)
				走到(1816.72, 1389.31, 19.5579)
				走到(1830.06, 1391.6, 20.0368,1)
				走到(1832.96, 1402.83, 21.0173,1)
				if 战斗中() then
					if zy=="潜行者" then
						使用技能("消失")
						延时(7000)
					end
					战斗处理()
				end
				if 坐标范围怪物数量(1828.95, 1414.86, 21.7099,9,"幽魂|幻影|死者",1)>0 then
					t=0
					while 坐标范围怪物数量(1828.95, 1414.86, 21.7099,9,"幽魂|幻影|死者",1)>0 and HP()>1 do
						延时(1000)
						t=t+1
						if t>6 then
							if 坐标范围怪物数量(1833.14, 1415.85, 22.1176,9,"幽魂|幻影|死者",1)==0 then
								break
							end
						end
					end
					延时(1000)
					
				end
				走到(1835.22, 1411.69, 21.8608,1)
				延时(300)
				战斗处理()
				范围采集(5)
				if zy == "潜行者" then
					while not 存在BUFF("潜行") and HP()>1 do 
						使用技能("潜行")
						延时(1000)
					end
				elseif zy == "德鲁伊" then
					潜行()
				end
				走到(1832.64, 1392.4, 20.2627)
				走到(1825.39, 1391.63, 20.249,1)
			end
			if 坐标范围怪物数量(1815.02, 1388.61, 19.1742,7,"幽魂|幻影|死者",1)>0 and HP()>1 then
				while 坐标范围怪物数量(1815.02, 1388.61, 19.1742,7,"幽魂|幻影|死者",1)>0 and HP()>1 do 
					延时(1000)
				end
				延时(1000)
			end
			走到(1805.08, 1385.26, 18.7076,1)
			if 战斗中() and zy == "潜行者" then
				使用技能("消失")
				延时(7000)
			else
				战斗处理()
			end
			if 坐标范围怪物数量(1798.07, 1382.5, 18.7872,11,"幽魂|幻影|死者",1)>0 and HP()>1 then
				while 坐标范围怪物数量(1798.07, 1382.5, 18.7872,11,"幽魂|幻影|死者",1)>0 and HP()>1 do 
					延时(1000)
				end
				延时(3000)
			end
			if 坐标范围怪物数量(1797.71, 1393.69, 22.9555,10,"幽魂|幻影|死者",1)>0 and HP()>1 then
				while 坐标范围怪物数量(1797.71, 1393.69, 22.9555,10,"幽魂|幻影|死者",1)>0 and HP()>1 do 
					延时(1000)
				end
				延时(2000)
			end
			走到(1801.75, 1381.87, 18.8017,1)
			if 坐标范围有采集物(1796.1, 1417.36, 14.1414,5) and HP()>1 then ------------------------------------8
				走到(1795.41, 1383.43, 18.764,1)
				if 坐标范围怪物数量(1797.46, 1409.52, 17.8297,12,"幽魂|幻影|死者",1)>0 and HP()>1 then
					走到(1787.01, 1380.91, 18.8256,1)
					while 坐标范围怪物数量(1797.46, 1409.52, 17.8297,12,"幽魂|幻影|死者",1)>0 and HP()>1 do 
						延时(500)
					end
					走到(1796.31, 1383.43, 18.764,1)
				end
				if 坐标范围怪物数量(1797.71, 1393.69, 22.9555,10,"幽魂|幻影|死者",1)>0 and HP()>1 then
					走到(1787.01, 1380.91, 18.8256,1)
					while 坐标范围怪物数量(1797.71, 1393.69, 22.9555,10,"幽魂|幻影|死者",1)>0 and HP()>1 do 
						延时(1000)
					end
					延时(3000)
					走到(1796.31, 1383.43, 18.764,1)
				end
				走到(1796, 1396.83, 23.5144)
				走到(1797.06, 1417.7, 14.1414)
				走到(1795.29, 1419.71, 14.313,1)
				战斗处理()
				if 坐标范围怪物数量(1795.29, 1419.71, 14.313,9,"死者|幽魂|鬼魅",1)>0 and HP()>1 then
					while 坐标范围怪物数量(1795.29, 1419.71, 14.313,9,"死者|幽魂|鬼魅",1)>0 and HP()>1 do 
						延时(1000)
					end
				end
				延时(300)
				战斗处理()
				范围采集(5)
				战斗处理()
				if zy == "潜行者" then
					while not 存在BUFF("潜行") and HP()>1 do 
						使用技能("潜行")
						延时(1000)
					end
				elseif zy == "德鲁伊" then
					潜行()
				end
				if 坐标范围怪物数量(1795.29, 1419.71, 14.313,9,"死者|幽魂|鬼魅",1)>0 and HP()>1 then
					while 坐标范围怪物数量(1795.29, 1419.71, 14.313,9,"死者|幽魂|鬼魅",1)>0 and HP()>1 do 
						延时(1000)
					end
				end
				走到(1797.06, 1417.7, 14.1414)
				走到(1795.52, 1400.13, 23.5127)
			end
			走到(1792.39, 1381.45, 18.8153,1)
			走到(1782.26, 1385.29, 17.5361,1)
			战斗处理()
			if 坐标范围有采集物(1746.21, 1410.94, 22.2185,5) and HP()>1 then --------9
				走到(1777.1, 1390.99, 20.301)
				走到(1763.36, 1390.01, 19.4772,0,0,1.5)
				走到(1749.78, 1414.64, 22.8994)
				走到(1748.96, 1414.96, 22.9105,1)
				走到(1748.31, 1415.04, 22.9105,1,0,0.2)
				if zy=="潜行者" and HP()>1 then
					if 等级() < 46 then
						while 坐标范围怪物数量(1748.31, 1415.04, 22.9105,7,"死者|幽魂|鬼魅",1)>0 and HP()>1 do 
							延时(500)
						end
					end
					使用技能("扰乱")
					指向坐标(1740.47, 1403.16, 21.4896)
					延时(400)
				end
				延时(500)
				战斗处理()
				范围采集(5)
				走到(1748.43, 1416.39, 23.0924,1)
				战斗处理()
				if zy == "潜行者" then
					while not 存在BUFF("潜行") and HP()>1 do 
						使用技能("潜行")
						延时(1000)
					end
				elseif zy == "德鲁伊" then
					潜行()
				else
					if 坐标范围怪物数量(1747.15, 1413.9, 22.682,6,"死者|幽魂|鬼魅",1)>0 then
						while 坐标范围怪物数量(1747.15, 1413.9, 22.682,6,"死者|幽魂|鬼魅",1)>0 and HP() > 1 do
							延时(1000)
						end
					end
				end
				走到(1763.36, 1390.01, 19.4772)
				走到(1779.85, 1388.69, 19.5471,1)
			end
			走到(1779.49, 1384.28, 17.505,1)
			走到(1774.9, 1385.57, 17.519,1)
			走到(1744.14, 1383.36, 17.8297,1)
			战斗处理()
		end
		if 在坐标范围(1744.14, 1383.36, 17.8297,20) then
			while 坐标范围有采集物(1740.23, 1377.84, 17.5674,5) and HP()>1 do -------10
				走到(1739.53, 1381.54, 17.9535,1)
				朝向坐标(1740.23, 1377.84, 17.5674)
				按键("w",1)
				延时(300)
				按键("w",2)
				延时(500)
				战斗处理()
				范围采集(5)
				if zy == "潜行者" then
					while not 存在BUFF("潜行") and HP()>1 do 
						使用技能("潜行")
						延时(1000)
					end
				elseif zy == "德鲁伊" then
					潜行()
				end
				战斗处理()
			end
			走到(1736.37, 1382.37, 17.7091,1)
			if zy=="法师" then
				while 坐标范围怪物数量(1742.67, 1373.77, 17.6394,11,"死者|幽魂|鬼魅",1)>0 and HP()>1 do 
					延时(1000)
				end
			end
			走到(1736.54, 1337.38, 17.5104,1,0,2)
		end
		if 在坐标范围(1736.54, 1337.38, 17.5104,20) then
			走到(1757, 1339.5, 17.5775,1,1)
			if 坐标范围有采集物(1756.99, 1345.27, 19.7949,5) and HP()>1 then ------11
				走到(1757.41, 1342.59, 19.3739,1,1)
				朝向坐标(1756.99, 1345.27, 19.7949)
				按键("w",1)
				延时(300)
				按键("w",2)
				延时(500)
				战斗处理()
				范围采集(5)
				if zy == "潜行者" then
					while not 存在BUFF("潜行") and HP()>1 do 
						使用技能("潜行")
						延时(1000)
					end
				elseif zy == "德鲁伊" then
					潜行()
				end
			end
			走到(1757.29, 1336.85, 17.6844,1,0,2)
			if 坐标范围怪物数量(1770.51, 1336.93, 17.5273,10,"幽魂|幻影|死者",1)>0 and HP()>1 then
				while 坐标范围怪物数量(1770.51, 1336.93, 17.5273,10,"幽魂|幻影|死者",1)>0 and HP()>1 do 
					延时(1000)
				end
				延时(3000)
			end
			走到(1770.64, 1332.81, 17.5257,1)
			走到(1785.89, 1319.2, 18.8576,1)
			走到(1783.53, 1286.2, 17.7089,1,0,8)
			if 坐标范围有采集物(1775.34, 1288.17, 17.5538,5) and HP()>1 then -----12
				走到(1775.34, 1288.17, 17.5538,1)
				延时(300)
				战斗处理()
				范围采集(5)
				if zy == "潜行者" then
					while not 存在BUFF("潜行") and HP()>1 do 
						使用技能("潜行")
						延时(1000)
					end
				elseif zy == "德鲁伊" then
					潜行()
				end
			end
			if zy=="法师" then
				使用技能("寒冰护体")
			end
			走到(1791.18, 1273.15, 18.1068)
			走到(1781.93, 1232.25, 17.5592,1)
		end
		if 在坐标范围(1781.93, 1232.25, 17.5592,20) then
			if 坐标范围有采集物(1775.9, 1224.74, 17.5028,5) and HP()>1 then ---------1
				走到(1776.44, 1222.86, 17.5028,1)
				延时(500)
				战斗处理()
				范围采集(5)
				延时(1000)
				if zy == "潜行者" then
					while not 存在BUFF("潜行") and HP()>1 do 
						使用技能("潜行")
						延时(1000)
					end
				elseif zy == "德鲁伊" then
					潜行()
				end
			end
			lastmudi=os.clock()
			走到(1797.77, 1213.24, 18.1573)
			走到(1797.24, 1172.07, 6.82037)
			走到(1781.11, 1172.31, 6.82037)
			走到(1781.65, 1160.32, 7.4912,1)
			走到(1780.49, 1153.82, 7.4912)
			走到(1776.63, 1149.83, 7.4912)
			if zy=="潜行者" then
				走到(1754.63, 1134.66, 7.49101)
				走到(1756.27, 1123.41, 7.49034)
				使用技能("疾跑")
				走到(1757.25, 1108.63, 7.4912)
				走到(1757.34, 1100.85, 6.82024)
			elseif zy == "德鲁伊" then
				走到(1754.63, 1134.66, 7.49101)
				走到(1756.27, 1123.41, 7.49034)
				使用技能("急奔")
				走到(1758.25, 1108.63, 7.4912)
				走到(1757.34, 1100.85, 6.82024)
			elseif zy=="法师" then
				走到(1759.84, 1137.55, 7.49086,1)
				闪现走到(1757.34, 1100.85, 6.82024)
			end
			走到(1703.2, 1093.39, 6.82024)
			走到(1701.63, 1053.8, 18.4916)
			走到(1687.68, 1052.49, 18.6776)
			走到(1687.56, 1048.38, 18.6776,1)
			while 在副本() and HP()>1 do
				按键("w",1)
				延时(3000)
				按键("w",2)
				延时(4000)
				while 过图中() do 
					延时(500)
				end
				延时(1000)
				if not 在副本() then
					break
				else
					走到(1687.68, 1052.49, 18.6776,1)
					延时(15000)
					走到(1687.56, 1048.38, 18.6776,1)
				end
			end
		end
	end
end
function XS2()
	if HP()==0 then
		return
	end
	if 在坐标范围(253.706, -205.726, 18.6773,30) then
		if zy == "潜行者" then
			while not 存在BUFF("潜行") and HP()>1 do 
				使用技能("潜行")
				延时(1000)
			end
		elseif zy=="法师" then
			使用技能("冰甲术")
		elseif zy == "德鲁伊" then
			使用技能("荆棘术")
			延时(1500)
			潜行()
		end
		走到(258.829, -209.266, 18.6773)
		走到(268.455, -209.62, 19.2025)
		走到(267.262, -225.18, 18.5307,1)
	end
	if 在坐标范围(267.262, -225.18, 18.5307,20) then
		if zy == "潜行者" or zy == "德鲁伊" then
			走到(249.782, -223.675, 18.5307)
			走到(236.891, -222.148, 19.0449)
			走到(223.571, -223.794, 18.5308)
			走到(216.695, -222.82, 18.5308,1)
			while 坐标范围怪物数量(218.631, -225.544, 18.5307,11,"血色",1)>3 and HP()>1 and not 战斗中() do
				延时(500)
			end
			走到(210.82, -233.234, 18.5308)
			走到(203.587, -233.751, 18.5308,1)
			if 战斗中() then
				if zy == "潜行者" then
					使用技能("消失")
				else
					战斗处理()
				end
			end
			while 坐标范围怪物数量(201.559, -237.51, 19.2011,7,"血色",1) >0 and HP()>1 do 
				延时(1000)
			end
			while 坐标范围怪物数量(201.559, -237.51, 19.2011,12,"犬",1) >0 and HP()>1 do 
				延时(1000)
			end
			走到(194.703, -244.705, 19.2011,1)
			走到(191.476, -244.781, 19.2011,1)
			走到(186.81, -250.812, 18.5684,1,1,4)
		elseif zy == "法师" then
			走到(255.045, -225.288, 18.5308,1)
			if 坐标范围怪物数量(228.545, -227.146, 18.5308,27,"血色",1)>5 then
				while 坐标范围怪物数量(228.545, -227.146, 18.5308,27,"血色",1)>5 and HP()>1 do 
					延时(1000)
				end
			end
			走到(238.761, -222.54, 18.5307)
			走到(229.707, -223.071, 18.5307,1)
			走到(228.437, -222.727, 18.5307,1)
			朝向坐标(226.437, -212.727, 18.5307)
			按键("space")
			延时(100)
			按键("w",1)
			延时(1800)
			按键("w",2)
			延时(500)
			t=0
			while 坐标范围怪物数量(228.631, -225.544, 18.5307,11,"血色",1)<3 and HP()>1 and not 战斗中() do
				延时(500)
				t=t+1
				if t> 120 then
					break
				end
			end
			延时(1000)
			while 坐标范围怪物数量(228.631, -225.544, 18.5307,11,"血色",1)>2 or 坐标范围怪物数量(228.631, -225.544, 18.5307,20,"犬",1)>0 do
				延时(500)
				if 战斗中() or HP() <= 1 then
					break
				end
			end
			延时(1000)
			while 坐标范围怪物数量(228.631, -225.544, 18.5307,11,"血色",1)>2 do
				if 战斗中() or HP() <= 1 then
					break
				end
				延时(500)
			end
			延时(1000)
			走到(227.023, -224.878, 18.5308,1)
			朝向坐标(210.554, -234.189, 19.201)
			延时(100)
			按键("w")
			延时(100)
			使用技能("闪现术")
			延时(1000)
			if (坐标范围怪物数量(201.559, -237.51, 19.2011,7,"血色",1) >0 or 坐标范围怪物数量(182.343, -242.19, 19.2011,8,"犬",1) >0) and HP()>1 then
				x,y,z=当前坐标()
				朝向坐标(211.151, -234.598, 19.2008)
				按键("w",1)
				延时(500)
				按键("w",2)
				朝向坐标(186.81, -279.812, 18.5684)
				按键("w",1)
				延时(600)
				按键("w",2)
				--走到(211.151, -234.598, 19.2008,1,0,0.4)
				while 坐标范围怪物数量(182.343, -242.19, 19.2011,8,"犬",1) >0 and HP()>1 do 
					延时(1000)
				end
				while 坐标范围怪物数量(201.559, -237.51, 19.2011,7,"血色",1) >0 and HP()>1 do 
					延时(1000)
				end
				while 坐标范围怪物数量(204.27, -228.158, 18.5307,15,"血色",1) >3 and HP()>1 do 
					延时(1000)
				end
				while 坐标范围怪物数量(201.559, -237.51, 19.2011,12,"犬",1) >0 and HP()>1 do 
					延时(1000)
				end
				延时(1000)
			end
			走到(208.398, -233.139, 18.5307)
			走到(203.194, -234.048, 18.5308)
			走到(191.01, -245.199, 19.2011,1)
			走到(186.81, -250.812, 18.5684,1,1,4)
		end
	end
	if 在坐标范围(186.81, -250.812, 18.5684,15) then
		if 坐标范围有采集物(191.442, -254.219, 18.7887,5) and HP()>1 then
			走到(189.801, -249.191, 19.1693,1,0,0.3)
			--走到(192.916, -251.356, 18.8158,1)
			走到(193.495, -249.754, 18.7389,1,0,0.2)
			--走到(191.442, -254.219, 18.7887,1,0,5)
			延时(300)
			战斗处理()
			if zy == "潜行者" then
				if 等级() < 46 then	
					while (坐标范围怪物数量(202.416, -231.482, 18.5307,10,"犬",1) > 0 or 坐标范围怪物数量(201.015, -243.456, 19.2011,10,"犬",1) > 0 or 坐标范围怪物数量(181.397, -242.372, 19.2011,10,"犬",1) > 0) and HP()>1 do 
						延时(500)
					end
					while 坐标范围怪物数量(193.495, -249.754, 18.7389,11,"血色",1) > 0 and HP()>1 do 
						延时(300)
					end
				end
				if HP() > 1 then
					使用技能("扰乱")
					指向坐标(185.21, -264.122, 18.5474)
					延时(300)
				end
			end
			战斗处理()
			mincaiyao,maxcaiyao = 专业信息("草药学")
			if mincaiyao >= 160 then
				范围采集(6)
			end
			if zy == "潜行者" then
				while not 存在BUFF("潜行") and HP()>1 do 
					使用技能("潜行")
					延时(1000)
				end
			elseif zy == "德鲁伊" then
				潜行()
			end
			if zy == "潜行者" or zy == "德鲁伊" then
				走到(189.989, -249.085, 19.2011,1,0,0.3)
				走到(180.331, -256.183, 18.5466,1)
			else
				走到(189.989, -249.085, 19.2011,1,0,0.3)
				走到(178.302, -253.035, 18.5813,1)
			end
		end
		if zy == "德鲁伊" and 等级() >60 then
			潜行()
			走到(161.227, -260.051, 19.1999)
			走到(138.193, -260.583, 19.1999)
			走到(130.023, -260.584, 18.8115,1,1)
			按键("tab")
			走到(125.678, -260.46, 18.5469,1)
			使用技能("毁灭")
			延时(2000)
			使用技能("斜掠")
			延时(3000)
			使用技能("凶猛撕咬")
			延时(1500)
			使用技能("巨熊形态")
			延时(1500)
			使用技能("激怒")
			运行宏("/startattack")
			while 战斗中() and HP() > 1 do
				朝向目标()
				运行宏("/startattack")
				延时(1000)
				if 坐标范围怪物数量(125.678, -260.46, 18.5469,11,"")>1 then
					使用技能("横扫")
				else
					使用技能("重殴")
				end
			end
			使用技能("回春术")
			延时(1500)
			走到(125.678, -260.46, 18.5469)
			走到(119.807, -261.999, 18.5469,1)
			范围采集(6)
			走到(123.586, -259.717, 18.5469)
			走到(138.803, -252.648, 19.201)
			走到(146.715, -261.208, 19.201,1)
			潜行()
			走到(166.031, -258.672, 18.5465)
			走到(181.018, -256.3, 18.5465,1)
		end
		mincaiyao,maxcaiyao = 专业信息("草药学")
		if mincaiyao>=160 and 坐标范围有采集物(166.886, -253.26, 19.0724,5) and HP()>1 then
			走到(168.246, -252.529, 19.0215,1)
			延时(300)
			战斗处理()
			范围采集(5)
			if zy == "潜行者" then
				while not 存在BUFF("潜行") and HP()>1 do 
					使用技能("潜行")
					延时(1000)
				end
			elseif zy == "德鲁伊" then
				潜行()
			end
		end
		if mincaiyao>=160 and 坐标范围有采集物(187.898, -278.538, 18.7006,5) and HP()>1 then
			if zy == "潜行者" then
				走到(181.939, -258.537, 18.5478,1)
				走到(181.939, -262.537, 18.5478,1)
				走到(194.194, -275.879, 18.8168,1)
				走到(192.406, -279.013, 18.853,1,0,0.2)
				使用技能("扰乱")
				指向坐标(180.515, -268.808, 18.5466)
				延时(300)
			elseif zy == "德鲁伊" then
				潜行()
				走到(181.939, -258.537, 18.5478,1)
				走到(181.939, -262.537, 18.5478,1)
				走到(194.194, -275.879, 18.8168,1)
				走到(192.406, -279.013, 18.853,1,0,0.2)
			elseif zy=="法师" then
				走到(174.981, -255.341, 18.7645,1)
				while not 技能可用("闪现术") and not 战斗中() and HP()>1 do 
					延时(500)
				end
				走到(179.145, -258.261, 18.5466,1)
				朝向坐标(192.832, -270.906, 18.6071)
				按键("w")
				使用技能("闪现术")
				延时(500)
				走到(192.832, -270.906, 18.6071,1)
				战斗处理()
				走到(190.605, -278.582, 18.9461,1)
			end
			延时(300)
			战斗处理()
			范围采集(5)
			if zy == "潜行者" then
				while not 存在BUFF("潜行") and HP()>1 do 
					使用技能("潜行")
					延时(1000)
				end
				走到(190.351, -268.959, 18.5471)
				走到(180.69, -261.22, 18.5471,1)
			elseif zy == "德鲁伊" then
				潜行()
				走到(190.351, -268.959, 18.5471)
				走到(180.69, -261.22, 18.5471,1)
			elseif zy=="法师" then
				使用技能("寒冰护体")
				延时(1500)
				if not 存在BUFF("冰甲术") then
					使用技能("冰甲术")
					延时(1500)
				end
				if not 存在BUFF("奥术智慧") then
					使用技能("奥术智慧")
					延时(1500)
				end
				走到(192.436, -271.291, 18.7156,1)
				while not 技能可用("闪现术") and not 战斗中() and HP()>1 do 
					延时(500)
				end
				走到(189.657, -268.413, 18.5466,1)
				朝向坐标(174.499, -255.364, 18.7627)
				按键("w")
				使用技能("闪现术")
				延时(500)
				走到(174.499, -255.364, 18.7627,1)
				if not 战斗中() then
					延时(4000)
				end
			end
		end
		if zy=="潜行者" or zy == "德鲁伊" then
			走到(184.9, -244.529, 19.2011)
			走到(198.294, -238.116, 19.2011,1)
			if 坐标范围怪物数量(198.294, -238.116, 19.2011,8,"",1) >0 then
				while 坐标范围怪物数量(198.294, -238.116, 19.2011,8,"",1) >0 and HP()>1 do 
					延时(500)
				end
				走到(205.77, -233.017, 18.5307,1)
				while 坐标范围怪物数量(207.824, -228.306, 18.5307,10,"",1) >1 and HP()>1 do 
					延时(500)
				end
				延时(1500)
			else
				走到(205.77, -233.017, 18.5307)
			end
			走到(219.378, -222.139, 19.0466)
			走到(224.572, -224.126, 18.5307)
			走到(246.359, -222.526, 18.5307)
			走到(252.046, -224.066, 18.5307)
			走到(269.007, -224.029, 18.5307)
		elseif zy=="法师" then
			使用技能("寒冰护体")
			走到(184.9, -244.529, 19.2011)
			走到(198.294, -238.116, 19.2011,1)
			走到(219.378, -222.139, 19.0466)
			走到(224.572, -224.126, 18.5307)
			使用技能("冰霜新星(等级 1)")
			走到(246.359, -224.526, 18.5307)
			闪现走到(269.007, -224.029, 18.5307)
		end
		走到(268.827, -210.174, 19.2012)
		走到(253.496, -208.68, 18.6775)
		走到(253.647, -205.043, 18.6775,1)
		while 在副本() and HP()>1 do
			按键("w",1)
			延时(3000)
			按键("w",2)
			延时(4000)
			while 过图中() do 
				延时(500)
			end
			延时(1000)
			if not 在副本() then
				break
			else
				走到(253.496, -208.68, 18.6775,1)
				延时(15000)
				走到(253.647, -205.043, 18.6775,1)
			end
		end
	end
end
function XS3()
	if HP()==0 then
		return
	end
	if 在坐标范围(1608.1, -318.919, 18.6714,30) and HP()>1 then
		if zy == "潜行者" then
			while not 存在BUFF("潜行") and HP()>1 do 
				使用技能("潜行")
				延时(1000)
			end
		elseif zy == "德鲁伊" then
			潜行()
		end
		走到(1610.75, -323.367, 18.6724)
		走到(1618.61, -324.017, 18.2678)
		if zy=="潜行者" then
			走到(1627.3, -337.53, 18.0077)
			走到(1637.2, -339.635, 18.6779,1)
			while 坐标范围怪物数量(1645.8, -340.541, 18.678,10,"血色",1) >0 and HP()>1 do 
				延时(1000)
			end		
			走到(1645.43, -346.348, 18.6779,1)
		elseif zy == "德鲁伊" then
			潜行()
			走到(1627.3, -337.53, 18.0077)
			走到(1637.2, -339.635, 18.6779,1)
			while 坐标范围怪物数量(1645.8, -340.541, 18.678,10,"血色",1) >0 and HP()>1 do 
				延时(1000)
			end		
			走到(1645.43, -346.348, 18.6779,1)
		elseif zy=="法师" then
			走到(1620.23, -337.154, 18.0076,1)
			while 坐标范围怪物数量(1646.3, -336.869, 18.6779,10,"血色",1) >0 and HP()>1 do 
				延时(1000)
			end
			走到(1623.4, -337.204, 18.0076,1)
			朝向坐标(1644.58, -339.351, 18.6779)
			按键("w")
			使用技能("闪现术")
			延时(500)
			走到(1644.58, -339.351, 18.6779)
			走到(1651.38, -340.16, 18.6778,1)
		end
		走到(1653.06, -347.546, 18.1079,1,1)
	end
	if 在坐标范围(1653.06, -347.546, 18.1079,20) then
		if 坐标范围有采集物(1651.58, -346.429, 18.1429,5) and HP()>1 then
			走到(1653.06, -347.546, 18.1079,1)
			延时(300)
			战斗处理()
			范围采集(5)
			if zy == "潜行者" then
				while not 存在BUFF("潜行") and HP()>1 do 
					使用技能("潜行")
					延时(1000)
				end
			elseif zy == "德鲁伊" then
				潜行()
			end
		end
		if 坐标范围有采集物(1653.14, -371.4, 18.0234,5) and HP()>1 then
			走到(1652.03, -368.773, 18.0234,1)
			延时(300)
			战斗处理()
			if zhiye == "潜行者" or zy == "德鲁伊" then
				while 坐标范围怪物数量(1642.62, -367.502, 18.678,8,"血色",1)>0 or 坐标范围怪物数量(1662.77, -376.487, 18.678,14,"血色",1)>0 or 坐标范围怪物数量(1674.05, -365.25, 18.0234,14,"血色",1)>0 do 
					延时(500)
					if HP() == 0 then
						break
					end
				end
			end
			范围采集(5)
			if zy == "潜行者" then
				while not 存在BUFF("潜行") and HP()>1 do 
					使用技能("潜行")
					延时(1000)
				end
			elseif zy == "德鲁伊" then
				潜行()
			end
		end
		走到(1653.93, -356.232, 18.0234,1)
	end
	if 在坐标范围(1653.93, -356.232, 18.0234,20) then
		if 坐标范围有采集物(1701.79, -346.302, 18.0461,5) and HP()>1 then
			if zy=="潜行者" or zy == "德鲁伊" then
				while 坐标范围怪物数量(1661.15, -362.75, 18.0237,12,"血色",1)>0 and not 战斗中() and HP()>1 do
					延时(500)
				end
				走到(1680.94, -360.114, 18.0235)
				走到(1698.29, -348.362, 18.0473,1)
				走到(1698.42, -348.211, 18.0496,1)
				走到(1701.11, -349.933, 18.0769,1)
				走到(1702.76, -345.227, 18.0348,1)
			elseif zy == "法师" then
				if 坐标范围怪物数量(1665.5, -360.61, 18.0234,10,"血色",1)>0 then
					while 坐标范围怪物数量(1665.5, -360.61, 18.0234,10,"血色",1)>0 and not 战斗中() and HP()>1 do
						延时(500)
					end
					延时(3000)
				end
				if 坐标范围怪物数量(1675.69, -358.907, 18.0233,15,"血色",1)>2 then
					while 坐标范围怪物数量(1675.69, -358.907, 18.0233,15,"血色",1)>2 and not 战斗中() and HP()>1 do
						延时(500)
					end
					延时(1000)
				end
				if 坐标范围怪物数量(1663.53, -361.546, 18.0233,10,"血色",1)>0 then
					while 坐标范围怪物数量(1663.53, -361.546, 18.0233,10,"血色",1)>0 and not 战斗中() and HP()>1 do
						延时(500)
					end
					延时(3000)
				end
				if 坐标范围怪物数量(1680.94, -360.114, 18.0235,10,"血色",1)>0 then
					while 坐标范围怪物数量(1680.94, -360.114, 18.0235,10,"血色",1)>0 and not 战斗中() and HP()>1 do
						延时(500)
					end
					延时(3000)
				end
				
				走到(1680.94, -360.114, 18.0235)
				闪现走到(1698.42, -348.211, 18.0496,1)
			end
			延时(300)
			战斗处理()
			范围采集(5)
			if zy == "潜行者" then
				while not 存在BUFF("潜行") and HP()>1 do 
					使用技能("潜行")
					延时(1000)
				end
				走到(1701.11, -349.933, 18.0769,1)
				走到(1695.57, -349.147, 18.0243,1)
				走到(1694.37, -349.358, 18.0246)
				走到(1658.62, -354.804, 18.0235,1)
			elseif zy == "德鲁伊" then
				潜行()
				走到(1701.11, -349.933, 18.0769,1)
				走到(1695.57, -349.147, 18.0243,1)
				走到(1694.37, -349.358, 18.0246)
				走到(1658.62, -354.804, 18.0235,1)
			elseif zy == "法师" then
				走到(1680.94, -360.114, 18.0235)
				走到(1658.62, -354.804, 18.0235)
			end
		end
		走到(1649.25, -348.072, 18.1114,1)
	end
	if 在坐标范围(1649.25, -348.072, 18.1114,10) then
		走到(1645.93, -348.003, 19.9564,1,1)
		if zy=="法师" then
			使用技能("寒冰护体")
		end
		走到(1637.09, -339.884, 18.6777)
		走到(1625.91, -335.203, 18.0075)
		if zy=="法师" then
			使用技能("冰霜新星(等级 1)")
		end
		走到(1618.52, -323.14, 18.3357)
		取消BUFF("潜行")
		走到(1608.99, -322.616, 18.6737)
		走到(1608.21, -317.069, 18.6722,1)
		while 在副本() and HP()>1 do
			按键("w",1)
			延时(3000)
			按键("w",2)
			延时(4000)
			while 过图中() do 
				延时(500)
			end
			延时(1000)
			if not 在副本() then
				break
			else
				走到(1608.99, -322.616, 18.6737,1)
				延时(15000)
				走到(1608.21, -317.069, 18.6722,1)
			end
			val = 检查挂机方案()
			if val == 11 or val == 22 then
				return
			end
		end
		if HP() > 1 then
			return true
		end
	end
	return false
end
function XS回城(hc)
	if HP()<=1 then
		return
	end
	num1=背包物品数量("墓地苔")
	num2=背包物品数量("枯叶草")
	num=num1+num2
	if 背包空格()<2 or num>150 then
		local lmap=炉石位置()
		if lmap == "恐惧之末旅店" or lmap == "南海镇" then
			延时(2000)
			if 炉石可用() then
				使用物品("炉石")
				延时(11000)
				while 读条中() do 
					延时(1000)
				end
				延时(3000)
				while 过图中() do 
					延时(1000)
				end
				延时(1000)
				local i=0
				for i=1,20 do 
					延时(1000)
					if 小地图名() == lmap then
						break
					end
				end
			end
		else
			if 在坐标范围(2888.61, -826.871, 160.331,15) then
				x,y,z= 当前坐标()
				if y<-826.5 then
					if zy == "潜行者" then
						while 存在BUFF("潜行") and HP()>1 do 
							取消BUFF("潜行")
							延时(500)
						end
					elseif zy == "德鲁伊" then
						潜行()
					end
					走到(2888.39, -833.456, 160.327)
					走到(2889.64, -829.396, 160.33,1)
					打开身边目标()
					延时(1000)
					走到(2883.05, -822.697, 160.328,1)
				end
			end
			if 在坐标范围(2883.05, -822.697, 160.328,10) then
				if zy == "潜行者" then
					while not 存在BUFF("潜行") and HP()>1 do 
						使用技能("潜行")
						延时(500)
					end
				elseif zy == "德鲁伊" then
					潜行()
				end
				走到(2892.43, -814.097, 160.888)
				走到(2914.03, -803.942, 160.333,1)
			end
			if zhenying == "联盟" then
				while 炉石位置() ~= "南海镇" do
					路径走到("南海镇到血色",-855.53, -569.481, 11.0649)
					if HP() > 1 then
						打开NPC("旅店老板安德森")
						延时(1000)
						对话选项(1)
						延时(1000)
						运行宏("/click StaticPopup1Button1")
						延时(1000)
					else
						if HP() == 0 then
							释放灵魂()
						end
						x,y,z = 尸体坐标()
						自动寻路(x,y,z)
						复活()
					end
				end
			end
		end
	end
	if (not 在副本()) and (not 在坐标范围(2893.72, -814.987, 160.333,60)) then
		if zhenying == "联盟" then
			if 在坐标范围(-851.47, -545.129, 11.0545,220) then
				路径走到("南海镇到血色",-850.782, -546.692, 11.1933)
				if hc==nil then
					发送邮件()
				end
				自动寻路(-816.025, -573.763, 15.4053)
				打开NPC("罗伯特·埃比斯彻尔")
				延时(1000)
				出售垃圾()
				延时(1000)
				自动寻路(-796.697, -540.717, 16.4009)
			end
			路径走到("南海镇到血色",2914.03, -803.942, 160.333)
		else
			if 在坐标范围(2236.97, 254.255, 34.0693,290) then
				路径走到("部落血色修理",2236.97, 254.255, 34.0693)
				if hc==nil then
					发送邮件()
				end
				路径走到("部落血色修理",2248.32, 307.393, 35.1899)
				打开NPC("伊莉莎·考伦")
				延时(500)
				for i=1,2 do 
					延时(1000)
					出售垃圾()
				end
			end
			提升草药技能()
			路径走到("部落血色修理",2914.03, -803.942, 160.333)
		end
	end
end
function XS结束()
	血色复活1()
	炉石()
	x,y,z = 当前坐标()
	if zhenying == "联盟" then
		if 在坐标范围(-851.47, -545.129, 11.0545,220) then
			路径走到("南海镇到血色",-851.47, -545.129, 11.0545)
			发送邮件()
			自动寻路(-816.025, -573.763, 15.4053)
			打开NPC("罗伯特·埃比斯彻尔")
			延时(1000)
			出售垃圾()
			延时(1000)
			自动寻路(-796.697, -540.717, 16.4009)
		end
	else
		if 在坐标范围(2236.97, 254.255, 34.0693,290) then
			路径走到("部落血色修理",2236.97, 254.255, 34.0693)
			发送邮件()
			路径走到("部落血色修理",2248.32, 307.393, 35.1899)
			打开NPC("伊莉莎·考伦")
			延时(500)
			for i=1,2 do 
				延时(1000)
				出售垃圾()
			end
		end
		提升草药技能()
	end
end
function TD结束()
	剃刀复活()
	if HP() == 1 then
		剃刀高地进本()
	end
	炉石()
	x,y,z = 当前坐标()
	if zhenying == "联盟" then
		if 在坐标范围(-851.47, -545.129, 11.0545,220) then
			路径走到("南海镇到血色",-850.782, -546.692, 11.1933)
			发送邮件()
			自动寻路(-816.025, -573.763, 15.4053)
			打开NPC("罗伯特·埃比斯彻尔")
			延时(1000)
			出售垃圾()
			延时(1000)
			自动寻路(-850.782, -546.692, 11.1933)
		end
		if 在坐标范围(-3618.78, -4469.09, 14.2457,40) then
			路径走到("塞拉摩到剃刀高地",-3618.08, -4436.39, 13.3331)
			发送邮件()
			路径走到("塞拉摩到剃刀高地",-3778.17, -4519.2, 12.0488)
			走到(-3779.94, -4540.46, 11.5651,1)
			打开NPC("杰森·法兰")
			延时(1000)
			出售垃圾()
			走到(-3777.89, -4513.85, 11.9665,1)
		end
	else
		if 在坐标范围(2236.97, 254.255, 34.0693,290) then
			路径走到("部落血色修理",2236.97, 254.255, 34.0693)
			发送邮件()
			路径走到("部落血色修理",2248.32, 307.393, 35.1899)
			打开NPC("伊莉莎·考伦")
			延时(500)
			for i=1,2 do 
				延时(1000)
				出售垃圾()
			end
		end
		if 在坐标范围(-1295.36, 40.4692, 129.209,300) then
			路径走到("雷霆崖旅店到草药训练师",-1262.95, 45.8222, 127.561)
			发送邮件()
			路径走到("雷霆崖旅店到草药训练师",-1234.58, 46.8214, 127.081)
			走到(-1238.97, 41.0519, 127.013,1)
			打开NPC("安哈努")
			延时(1000)
			对话选项(1)
			延时(1000)
			出售垃圾()
		end
	end
	提升草药技能()
end
function 转场TD()
	while 地图名() == "血色修道院" do
		if zy == "法师" then
			if 法师传送到("奥格瑞玛") then
				break
			elseif 法师传送到("铁炉堡") then
				break
			end
		end
		炉石()
	end
	if not 在副本() then
		if zhenying == "部落" then
			if 地图名() == "幽暗城" then
				x,y,z = 当前坐标()
				if z < 50 then
					路径走到("幽暗城法师传送到旅店电梯",1595.18, 176.086, -41.4176)
					坐船()
				end
				路径走到("布瑞尔旅店到幽暗电梯上",2024.18, 289.523, 50.534)
			end
			if 小地图名()=="洛丹伦废墟" then
				路径走到("布瑞尔旅店到幽暗电梯上",2024.18, 289.523, 50.534)
			end
			布瑞尔到陶拉祖营地()
			if 在路径范围("陶阿祖营地到剃刀高地") then
				路径走到("陶阿祖营地到剃刀高地",-4659.06, -2526.03, 81.4828)
			end
		else
			南海镇到剃刀高地()
		end
	end
	if 战斗中() then
		if zy == "潜行者" then
			使用技能("消失")
			延时(2000)
			if 战斗中() then
				剃刀高地进本()
			end
		elseif zy == "猎人" then
			使用技能("假死")
			延时(3000)
			if 战斗中() then
				剃刀高地进本()
			end
		else
			剃刀高地进本()
		end
	end
end
function 盗贼补充()
	if zy=="潜行者" then 
		if 地图名() == "铁炉堡" then
			local num = 背包物品数量("闪光粉")
			if num < 20 then
				自动寻路(-4640.69, -1131.94, 507.161)
				打开NPC("泰努斯·毒芽")
				延时(1000)
				对话选项(1)
				延时(1000)
				local ci=math.modf((40-num)/20)
				local i=0
				for i=1,ci do
					购买物品(5,20)
					延时(1000)
				end
				if (40-num)%20 > 0 then
					购买物品(5,(40-num)%20)
					延时(1000)
				end
			end
		end
	end
end
function 提升草药技能()
	if 地图名() == "铁炉堡" then
		mincaiyao,maxcaiyao = 专业信息("草药学")
		if mincaiyao >=125 and maxcaiyao == 150 or mincaiyao >= 200 and maxcaiyao == 225 or mincaiyao>=50 and maxcaiyao==75 then
			自动寻路(-4881.28, -1154.66, 505.77)
			打开NPC("雷纳·石枝")
			延时(1000)
			对话选项(1)
			延时(1000)
			学习技能(0)
			自动寻路(-4862.97, -1130.26, 502.18)
		end
		if 存在技能("寻找矿物") then
			minck,maxck=专业信息("采矿")
			if minck>=200 and maxck < 300 or minck>=125 and maxck==150 or minck>=50 and maxck==75 then
				自动寻路(-4726, -1127.04, 502.213)
				走到(-4722.78, -1105.01, 511.117)
				走到(-4711.25, -1107.47, 511.115)
				走到(-4702.53, -1114.46, 504.445)
				走到(-4707.53, -1110.12, 504.445,1)
				打开NPC("吉尔弗拉姆·石趾")
				延时(1000)
				学习技能()
				延时(1000)
				走到(-4701.37, -1118.46, 504.445)
				走到(-4703.4, -1125.56, 507.503)
				走到(-4713.72, -1122.87, 511.114)
				走到(-4713.14, -1107.03, 511.114)
				走到(-4722.01, -1105.01, 511.114)
				走到(-4735.93, -1122.67, 502.216,1)
			end
		end
	end
	if 地图名() == "暴风城" then
		if 存在技能("寻找矿物") then
			minck,maxck=专业信息("采矿")
			if minck>=200 and maxck < 300 or minck>=125 and maxck==150 or minck>=50 and maxck==75 then
				自动寻路(-8422.36, 674.795, 95.6071)
				走到(-8441.14, 701.591, 99.9407)
				走到(-8436.58, 704.314, 99.9453)
				走到(-8431.7, 694.733, 103.364,1)
				打开NPC("吉尔曼·石手")
				延时(1000)
				对话选项(1)
				延时(1000)
				学习技能()
				走到(-8436.58, 704.314, 99.9453)
				走到(-8441.14, 701.591, 99.9407)
				走到(-8435, 692.522, 96.3181,1)
				if 背包物品数量("矿工锄") == 0 then
					走到(-8430.52, 693.598, 96.3181,1)
					打开NPC("布鲁克·石衣")
					延时(1000)
					对话选项(1)
					延时(1000)
					购买物品(1,1)
					延时(1000)
				end
				走到(-8426.12, 678.995, 96.3181)
				走到(-8421.32, 672.682, 94.681,1)
			end
		end
	end
	if 在坐标范围(2268.81, 332.431, 35.0749,300) and 存在技能("寻找草药") then
		mincaiyao,maxcaiyao = 专业信息("草药学")
		if zz == "牛头人" then
			m=15
		else
			m=0
		end
		if mincaiyao>=200 and maxcaiyao < 300 or mincaiyao>=125 and maxcaiyao==150+m or mincaiyao>=50 and maxcaiyao==75+m then
			if zhenying == "部落" then
				上马()
				自动寻路(2268.81, 332.431, 35.0749)
				打开NPC("法鲁萨")
				延时(1000)
				学习技能(0)
				延时(1000)
			end
		end
	end
	if 地图名() == "雷霆崖" then
		mincaiyao,maxcaiyao = 专业信息("草药学")
		if zz == "牛头人" then
			m=15
		else
			m=0
		end
		if mincaiyao>=200 and maxcaiyao < 300 or mincaiyao>=125 and maxcaiyao==150+m or mincaiyao>=50 and maxcaiyao==75+m then
			路径走到("雷霆崖旅店到草药训练师",-1129.42, -5.20508, 143.523)
			打开NPC("克米恩·冰蹄")
			延时(1000)
			学习技能()
			路径走到("雷霆崖旅店到草药训练师",-1262.95, 45.8222, 127.561)
		end
	end
	if 地图名() == "幽暗城" then
		if 在路径范围("幽暗城旅店到草药训练师") then
			mincaiyao,maxcaiyao = 专业信息("草药学")
			if zz == "牛头人" then
				m=15
			else
				m=0
			end
			if mincaiyao>=200 and maxcaiyao < 300 or mincaiyao>=125 and maxcaiyao==150+m or mincaiyao>=50 and maxcaiyao==75+m then
				路径走到("幽暗城旅店到草药训练师",1559.97, 353.658, -62.1599)
				打开NPC("马尔萨·奥列斯塔")
				延时(1000)
				对话选项(1)
				延时(1000)
				学习技能(0)
				路径走到("幽暗城旅店到草药训练师",1632.24, 229.74, -43.1025)
			end
		end
		if 存在技能("寻找矿物") then
			minck,maxck=专业信息("采矿")
			if minck>=200 and maxck < 300 or minck>=125 and maxck==150 or minck>=50 and maxck==75 then
				if not 在路径范围("幽暗城旅馆到采矿训练师") then
					路径走到("幽暗城法师传送到旅店电梯",1633.98, 227.535, -43.1026)
				end
				if 在路径范围("幽暗城旅馆到采矿训练师") then
					路径走到("幽暗城旅馆到采矿训练师",1639.84, 336.79, -62.1748)
					打开NPC("布罗姆·基里安")
					延时(1000)
					学习技能()
				end
				if 背包物品数量("矿工锄") == 0 then
					路径走到("幽暗城旅馆到采矿训练师",1642.9, 331.829, -62.1855)
					打开NPC("莎拉·基里安")
					延时(1000)
					购买物品(1,1)
					延时(1000)
				end
				minck,maxck=专业信息("采矿")
				if minck >=65 and maxck == 150 and 背包物品数量("铜锭") > 0 then
				else
					路径走到("幽暗城旅馆到采矿训练师",1633.98, 227.535, -43.1026)
				end
			end
		end
	end
end
function 南海镇到ZZ(转场)
	if zhenying == "联盟" then
		if 地图名() == "希尔斯布莱德丘陵" then
			if not 在飞机上() then
				if 在坐标范围(-851.47, -545.129, 11.0545,220) then
					路径走到("南海镇到血色",-851.47, -545.129, 11.0545)
					自动寻路(-816.025, -573.763, 15.4053)
					打开NPC("罗伯特·埃比斯彻尔")
					延时(1000)
					出售垃圾()
					延时(1000)
					自动寻路(-796.697, -540.717, 16.4009)
				end
			end
			路径走到("南海镇到血色",-715.574, -513.109, 26.3778)
			打开NPC("达尔拉·哈瑞斯")
			延时(500)
			打开NPC("达尔拉·哈瑞斯")
			延时(500)
			if 职业() == "潜行者" then
				local minc,maxc = 专业信息("草药学")
				num = 背包物品数量("闪光粉")
				if num < 40 or minc >=125 and maxc == 150 or minc >= 200 and maxc == 225 then
					if 坐飞机到("铁炉堡") then
						
					end
				elseif 坐飞机到("湿地") then
				elseif 坐飞机到("铁炉堡") then
				end
			else
				if 坐飞机到("湿地") then
				else
					if 地图名() == "希尔斯布莱德丘陵" then
						if 坐飞机到("铁炉堡") then
						
						end
					end
				end
			end
			if 在飞机上() then
				while 在飞机上() do 
					延时(1000)
				end
			else
				自动寻路(-835.725, -545.15, 14.0931)
				路径走到("铁炉堡到南海镇",-4822.53, -1153.34, 502.21)
				打开NPC("格莱斯·瑟登")
				延时(1000)
			end
		end
		if 地图名() == "铁炉堡" then
			if zy == "法师" then
				法师补充()
			end
			if zy == "潜行者" then
				盗贼补充()
			end
			提升草药技能()
			自动寻路(-4822.16, -1153.94, 502.209)
			if 打开NPC("格莱斯·瑟登") then
				延时(500)
			elseif 打开NPC("格莱斯·瑟登") then
				延时(500)
			end
			if 坐飞机到("湿地") then
				
			end
			if not 在飞机上() then
				铁炉堡到湿地()
			end
		end
		while 在飞机上() do 
			延时(1000)
		end
		if HP() > 1 then
			湿地到塞拉摩()
			if 地图名() == "尘泥沼泽" then
				x,y,z = 当前坐标()
				if y<-4320 then
					路径走到("塞拉摩到剃刀高地",-3829.9, -4520.5, 10.886)
					打开NPC("巴德拉克")
					--延时(500)
				end
				--打开NPC("巴德拉克")
				--[[延时(500)
				坐飞机到("萨兰纳尔")--]]
			end
			if 在飞机上() then
				while 在飞机上() do 
					延时(1000)
				end
				跳()
				延时(1000)
			else
				if HP() > 1 then
					if 地图名() == "尘泥沼泽" or 地图名() == "贫瘠之地" then
						if 在坐标范围(-2516.14, -1961.31, 91.7839,30) then
							走到(-2511.89, -1946.26, 91.7839)
							走到(-2533.44, -1924.41, 92.0282,1)
							路径走到("陶阿祖营地到剃刀沼泽",-4461.43, -1840.39, 86.7983)
						end
						--[[if not 在坐标范围(-4461.43, -1840.39, 86.7983,30) then
							路径走到("塞拉摩到剃刀高地",-4657.06, -1830.11, 85.3194)
							if 在坐标范围(-4657.06, -1830.11, 85.3194,10) and HP()>1 then
								坐船()
							end
						end--]]
						x,y,z = 当前坐标()
						if x > -4400 then
							if 在路径范围("塞拉摩到剃刀高地") then
								路径走到("塞拉摩到剃刀高地",-4461.43, -1840.39, 86.7983)
							end
						end
						if HP() == 0 then
							释放灵魂()
							虚弱复活()
						end
						if HP() == 1 then
							虚弱复活()
							复活()
						end
					end
				end
				--[[map = 地图名()
				if map == "千针石林" or map == "菲拉斯" then
					路径走到("萨兰纳尔到剃刀高地",-4493.89, -777.58, -40.1399)
					打开NPC("赛希亚娜")
					延时(500)
				end--]]
			end
			--[[map = 地图名()
			while map == "千针石林" or map == "菲拉斯" do
				if 在路径范围("萨兰纳尔到剃刀高地") then
					路径走到("萨兰纳尔到剃刀高地",-4669.17, -1819.6, -44.1768)
					if 在坐标范围(-4669.17, -1819.6, -44.1768,10) and HP()>1 then
						坐船()
					end
				end
				if HP() <= 1 then
					释放灵魂()
					x,y,z = 尸体坐标()
					路径走到("萨兰纳尔到剃刀高地",x,y,z)
					复活()
				end
				map = 地图名()
			end--]]
			map = 地图名()
			if map == "贫瘠之地" or map == "剃刀沼泽" and not 在副本() then
				if 在坐标范围(-2516.14, -1961.31, 91.7839,30) then
					走到(-2511.89, -1946.26, 91.7839)
					走到(-2533.44, -1924.41, 92.0282,1)
				end
				if 转场 == nil then
					x,y,z = 当前坐标()
					if x > -4400 then
						路径走到("陶阿祖营地到剃刀沼泽",-4462.47, -1663.36, 81.8901)
					end
				else
					路径走到("陶阿祖营地到剃刀沼泽",-4461.43, -1840.39, 86.7983)
				end
			end
		end
	end
end
function 潜行()
	if zy == "潜行者" and 可循环() then
		while not 存在BUFF("潜行") and 可循环() do 
			使用技能("潜行")
			延时(500)
		end
	elseif zy == "德鲁伊" then
		while not 存在BUFF("潜行") and 可循环() do 
			运行宏("/cast [stance:0/1/2/4]!猎豹形态/n/cast 潜行")
			延时(500)
		end
		
	end
end
function ZZ复活()
	if HP() == 0 then
		释放灵魂()
	end
	if HP() == 1 then
		if 在坐标范围(-2516.14, -1961.31, 91.7839,30) then
			走到(-2511.89, -1946.26, 91.7839)
			走到(-2533.44, -1924.41, 92.0282,1)
		end
		if 在坐标范围(-3969.14, -2012.31, 96.7839,30) then
			走到(-3952.89, -2021.26, 96.7839)
			走到(-3972.44, -2038.41, 92.0282,1)
		end
		map = 地图名()
		if map=="贫瘠之地" or map == "剃刀沼泽" then
			路径走到("陶阿祖营地到剃刀沼泽",-4462.47, -1663.36, 81.8901)
			复活()
			延时(300)
		end
	end
end
function ZZ进本()
	if not 在副本() then
		布瑞尔到陶拉祖营地()
		if 在坐标范围(-2516.14, -1961.31, 91.7839,30) then
			走到(-2511.89, -1946.26, 91.7839)
			走到(-2533.44, -1924.41, 92.0282,1)
		end
		if 在坐标范围(-3969.14, -2012.31, 96.7839,30) then
			走到(-3952.89, -2021.26, 96.7839)
			走到(-3972.44, -2038.41, 92.0282,1)
		end
		路径走到("陶阿祖营地到剃刀沼泽",-4462.47, -1663.36, 81.8901)
		if 在坐标范围(-4461.89, -1662.71, 81.8899,30) then
			while not 在副本() do
				走到(-4462.47, -1663.36, 81.8901,1,0,3)
				val = 检查挂机方案()
				if val == 11 or val == 22 then
					break
				end
				朝向坐标(-4460.77, -1661.46, 81.8899)
				移动("前",5000)
				while 过图中() do 
					延时(1000)
				end
				延时(500)
				ZZ复活()
			end
		end
	end
end
function 转场ZZ()

	while 地图名() == "血色修道院" do
		if HP() <= 1 then
			释放灵魂()
			虚弱复活()
		end
		使用物品("炉石")
		延时(3000)
		while 读条中() do 
			延时(1000)
		end
		延时(5000)
		while 过图中() do 
			延时(1000)
		end
		跳()
		延时(1000)
	end
	if HP()<= 1 then
		ZZ复活()
		if HP() == 1 then
			虚弱复活()
			if HP() == 1 then
				脱离卡死()
				释放灵魂()
				虚弱复活()
			end
		end
	end
	if zhenying == "部落" then
		if 地图名() == "幽暗城" then
			x,y,z = 当前坐标()
			if z < 50 then
				路径走到("幽暗城法师传送到旅店电梯",1595.18, 176.086, -41.4176)
				坐船()
			end
			路径走到("布瑞尔旅店到幽暗电梯上",2024.18, 289.523, 50.534)
		end
		if 小地图名()=="洛丹伦废墟" then
			路径走到("布瑞尔旅店到幽暗电梯上",2024.18, 289.523, 50.534)
		end
		布瑞尔到陶拉祖营地()
		x,y,z = 当前坐标()
		if x > -4400 then
			if 在路径范围("陶阿祖营地到剃刀沼泽") then
				路径走到("陶阿祖营地到剃刀沼泽",-4461.43, -1840.39, 86.7983)
			end
		end
	else
		南海镇到ZZ(1)
	end
end
function 剃刀高地出本()
	if HP()==0 then
		return
	end
	if 在副本() and 地图名() == "剃刀高地" then
		if 在坐标范围(2593.79, 1107.09, 51.3517,20) then
			走到(2593.79, 1107.09, 51.3517,1)
			走到(2593.39, 1112.37, 50.8241,1)
			while 在副本() do 
				移动("前",5000)
				延时(1000)
				while 过图中() do 
					延时(1000)
				end
				延时(1000)
			end
		end
	end
end
function 剃刀高地进本()
	if HP() == 0 then
		return
	end
	if not 在副本() and 地图名() == "剃刀高地" then
		if 在坐标范围(-4659.64, -2524.24, 81.374,40) then
			走到(-4657.06, -2523.46, 81.259,1)
			走到(-4659.79, -2527.99, 81.6801,1)
			while not 在副本() do
				移动("前",5000)
				延时(3000)
				while 过图中() do 
					延时(1000)
				end
				延时(1000)
				if not 在副本() then
					走到(-4657.06, -2523.46, 81.259,1)
					if zy == "潜行者" then
						使用技能("潜行")
					end
					val = 检查挂机方案()
					if val == 11 or val == 22 then
						break
					end
					延时(60000)
					走到(-4659.79, -2527.99, 81.6801,1)
				else
					break
				end
				if HP() <= 1 then
					剃刀复活()
				end
			end
		end
	end
end
function 高地跑路()
	if 在坐标范围(2593.68, 1111.23, 50.9518,20) then
		if zy=="法师" then
			使用技能("冰甲术")
		end
		走到(2586.95, 1084.16, 53.2496,1)
		if zy=="法师" then
			使用技能("寒冰护体")
		elseif zy == "潜行者" and 等级() < 54 then
			潜行()
		end
	end
	if 在坐标范围(2586.95, 1084.16, 53.2496,20) then
		走到(2565.1, 1068.05, 53.5457,1)
		if zy == "潜行者" then
			潜行()
		end
	end
	if 在坐标范围(2565.1, 1068.05, 53.5457,20) then
		走到(2561.52, 1063.72, 53.9734,1)
		if zy == "法师" then
			闪现走到(2553.09, 1043.65, 49.9679,1)
		elseif zy == "潜行者" then
			走到(2557.47, 1054.73, 51.5702)
			走到(2544.04, 1040.8, 47.6868,1)
		end
		走到(2514.37, 1044.46, 47.6438)
		走到(2499.73, 1051.15, 48.3117)
		走到(2489.22, 1049.59, 48.7737)
		走到(2483.37, 1053.25, 48.3056)
		走到(2471.49, 1049.82, 48.3277)
		走到(2464.42, 1024.9, 24.6677,1)
	end
	if 在坐标范围(2464.42, 1024.9, 24.6677,30) then
		走到(2459.02, 997.932, 26.8272)
		走到(2464.94, 981.747, 26.3059)
		走到(2468.85, 967.151, 26.4751)
		走到(2468.93, 954.233, 25.2737,1)
	end
	if 在坐标范围(2468.93, 954.233, 25.2737,10) then
		while HP() > 1 do
			走到(2465.72, 943.28, 25.4787) 
			走到(2458.47, 925.311, 28.424,1,0,1)
			写入朝向(3.3)
			按键("w",1)
			延时(800)
			按键("e",1)
			延时(500)
			按键("space")
			延时(300)
			按键("w",2)
			按键("e",2)
			x,y,z = 当前坐标()
			if z < 32 then
				移动("右",1100)
				移动("前",400)
			end
			x,y,z = 当前坐标()
			if z > 32 then
				break
			end
		end
		走到(2453.83, 931.038, 34.0678,1)
		走到(2451.52, 931.42, 34.6396)
		走到(2452.57, 940.28, 35.9485,1)
	end
	if 在坐标范围(2452.94, 941.674, 36.1561,20) then
		if not 战斗中() and 坐标范围有采集物(2453.73, 942.314, 36.3137,5) then
			范围采集(5)
			if zy == "潜行者" then
				潜行()
			end
		end
		走到(2452.57, 940.28, 35.9485,1)
		走到(2445.31, 949.09, 35.7445,1)
		走到(2436.13, 965.446, 37.9593,1)
		走到(2453.98, 994.653, 36.5649,1)
		走到(2448.89, 1007.03, 39.4297,1)
		if zy == "法师" then
			走到(2441.79, 1017.02, 37.4716,1)
			走到(2441.48, 1017.83, 37.4061,1)
			走到(2439.42, 1018.21, 37.32,1,0,0.3)
			走到(2438.01, 1023.86, 37.3267,1)
			走到(2428.41, 1028.25, 38.2325,1)
			走到(2424.72, 1027.2, 38.1614,1)
		else
			if zy == "潜行者" then
				if 战斗中() then
					使用技能("消失")
					延时(1000)
				end
				潜行()
			end
			走到(2433.56, 1027.16, 37.7529,1)
			走到(2424.72, 1027.2, 38.1614,1)
		end
		if not 战斗中() and 坐标范围有采集物(2426.25, 1028.39, 38.3597,6) then
			mincaiyao,maxcaiyao = 专业信息("草药学")
			if mincaiyao < 300 and maxcaiyao ==300 then
				走到(2426.25, 1028.39, 38.3597,1)
				范围采集(5)
				if zy == "潜行者" then
					潜行()
				end
				走到(2424.72, 1027.2, 38.1614,1)
			end
		end
	end
	if 在坐标范围(2424.72, 1027.2, 38.1614,20) then
		if zy == "法师" then
			闪现走到(2412.54, 1005.28, 39.9804,1)
		else
			走到(2412.54, 1005.28, 39.9804,1)
		end
		走到(2396.66, 1005.53, 40.235,1)
		
		while 坐标范围怪物数量(2374.63, 1011.61, 37.7977,18,"骷髅|召唤|冰",1) > 0 and HP() > 1 do 
			延时(1000)
		end
		延时(1000)
		
		走到(2379.44, 1018.98, 37.7065,1)
		if 战斗中() then
			if zy == "法师" then
				while 战斗中() do 
					使用技能("寒冰护体")
					local fi=0
					for fi=1,4 do
						使用技能("魔爆术")
						延时(1400)
					end
					技能输出()
				end
			else
				if zy == "潜行者" then
					if 战斗中() then
						使用技能("消失")
						延时(1000)
					end
					潜行()
				end
			end
		end
		if zy == "潜行者" then
			while not 存在BUFF("潜行") and HP()>1 do 
				使用技能("潜行")
				延时(500)
				if 战斗中() then
					使用技能("消失")
					延时(500)
				end
			end
		end
	end
	if 在坐标范围(2379.44, 1018.98, 37.7065,10) then
		while 坐标范围怪物数量(2364.99, 1003.88, 37.7614,15,"骷髅|召唤|冰",1) > 0 and HP() > 1 do 
			延时(1000)
		end
		走到(2365.04, 1010.69, 36.1738,1)
		走到(2353, 998.577, 41.1641,1)
		走到(2337.92, 976.888, 42.3027,1)
		if zy == "潜行者" then
			while not 存在BUFF("潜行") and HP()>1 do 
				使用技能("潜行")
				延时(500)
				if 战斗中() then
					使用技能("消失")
					延时(500)
				end
			end
		end
		走到(2336.49, 967.29, 43.528,1)
		if not 战斗中() and 坐标范围有采集物(2339.06, 968.12, 42.9717,6) then
			范围采集(5)
			if zy == "潜行者" then
				while not 存在BUFF("潜行") and HP()>1 do 
					使用技能("潜行")
					延时(500)
					if 战斗中() then
						使用技能("消失")
						延时(500)
					end
				end
			end
		end
		走到(2341.18, 954.068, 45.0781,1)
	end
	if 在坐标范围(2341.18, 954.068, 45.0781,20) then
		走到(2350.3, 945.253, 43.0641)
		走到(2362.55, 935.517, 43.5988,1)
		走到(2377.14, 925.685, 41.5174,1)
		if zy == "法师" then
			走到(2384.37, 921.472, 43.0942,1)
			走到(2399.75, 918.214, 40.4896,1)
			走到(2410.8, 919.375, 43.0538,1)
			走到(2417.24, 923.611, 44.999,1)
			走到(2420.53, 928.224, 44.6605,1)
			闪现走到(2412.96, 942.82, 46.7236,1)
			if 坐标范围有采集物(2412.59, 940.461, 45.3023,5) then
				走到(2409.59, 940.96, 46.3268,1)
			end
		else
			if 坐标范围怪物数量(2376.1, 934.385, 41.5789,10,"骷髅|召唤|冰",1) > 0 then
				while 坐标范围怪物数量(2376.1, 934.385, 41.5789,10,"骷髅|召唤|冰",1) > 0 and HP() > 1 do 
					延时(1000)
				end
			end
			走到(2383.45, 938.244, 44.1836)
			走到(2391.84, 940.898, 44.4857)
			走到(2403.59, 940.461, 46.3023,1)
			走到(2409.59, 940.96, 46.3268,1)
		end
		if not 战斗中() and 坐标范围有采集物(2412.59, 940.461, 45.3023,5) then
			范围采集(5)
			if zy == "潜行者" then
				while not 存在BUFF("潜行") and HP()>1 do 
					使用技能("潜行")
					延时(500)
					if 战斗中() then
						使用技能("消失")
						延时(500)
					end
				end
			end
		end
	end
	if 在坐标范围(2411.45, 941.154, 45.9734,10) then
		if 坐标范围怪物数量(2422.56, 952.694, 45.8269,17,"骷髅|召唤|冰",1) > 0 then
			while 坐标范围怪物数量(2422.56, 952.694, 45.8269,17,"骷髅|召唤|冰",1) > 0 and HP() > 1 do 
				延时(1000)
			end
			延时(3000)
		end
		走到(2419.36, 946.989, 46.2096)
		走到(2421.44, 951.1, 46.4242)
		走到(2424.29, 970.536, 47.6899,1)
		走到(2423.39, 976.272, 49.3224,1,0,0.3)
		走到(2421.22, 980.887, 49.4338,1,0,0.3)
		走到(2419.76, 981.357, 49.4291,1,0,0.3)
		走到(2417.44, 984.004, 49.7163,1)
		if 等级()>=52 then
			if not 战斗中() and 坐标范围有采集物(2422, 982.551, 48.5452,5) then
				朝向坐标(2416.45, 985.019, 50.2783)
				延时(200)
				if zy == "潜行者" then
					使用技能("扰乱")
					指向坐标(2429.34,986.12,48.69)
				end
				打开身边目标()
				延时(1000)
				if 读条中() then 
					范围采集(5)
				else
					while not 在坐标范围(2421.22, 980.887, 49.4338,4.9) and HP()>1 do
						朝向坐标(2422, 982.551, 48.5452)
						移动("前",110)
					end
					范围采集(5)
				end
				if zy == "潜行者" then
					while not 存在BUFF("潜行") and HP()>1 do 
						使用技能("潜行")
						延时(500)
						if 战斗中() then
							使用技能("消失")
							延时(500)
						end
					end
				end
			end
		end
		if 坐标范围怪物数量(2392.68, 986.234, 55.2956,22,"",1) > 7 then
			t=0
			while 坐标范围怪物数量(2392.68, 986.234, 55.2956,22,"",1) > 7 and HP() > 1 do 
				延时(1000)
				t=t+1
				if t>15 then
					break
				end
			end
			延时(3000)
		end
		走到(2412.56, 988.367, 50.8191,1,1)
		走到(2405.66, 990.602, 51.6108)
		走到(2394.53, 990.518, 52.6275)
		走到(2390.27, 987.477, 53.5095,1,0,0.4)
		朝向坐标(2392.31, 977.611, 55.5418)
		按键("w",1)
		延时(100)
		跳()
		延时(1000)
		按键("w",2)
		延时(500)
		走到(2392.31, 977.611, 55.5418,1,1)
	end
	if 在坐标范围(2392.31, 977.611, 55.5418,30) then
		if 等级()>=52 then
			if not 战斗中() and 坐标范围有采集物(2379.76, 980.507, 55.5393,5) then
				走到(2378.08, 970.968, 55.5858)
				if 等级() < 57 then
					走到(2376.43, 976.127, 55.2167,1,0,1)
				else
					走到(2376.43, 976.127, 55.2167,1)
				end
				if zy == "潜行者" then
					使用技能("扰乱")
					指向坐标(2382.76, 988.507, 55.5393)
				end
				while HP() > 1 do
					延时(300)
					打开身边目标()
					延时(1000)
					if 读条中() then
						while 读条中() do 
							延时(500)
						end
						延时(1500)
						移动("后",300)
						break
					else
						朝向坐标(2379.76, 980.507, 55.5393)
						移动("前",110)
					end
				end
				走到(2378.08, 970.968, 55.5858)
				if zy == "潜行者" then
					if 战斗中() then
						使用技能("消失")
					end
				end
				走到(2387.54, 968.64, 55.7454)
			end
		end
		走到(2409.98, 978.357, 57.1508,1)
		if not 战斗中() and 坐标范围有采集物(2409.98, 978.357, 57.1508,5) then
			范围采集(5)
		end
		if zy == "潜行者" then
			while not 存在BUFF("潜行") and HP()>1 do 
				使用技能("潜行")
				延时(500)
				if 战斗中() then
					使用技能("消失")
					延时(500)
				end
			end
		end
		走到(2417.49, 979.724, 56.3094,1)
		走到(2421.57, 969.634, 54.3386,0,0,3)		
		走到(2447.11, 951.149, 35.8092)
		走到(2449.12, 945.766, 36.0877)
		走到(2452.21, 938.783, 35.7283)
		走到(2451.93, 930.618, 34.4806)
		走到(2461.85, 927.508, 25.8485)
		走到(2456.24, 921.519, 31.1485,1)
		朝向坐标(2462.52, 893.24, 28.7937)
		按键("w",1)
		延时(2000)
		跳()
		延时(1000)
		按键("w",2)
		走到(2462.52, 893.24, 28.7937,1)
		if zy=="潜行者" then
			走到(2463.1, 893.48, 28.7277)
			使用技能("疾跑")
			走到(2457.18, 880.119, 31.2643)
			走到(2449.84, 870.708, 35.5613)
			走到(2444.88, 854.989, 40.6866,1)
			走到(2440.06, 840.568, 42.9939,1)
			走到(2436.55, 804.311, 43.6691,1)
			走到(2442.9, 783.122, 44.0274)
			走到(2444.53, 779.793, 44.1096)
		else
			走到(2469.02, 876.648, 32.4385,1)
			使用技能("寒冰护体")
			走到(2444.88, 854.989, 40.6866,1)
			走到(2440.06, 840.568, 42.9939,1)
			闪现走到(2436.55, 804.311, 43.6691,1)
			走到(2442.9, 783.122, 44.0274)
			走到(2444.53, 779.793, 44.1096)
		end
		走到(2458.96, 766.615, 45.6951,1)
	end
	if 在坐标范围(2458.87, 767.055, 45.5786,20) then
		走到(2468.08, 748.33, 46.0746)
		走到(2489.96, 753.213, 47.7587)
		if zy == "潜行者" then
			走到(2513.89, 746.94, 40.5676)
			走到(2518.42, 735.809, 40.4436)
			if not 战斗中() then
				走到(2513.65, 720.603, 41.9357,1)
			end
		else
			走到(2523.18, 747.561, 41.6425)
			走到(2524.5, 723.652, 40.7921,1)
		end
		if 战斗中() then
			if zy == "潜行者" then
				使用技能("消失")
			end
			走到(2530.23, 723.748, 41.5298,1)
			if 战斗中() then
				走到(2528.36, 732.679, 45.3136,1)
				走到(2524.78, 740.582, 47.8121,1,1)
				while 战斗中() do 
					延时(1000)
				end
				延时(3000)
				while 战斗中() do 
					延时(1000)
				end
			else
				走到(2524.5, 723.652, 40.7921,1)
			end
			while 坐标范围怪物数量(2516.02, 712.745, 43.8554,30,"猪",1)>0 and HP() > 1 do 
				延时(1000)
			end
			if zy == "潜行者" and 等级() < 54 then
				while HP() >1 and (not 存在BUFF("潜行")) do 
					使用技能("潜行")
					延时(500)
				end
			end
			走到(2507.06, 700.269, 49.3635,1)
		end
		走到(2498.12, 690.287, 54.0238,1)
		if 战斗中() then
			if zy=="法师" then
				使用技能("寒冰护体")
			end
			走到(2504.16, 688.019, 53.7039,1)
			while 战斗中() do 
				if zy=="法师" then
					使用技能("魔爆术")
					延时(1400)
				else
					技能输出()
				end
			end
			走到(2498.12, 690.287, 54.0238,1)
		end
	end
	if 在坐标范围(2498.12, 690.287, 54.0238,25) then
		if 坐标范围有采集物(2501.06, 666.093, 53.2512,1) then
			走到(2503.57, 667.67, 55.0031,1,0,0.3)
			延时(300)
			范围采集(4)
			走到(2498.12, 690.287, 54.0238,1)
			if zy == "潜行者" and 等级() < 54 then
				while HP() >1 and (not 存在BUFF("潜行")) do 
					使用技能("潜行")
					延时(500)
				end
			end
		end
		走到(2482.73, 699.669, 53.8322,1)
		走到(2464.33, 690.659, 55.8987,1)
		if 坐标范围有采集物(2461.37, 676.074, 63.8269,10) then
			走到(2457.26, 687.92, 56.3437,1)
			走到(2458.41, 683.196, 59.2712)
			走到(2459.94, 678.907, 62.5657,1,1)
			if 坐标范围有采集物(2463.23, 678.342, 63.5262,5) then
				走到(2463.23, 678.342, 63.5262,1,0,0.3)
			else
				走到(2458.27, 674.991, 63.3164,1,1)
			end
			延时(300)
			范围采集(5)
			if zy == "潜行者" and 等级() < 52 then
				while HP() >1 and (not 存在BUFF("潜行")) do 
					使用技能("潜行")
					延时(500)
				end
			end
			走到(2458.27, 674.991, 63.3164,1)
			走到(2450.92, 665.562, 55.8905,1,1)
		end
		if 坐标范围有采集物(2461.85, 641.773, 54.5309,1) then
			走到(2450.92, 665.562, 55.8905,1,1)
			走到(2457.24, 639.092, 54.9191)
			if 战斗中() then
				if zy == "潜行者" then
					使用技能("消失")
				end
			end
			走到(2460.79, 639.175, 54.903,1)
			走到(2461.85, 641.773, 54.5309,1,0,0.3)
			移动("右",100)
			延时(200)
			范围采集(1)
			走到(2460.79, 639.175, 54.903,1)
			走到(2454.9, 641.091, 54.5319)
			走到(2445.75, 673.307, 56.3547,1)
		end
		if 坐标范围有采集物(2435.03, 670.146, 54.6809,5) then
			走到(2435.03, 670.146, 54.6809,1)
			延时(200)
			范围采集(5)
			走到(2445.75, 673.307, 56.3547,1)
		end
		走到(2446.37, 680.259, 56.0474,1)
		走到(2479.93, 706.076, 54.0692,1)
		走到(2508, 736.501, 54.1492,1)
	end
	if 在坐标范围(2508, 736.501, 54.1492,10) then
		if zy == "潜行者" then
			while HP() >1 and (not 存在BUFF("潜行")) do 
				使用技能("潜行")
				延时(500)
			end
		elseif zy=="法师" then
			使用技能("寒冰护体")
		end
		走到(2527.44, 750.371, 53.7885,1,0,0.2)
		走到(2527.92, 755.652, 54.1205,1)
		if zy == "法师" then
			朝向坐标(2546.24, 751.723, 55.0614)
			按键("w")
			延时(100)
			使用技能("闪现术")
		else
			走到(2534.7, 763.078, 55.9584,1,0,0.2)
			走到(2538.24, 763.827, 54.2737,1,0,0.3)
			走到(2552.15, 748.996, 54.1597)
		end
		走到(2562.74, 750.639, 54.4596,1)
		if 战斗中() then
			走到(2597.53, 731.046, 56.651,1)
			走到(2600.09, 731.26, 56.514,1)
			朝向坐标(2603.71, 734.283, 59.3981)
			for ti=1,3 do 
				按键("w",1)
				延时(50)
				跳()
				延时(500)
				按键("w",2)
			end
			while 战斗中() do 
				延时(1000)
			end
			延时(3000)
			while 战斗中() do 
				延时(1000)
			end
			走到(2596.48, 728.436, 55.9331,1)
			走到(2567.42, 749.367, 54.4362,1)
		end
		if zy == "潜行者" then
			取消BUFF("潜行")
		end
	end
	if HP() ==0 then
		return
	end
	local enum=0
	for gi=1,1 do
		if 在坐标范围(2562.74, 750.639, 54.4596,20) then
			if 坐标范围有采集物(2565.13, 770.449, 55.8535,5) then
				走到(2565.13, 770.449, 55.8535,1)
				范围采集(5)
				enum=enum+1
			end
			走到(2562.74, 750.639, 54.4596,1)
			if 坐标范围有采集物(2595.02, 764.03, 53.7439,5) then
				走到(2584.05, 763.742, 54.0022,1)
				朝向坐标(2589.99, 766.68, 53.0394)
				移动("前",500)
				打开身边目标()
				延时(500)
				走到(2595.02, 764.03, 53.7439,1)
				范围采集(5)
				enum=enum+1
				if enum>=2 then
					break
				end
				走到(2581, 763.741, 54.2677,1)
			end
			走到(2580.61, 741.832, 55.094,1)
			走到(2597.05, 719.524, 54.4982,1)
		end
		if 在坐标范围(2597.05, 719.524, 54.4982,20) then
			if 坐标范围有采集物(2612.63, 733.395, 54.6644,5) then
				走到(2603.17, 724.926, 54.6714,1)
				朝向坐标(2610.99, 728.167, 54.0805)
				移动("前",500)
				打开身边目标()
				延时(500)
				走到(2612.63, 733.395, 54.6644,1)
				范围采集(5)
				enum=enum+1
				if enum>=2 then
					break
				end
				走到(2597.48, 718.891, 54.4726,1)
			end
			走到(2597.48, 718.891, 54.4726,1)
			if 坐标范围有采集物(2600.98, 701.106, 55.4706,6) then
				走到(2599.45, 712.219, 54.4268,1)
				移动("前",500)
				打开身边目标()
				延时(500)
				走到(2601.12, 701.161, 55.46,1)
				范围采集(5)
				enum=enum+1
				if enum>=2 then
					break
				end
				走到(2597.41, 717.837, 54.4478,1)
			end
			走到(2587.02, 710.02, 56.2851,1)
			走到(2578.68, 706.308, 56.7415,1)
		end
		if 在坐标范围(2578.68, 706.308, 56.7415,15) then
			if 坐标范围有采集物(2582.29, 693.508, 56.6586,3) then
				走到(2580.82, 701.949, 56.9733,1)
				移动("前",500)
				打开身边目标()
				延时(500)
				走到(2582.29, 693.508, 56.6586,1)
				范围采集(4)
				enum=enum+1
				if enum>=2 then
					break
				end
				走到(2578.68, 706.308, 56.7415,1)
			end
		end
	end
end
function 剃刀复活()
	if HP() == 0 then
		释放灵魂()
	end
	if HP() == 1 then
		if 在坐标范围(-2516.14, -1961.31, 91.7839,30) then
			走到(-2511.89, -1946.26, 91.7839)
			走到(-2533.44, -1924.41, 92.0282,1)
		end
		if 在坐标范围(-3969.14, -2012.31, 96.7839,30) then
			走到(-3952.89, -2021.26, 96.7839)
			走到(-3972.44, -2038.41, 92.0282,1)
		end
		map = 地图名()
		if map=="贫瘠之地" or map == "剃刀高地" then
			x,y,z = 尸体坐标()
			路径走到("陶阿祖营地到剃刀高地",x,y,z)
			复活()
			while 过图中() do 
				延时(1000)
			end
			if HP() <= 1 then
				路径走到("陶阿祖营地到剃刀高地",-4659.06, -2526.03, 81.4828)
				复活()
				延时(300)
			end
		end
	end
end
function 监狱进本(cz)
	if cz==nil then
		cz=需要重置
	end
	if not 在副本() then
		if 在坐标范围(-8779.98, 836.977, 94.089,40) then
			走到(-8788.51, 827.606, 97.6466,1)
			if cz == 1 and 是否队长() == true then
				队伍拾取()
				重置副本()
				需要重置=0
				if 已重置次数 ~= nil then
					已重置次数=已重置次数+1
					置重置次数(已重置次数)
				end
			end
			while not 在副本() do
				走到(-8772.06, 840.482, 90.9256,1)
				朝向坐标(-8763.13, 847.128, 87.909)
				移动("前",6000)
				for i=1,6 do 
					if 过图中() then
						break
					end
					延时(1000)
				end
				延时(1000)
				while 过图中() do 
					延时(1000)
				end
				if 在副本() then
					return
				end
				走到(-8788.51, 827.606, 97.6466,1)
				while zy=="法师" and 等级() >= 58 and 战斗中() do 
					使用技能("魔爆术")
					延时(1400)
				end
				延时(20000)
				val = 检查挂机方案()
				if val == 11 or val == 22 then
					return
				end
				if 等级() < 30 then
					break
				end
			end
		end
	end
end
function 监狱出本()
	if 在副本() and 地图名()=="监狱" then
		需要重置=1
		路径寻路("监狱出本")
		自动跑()
		延时(3000)
		while 过图中() do 
			延时(1000)
		end
		延时(1000)
		按键("w")
		if not 在副本() then
			走到(-8786.84, 828.974, 97.6513,1)
		end
	end
end
function STSM回血()
	if HP() > 1 and HP()/MaxHP() < 0.6 then
		使用物品("特效治疗药水")
	end
end
function STSM回蓝()
	if HP() > 1 and MP()/MaxMP() < 0.2 then
		使用物品("强效法力药水")
		使用物品("法力黄水晶")
	end
end
function 鹰巢山卖物()
	if 地图名() == "辛特兰" then
		路径走到("鹰巢山西瘟疫",334.069, -2091.51, 131.564)
		打开NPC("哈尔甘")
		for i=1,3 do
			延时(1000)
			出售垃圾()
		end
		走到(340.063, -2099.39, 131.562)
		走到(347.47, -2131.12, 121.839,1)
		路径走到("鹰巢山西瘟疫",293.611, -2116.94, 121.838)
		发送邮件()
		路径走到("鹰巢山到飞机场",282.695, -2001.7, 194.126)
		打开NPC("戈斯鲁姆")
		延时(1000)
		坐飞机到("东瘟疫之地")
		延时(1000)
		while 在飞机上() do 
			延时(1000)
		end
		跳()
		延时(1000)
	end
end
function 铁炉堡卖物()
	if 地图名() == "铁炉堡" then
		if 在坐标范围(-4613.71, -915.287, 501.062,25) then
			闪现走到(-4635.17, -929.284, 502.767)
			走到(-4648.32, -936.363, 501.657,1)
			走到(-4664.49, -912.265, 501.644)
			走到(-4657.05, -902.264, 507.475)
			走到(-4662.63, -897.05, 508.863,1)
		end
		if 在坐标范围(-4654.28, -891.709, 508.863,10) then
			走到(-4654.28, -891.709, 508.863,1)
			打开NPC("宾古斯")
			延时(500)
			for i=1,2 do 
				延时(500)
				出售垃圾()
			end
			走到(-4662.63, -897.05, 508.863)
			走到(-4657.05, -902.264, 507.475)
			走到(-4664.49, -912.265, 501.644,1)
		end
		上马()
		if 在坐标范围(-4664.49, -912.265, 501.644,30) then
			走到(-4717.4, -904.677, 501.659)
			走到(-4785.19, -881.748, 501.659)
			走到(-4845.49, -880.056, 501.764,1)
			发送邮件()
		end
		if 在坐标范围(-4845.49, -880.056, 501.764,10) then
			if 背包物品数量("传送符文") < 2 then
				走到(-4865.3, -882.9, 501.659)
				走到(-4866.7, -874.014, 502.192)
				走到(-4865.39, -866.57, 502.192,1)
				打开NPC("巴瑞姆·贾根斯塔德")
				延时(500)
				购买物品(7,20-背包物品数量("传送符文"))
				延时(1500)
				走到(-4866.7, -874.014, 502.192)
				走到(-4865.3, -882.9, 501.659,1)
				上马()
			end
			走到(-4899.74, -897.854, 501.659)
			走到(-4891.04, -919.401, 501.634)
			走到(-4929.86, -956.37, 501.546)
			走到(-4942.52, -998.06, 501.442)
			走到(-4946.42, -1022.8, 501.461)
			走到(-4879.69, -1061.22, 502.209)
			走到(-4866.59, -1118.64, 502.213)
			走到(-4843.5, -1151.51, 502.205)
			走到(-4824.34, -1158.52, 502.21)
			走到(-4821.95, -1153.45, 502.21,1)
		end
		if 在坐标范围(-4821.95, -1153.45, 502.21,10) then
			走到(-4821.95, -1153.45, 502.21,1)
		end
		打开NPC("格莱斯·瑟登")
		延时(1000)
		坐飞机到("东瘟疫之地")
		延时(1000)
		while 在飞机上() do 
			延时(1000)
		end
		跳()
		延时(1000)
	end
end
function 幽暗城卖物()
	if 地图名() == "幽暗城" then
		if 在坐标范围(1770.91, 63.2758, -46.321,10) then
			走到(1787.8, 80.7564, -52.8169)
			走到(1771.95, 94.6324, -60.2135,1)
			if 背包物品数量("传送符文") < 2 then
				走到(1768.18, 87.6252, -59.3506)
				走到(1776.03, 79.6393, -59.3363,1)
				打开NPC("汉娜·阿克雷")
				延时(500)
				出售垃圾()
				延时(500)
				购买物品(7,20-背包物品数量("传送符文"))
				延时(1500)
				走到(1759.23, 95.0426, -62.2708,1)
			end
			上马()
			走到(1740.18, 106.361, -62.2901)
			走到(1729.96, 124.327, -60.3199)
			走到(1717.35, 115.737, -55.2153)
			走到(1693.54, 141.597, -55.2132)
			走到(1702.68, 151.736, -60.4613)
			走到(1691.94, 197.249, -62.1736,1)
			打开NPC("舍尔顿·冯·克罗伊")
			延时(500)
			for i=1,4 do
				出售垃圾()
				延时(500)
			end
			走到(1711.12, 179.094, -60.7396)
			走到(1726.52, 203.143, -61.6208)
			走到(1727.25, 229.901, -62.1774)
			走到(1709.48, 236.285, -62.1774)
			走到(1669.92, 235.323, -62.1774)
			走到(1644.42, 199.014, -62.1821)
			走到(1631.17, 204.599, -60.7751)
			走到(1610.01, 223.359, -61.9035)
			走到(1595.66, 220.901, -57.1617)
			走到(1595.25, 231.808, -52.1524)
			走到(1603.86, 232.962, -52.1488)
			走到(1609.26, 239.843, -51.8356)
			走到(1628.22, 239.008, -43.342)
			走到(1632.4, 231.885, -43.1016)
			走到(1631.42, 219.223, -43.1016,1)
			发送邮件()
		end
		if 在坐标范围(1631.42, 219.223, -43.1016,12) then
			走到(1634.53, 259.748, -43.1016,1)
			打开NPC("劳伦·纽科布")
			延时(500)
			for i=1,4 do 
				延时(500)
				出售垃圾()
			end
			走到(1631.42, 219.223, -43.1016,1)
			发送邮件()
		end
		if 在坐标范围(1631.42, 219.223, -43.1016,6) then
			走到(1633.25, 246.653, -43.1027)
			走到(1627.23, 260.431, -43.1027)
			走到(1608.64, 276.7, -43.1027)
			走到(1584.84, 276.681, -43.1027,1)
			走到(1567.27, 266.857, -43.1027,1)
		end
		if 在坐标范围(1584.84, 276.681, -43.1027,20) then
			走到(1584.84, 276.681, -43.1027,1)
			走到(1567.27, 266.857, -43.1027,1)
		end
		打开NPC("迈克尔·加勒特")
		延时(1000)
		坐飞机到("东瘟疫之地")
		延时(1000)
		while 在飞机上() do 
			延时(1000)
		end
		跳()
		延时(1000)
	end
end
function 卖物()
	鹰巢山卖物()
	铁炉堡卖物()
	幽暗城卖物()
end
function 到东瘟疫()
	local map = 地图名()
	if map == "铁炉堡" then
		自动寻路(-4822.16, -1153.94, 502.209)
		if 打开NPC("格莱斯·瑟登") then
			延时(500)
		elseif 打开NPC("格莱斯·瑟登") then
			延时(500)
		end
		if 坐飞机到("东瘟疫") then
			
		end
	elseif map == "幽暗城" then
		上马()
		if 在坐标范围(1633.25, 222.653, -43.1027,40) then
			走到(1633.25, 246.653, -43.1027)
			走到(1627.23, 260.431, -43.1027)
			走到(1608.64, 276.7, -43.1027)
			走到(1584.84, 276.681, -43.1027,1)
			走到(1567.27, 266.857, -43.1027,1)
		end
		if 在坐标范围(1584.84, 276.681, -43.1027,20) then
			走到(1584.84, 276.681, -43.1027,1)
			走到(1567.27, 266.857, -43.1027,1)
		end
		打开NPC("迈克尔·加勒特")
		打开NPC("迈克尔·加勒特")
		延时(1000)
		坐飞机到("东瘟疫之地")
		延时(1000)
	end
	if 在飞机上() then
		while 在飞机上() do 
			延时(1000)
		end
		跳()
		延时(1000)
	end
end
function 到STSM()
	if HP() <= 1 or 在副本() then
		return
	end
	沙城回主城()
	到东瘟疫()
	x,y,z = 当前坐标()
	if 地图名() == "东瘟疫之地" and (not 在坐标范围(3227, -4036.57, 108.421,39)) and x < 3187 then
		if 是否队长() then
			队伍拾取()
		end
		延时(300)
		提示("跑本STSM")
		if zy == "法师" then
			使用技能("冰甲术")
		end
		上马()
		if 在坐标范围(2326.44, -5281.33, 81.7971,10) then
			走到(2326.44, -5281.33, 81.7971,1)
		end
		路径走到("东瘟疫到斯坦索姆",3183.01, -4039.87, 107.671)
		下马()
		if 战斗中() then
			清除目标()
			if zy == "法师" then
				使用技能("寒冰护体")
				延时(1400)
			elseif zy  == "圣骑士" then
				使用技能("正义圣印")
				延时(1400)
			end
			while 战斗中() do 
				x,y,z=目标坐标()
				朝向坐标(x,y,z)
				if zy == "法师" then
					使用技能("寒冰箭")
					使用技能("寒冰箭")
					延时(200)
				elseif zy == "圣骑士" then
					技能输出()
				end
				while 读条中() do 
					延时(100)
				end
			end
		end
		路径走到("东瘟疫到斯坦索姆",3183.01, -4039.87, 107.671)
		if HP() <= 1 then
			while HP() <= 1 do
				if HP()==0 then
					x,y,z = 当前坐标()
					if 在坐标范围(3190.28, -4039.69, 107.991,40) then
						释放灵魂()
						路径走到("STSM复活",3190.28, -4039.69, 107.991)
						复活()
						延时(1000)
						if HP() > 1 then
							break
						end
					end
				else
					x,y,z=尸体坐标()
					路径走到("STSM复活",3188.92, -4039.21, 107.991)
					复活()
					延时(1000)
					if HP() == 1 then
						路径走到("东瘟疫到斯坦索姆",x,y,z,25)
						复活()
					end
					使用技能("冰甲术")
					上马()
					路径走到("东瘟疫到斯坦索姆",3183.01, -4039.87, 107.671)
					下马()
				end
				朝向坐标(3227.41, -4036.57, 108.421)
				走到(3192.1, -4039.05, 107.991,1)
				复活()
				延时(1000)
				走到(3183.9, -4038.9, 107.991,1)
			end
		end
		while HP()>1 do
			x,y,z = 当前坐标()
			if x>3187 then
				break
			end
			if 在坐标范围(3183.4, -4039.19, 107.866,5) then
				朝向坐标(3227.41, -4036.57, 108.421)
				打开身边目标()
				延时(300)
				while 读条中() do 
					延时(100)
				end
				移动("前",1500)
				if 在坐标范围(3192.1, -4039.05, 107.991,5) then
					break
				end
			end
			延时(1000)
			走到(3183.9, -4038.9, 107.991,1)
		end	
		x,y,z = 当前坐标()
		if 在坐标范围(3192.1, -4039.05, 107.991,15) and x>3187 then
			if 是否队长() then
				走到(3191.07, -4043.47, 107.992,1)
				num=队伍人数()
				while 坐标范围队员数量(3233.59, -4048.46, 108.444,45)<num-1 do
					打开身边目标()
					延时(7000)
				end
			end
			走到(3227.41, -4036.57, 108.421,1)
			走到(3233.59, -4048.46, 108.444,1)
		end
	end
end
function 跑本()
	if HP() <= 1 or 在副本() then
		return
	end
	卖物()
	x,y,z = 当前坐标()
	if 地图名() == "东瘟疫之地" and (not 在坐标范围(3227, -4036.57, 108.421,39)) and x < 3187 then
		if 是否队长() then
			队伍拾取()
		end
		延时(300)
		提示("跑本")
		使用技能("冰甲术")
		上马()
		if 在坐标范围(2326.44, -5281.33, 81.7971,10) then
			走到(2326.44, -5281.33, 81.7971,1)
		end
		路径走到("东瘟疫到斯坦索姆",3183.01, -4039.87, 107.671)
		下马()
		if 战斗中() then
			清除目标()
			使用技能("寒冰护体")
			延时(1500)
			while 战斗中() do 
				x,y,z=目标坐标()
				朝向坐标(x,y,z)
				使用技能("寒冰箭")
				使用技能("寒冰箭")
				延时(200)
				while 读条中() do 
					延时(100)
				end
			end
		end
		if HP() <= 0 then
			while HP() <= 1 do
				if HP()==0 then
					x,y,z = 当前坐标()
					if 在坐标范围(3190.28, -4039.69, 107.991,40) then
						释放灵魂()
						路径走到("STSM复活",3190.28, -4039.69, 107.991)
						复活()
						延时(1000)
						if HP() > 1 then
							break
						end
					end
				else
					x,y,z=尸体坐标()
					路径走到("STSM复活",3188.92, -4039.21, 107.991)
					复活()
					延时(1000)
					if HP() == 1 then
						路径走到("东瘟疫到斯坦索姆",x,y,z,25)
						复活()
					end
					使用技能("冰甲术")
					上马()
					路径走到("东瘟疫到斯坦索姆",3183.01, -4039.87, 107.671)
					下马()
				end
				朝向坐标(3227.41, -4036.57, 108.421)
				走到(3192.1, -4039.05, 107.991,1)
				复活()
				延时(1000)
				走到(3183.9, -4038.9, 107.991,1)
			end
		end
		while HP()>1 do
			x,y,z = 当前坐标()
			if x>3187 then
				break
			end
			if 在坐标范围(3183.4, -4039.19, 107.866,5) then
				朝向坐标(3227.41, -4036.57, 108.421)
				打开身边目标()
				延时(300)
				while 读条中() do 
					延时(100)
				end
				移动("前",1500)
				if 在坐标范围(3192.1, -4039.05, 107.991,5) then
					break
				end
			end
			延时(1000)
			走到(3183.9, -4038.9, 107.991,1)
		end	
		x,y,z = 当前坐标()
		if 在坐标范围(3192.1, -4039.05, 107.991,15) and x>3187 then
			if 是否队长() then
				走到(3191.07, -4043.47, 107.992,1)
				num=队伍人数()
				while 坐标范围队员数量(3233.59, -4048.46, 108.444,35)<num-1 do
					打开身边目标()
					延时(7000)
				end
			end
			走到(3227.41, -4036.57, 108.421,1)
			走到(3233.59, -4048.46, 108.444,1)
		end
	end
end
function 检查回城()
	local 需要回城=0
	if 是否队长() then
		if 背包空格() < 4 or  需要修理()  then
			运行宏("/run SetLootMethod('roundrobin')")
			需要回城=1
		end
	else
		for i=1,10,1 do 
			if 分配方式() == 'roundrobin' then
				需要回城=1
				break
			end
			if 分配方式() == 'group' then
				break
			end
			延时(1000)
		end
	end
	if 需要回城==1 then
		if 阵营() == "联盟" then
			local ls=炉石位置()
			if ls~='蛮锤城堡' then 
				提示('炉石未绑定蛮锤城堡，回铁炉堡')
				使用技能("传送：铁炉堡")
			else
				使用物品("炉石")
			end
			延时(15000)
			while 过图中() do 
				延时(100)
			end
			延时(1000)
		else
			if 背包物品数量("传送符文") > 0 then
				使用技能("传送：幽暗城")
			else
				if 炉石位置() == "幽暗城" then
					使用物品("炉石")
				else
					while 炉石位置() ~= "幽暗城" do
						提示("请把炉石绑定在幽暗城或购买传送符文")
						延时(10000)
						if 背包物品数量("传送符文") > 0 then
							使用技能("传送：幽暗城")
							延时(3000)
							if 读条中() then
								break
							else
								提示("未学习传送幽暗城技能")
							end
						end
					end 
				end
			end
			延时(15000)
			while 过图中() do 
				延时(100)
			end
			延时(1000)
		end
		卖物()
		return true
	end
	return false
end
function 到内杀怪点()
	路径走到("STSM2",3602.28, -3489.53, 135.907)
	处理眼睛()
end
function 拾取2()
	走到(3648.26, -3540.29, 137.915,1)
	if yanjing==0 then
		if 处理眼睛() then
			yanjing=1
		end
	end
	摸尸体(20)
	走到(3640.87, -3523.55, 136.98)
	if yanjing==0 then
		if 处理眼睛() then
			yanjing=1
		end
	end
	摸尸体(20)
	走到(3626.09, -3508.95, 136.707,1)
	if yanjing==0 then
		if 处理眼睛() then
			yanjing=1
		end
	end
	摸尸体(20)
	走到(3618.47, -3500.97, 137.058,1)
	if yanjing==0 then
		if 处理眼睛() then
			yanjing=1
		end
	end
	摸尸体(20)
	走到(3605.92, -3489.25, 136.076,1)
	if yanjing==0 then
		if 处理眼睛() then
			yanjing=1
		end
	end
	摸尸体(20)
	走到(3596.16, -3478.61, 134.826,1)
	if yanjing==0 then
		if 处理眼睛() then
			yanjing=1
		end
	end
	摸尸体(20)
	走到(3602.28, -3489.53, 135.907,1)
	摸尸体(40)
end
function 单点()
	if 战斗中() then
		x,y,z = 当前坐标()
		if 坐标范围怪物数量(x,y,z,60) == 1 then
			选怪("",50,1)
			延时(200)
			x,y,z = 目标坐标()
			if x~=0 then
				走到(x,y,z,1,0,35)
				for fi=1,3 do
					for i=1,10 do 
						x,y,z = 目标坐标()
						朝向坐标(x,y,z)
						延时(100)
						使用技能("寒冰箭")
						延时(100)
						if 读条中() then
							break
						end
						x,y,z = 当前坐标()
						if 坐标范围怪物数量(x,y,z,15)>0 then
							break
						end
					end
					if 读条中() then
						while 读条中() do 
							延时(100)
							x,y,z = 目标坐标()
							朝向坐标(x,y,z)
						end
						x,y,z = 当前坐标()
						if 坐标范围怪物数量(x,y,z,10)>0 then
							使用技能("冰霜新星(等级 1)")
						end
						if 坐标范围怪物数量(x,y,z,15)>0 then
							break
						end
					else
						return false
					end
				end
				return true
			end
		end
	end
	return false
end
function 单点胖子()
	if HP() <= 1 then
		return true
	end
	local ddzz=0
	local x,y,z = 当前坐标()
	if 范围选怪(x,y,z,50,"缝补憎恶")~=0 then
		local x,y,z=当前坐标()
		if 目标的目标是我() == false then
			ddzz=1
			t=0
			if 有目标() then
				while 有目标() do
					for i=1,20 do 
						x,y,z = 目标坐标()
						朝向坐标(x,y,z)
						走到(x,y,z,1,0,35)
						延时(300)
						使用技能("寒冰箭")
						if 读条中() then
							break
						end
						if 目标的目标是我() then
							return false
						end
					end
					while 读条中() do
						延时(100)
						x,y,z = 目标坐标()
						朝向坐标(x,y,z)
					end
					if not 战斗中() then
						break
					end
					t=t+1
					if t>=2 or 坐标范围怪物数量(x,y,z,10) > 0 then
						使用技能("冰霜新星(等级 1)")
						break
					end
				end
				return true
			end
		end
	end
	return false
end
function 单杀处理()
	while 战斗中() do
		STSM回蓝()
		for i=1,1 do
			x,y,z = 当前坐标()
			if 选怪("尸",50,1) then
				延时(100)
				break
			end
			if 选怪("缝补憎恶",50,1) then
				延时(100)
				break
			end
			if 选怪("石像鬼",50,1) then
				延时(100)
				break
			end
		end
		x,y,z = 目标坐标()
		if 在坐标范围(x,y,z,50) then
			if 单点胖子() then
			else
				if 目标的目标是我() then
					闪现走到(3684.2, -3588.57, 137.876,1)
				end
				if MP()<300 then
					延时(200)
					使用技能("唤醒")
					延时(200)
					while 读条中() do 
						延时(100)
					end
				end
			end
			x,y,z = 目标坐标()
			if 目标的目标是我() == false then
				走到(x,y,z,1,0,38)
			end
			if 战斗中() then
				x,y,z = 目标坐标()
				朝向坐标(x,y,z)
				延时(200)
				for iii=1,5 do
					延时(200)
					使用技能("寒冰箭")
					if 读条中() then
						break
					end
				end
				x,y,z = 当前坐标()
				while 读条中() do 
					延时(100)
				end
				if 坐标范围怪物数量(x,y,z,10) > 0 then
					使用技能("冰霜新星(等级 1)")
				else
					使用技能("火焰冲击")
				end
			else
				break
			end
			if 目标的目标是我() then
				闪现走到(3643.69, -3591.19, 137.858,1)
			end
			if MP()<300 then
				延时(200)
				使用技能("唤醒")
				延时(200)
				while 读条中() do 
					延时(100)
				end
			end
			x,y,z = 目标坐标()
			if 目标的目标是我() then
				走到(x,y,z,1,0,38)
			end
			if 战斗中() then
				x,y,z = 目标坐标()
				朝向坐标(x,y,z)
				延时(200)
				x,y,z = 当前坐标()
				for iii=1,5 do
					延时(200)
					使用技能("寒冰箭")
					if 读条中() then
						break
					end
				end
				while 读条中() do 
					延时(100)
				end
				if 坐标范围怪物数量(x,y,z,10) > 0 then
					使用技能("冰霜新星(等级 1)")
				else
					使用技能("火焰冲击")
				end
			else
				break
			end
			if 目标的目标是我() then
				闪现走到(3641.72, -3605.93, 137.626,1)
			end
			if MP()<300 then
				延时(200)
				使用技能("唤醒")
				延时(200)
				while 读条中() do 
					延时(100)
				end
			end
			x,y,z = 目标坐标()
			if 目标的目标是我()==false then
				走到(x,y,z,1,0,38)
			end
			if 战斗中() then
				x,y,z = 目标坐标()
				朝向坐标(x,y,z)
				延时(200)
				x,y,z = 当前坐标()
				for iii=1,5 do
					延时(200)
					使用技能("寒冰箭")
					if 读条中() then
						break
					end
				end
				while 读条中() do 
					延时(100)
				end
				if 坐标范围怪物数量(x,y,z,10) > 0 then
					使用技能("冰霜新星(等级 1)")
				else
					使用技能("火焰冲击")
				end
			else
				break
			end
		end
		按键("tab")
		延时(200)
	end
end
function 拉怪1()
	if HP()<=1 then
		return
	end
	if HP()>1 then
		jl=0
		while 技能可用("寒冰屏障") == false do 
			延时(1000)
			if 技能可用("急速冷却") then
				jl=1
				break
			end
			延时(500)
			提示("等待冰箱CD..."..tostring(os.clock()-bxtime))
		end
		补状态()
		回满()
		while 坐标范围怪物数量(3648.49, -3520.92, 136.805,20,"缝补憎恶|食尸鬼",1) > 0 do 
			延时(500)
		end
		使用技能("寒冰护体")
		延时(1500)
		使用技能("法力护盾")
		延时(1500)
		回满()
		使用技能("防护冰霜结界")
		延时(1000)
		走到(3646.96, -3514.9, 136.435,1)
		处理眼睛()
		使用技能("暴风雪(等级 1)")
		指向坐标(3644.67, -3481.24, 137.987)
		范围选怪(3629.99, -3498.5, 136.744,10,"")
		延时(1400)
		--使用技能("冰枪术")
		走到(3651.7, -3531.5, 137.66)
		闪现走到(3655.22, -3576.69, 137.9)
		走到(3654.92, -3585.06, 137.511)
		范围选怪(3646.58, -3621.59, 137.629,10,"死尸|骷髅")
		走到(3653.12, -3601.75, 137.14)
		使用技能("冰枪术")
		走到(3669.15, -3612.63, 137.516)
		使用技能("寒冰护体")
		走到(3686.77, -3615.14, 138.766)
		使用技能("法力护盾")
		走到(3716.96, -3599.65, 141.83,1)
		朝向坐标(3686.32, -3583.34, 138.342)
		if HP() > 1 then
			使用技能("寒冰屏障")
			x,y,z = 当前坐标()
			bxtime=os.clock()
			延时(8000)
			按键("w",1)
			while 在坐标范围(x,y,z,0.01) do 
				使用技能("冰霜新星(等级 1)")
				延时(10)
			end
			延时(1100)
			使用技能("闪现术")
			跳()
			使用技能("闪现术")
			按键("w",2)
			闪现走到(3683.45, -3580.98, 138.282,1)
			使用技能("冰冷血脉")
			使用技能("召唤水元素")
			延时(1400)
			使用技能("暴风雪")
			指向坐标(3711.77, -3596.83, 141.366)
			延时(5000)
			使用技能("冰冻术")
			指向坐标(3708.75, -3595.64, 140.867)
			延时(1400)
			使用技能("烈焰风暴")
			指向坐标(3708.75, -3595.64, 140.867)
			延时(300)
			while 读条中() do 
				延时(100)
			end
			使用技能("暴风雪")
			指向坐标(3701.72, -3591.76, 139.896)
			延时(6500)
			使用技能("寒冰护体")
			走到(3675.77, -3582.03, 137.577,1)
			使用技能("暴风雪")
			指向坐标(3698.06, -3590.34, 139.377)
			延时(500)
			for i=1,60 do 
				延时(100)
				if 读条中() then
				else
					break
				end
			end
			使用技能("暴风雪")
			指向坐标(3693.22, -3587.06, 138.558)
			延时(500)
			for i=1,60 do 
				延时(100)
				if 读条中() then
				else
					break
				end
			end
			使用技能("防护冰霜结界")
			走到(3661.35, -3582.56, 137.069,1)
			使用技能("暴风雪")
			指向坐标(3685.71, -3588.08, 137.977)
			延时(7500)
		end
	end
end
function 路线2()

	走到(3698.38, -3642.1, 139.671,1)
	t=0
	while 坐标范围怪物数量(3709.017822,-3609.306152,141.0203705,10) < 1 and HP() > 1 do 
		延时(100)
		t=t+1
		if t>50 then
			break
		end
	end
	STSM回蓝()
	使用技能("暴风雪") --第二场雪
	指向坐标(3709.017822,-3609.306152,141.0203705)
	延时(300)
	if 读条中() then
		for i=1,38 do 
			延时(200)
			if not 读条中() then
				break
			end
		end
	end
	if 坐标范围怪物数量(3698.38, -3642.1, 139.671,8)>0 then
		使用技能("冰霜新星(等级 1)")
	end
	走到(3696.09, -3657.83, 138.857,1)
	STSM回血()
	延时(100)
	使用技能("寒冰护体")
	延时(1400)
	t=0
	while 坐标范围怪物数量(3700.549316,-3622.559814,140.2452698,10) < 1 and HP() > 1 do 
		延时(100)
		t=t+1
		if t>70 then
			break
		end
	end
	使用技能("暴风雪") --第三场雪
	指向坐标(3700.549316,-3622.559814,140.2452698)
	延时(300)
	if 读条中() then
		for i=1,38 do 
			延时(200)
			if not 读条中() then
				break
			end
		end
	end
	STSM回蓝()
	if 坐标范围怪物数量(3696.09, -3657.83, 138.857,8)>0 then
		使用技能("冰霜新星(等级 1)")
	end
	STSM回血()
	走到(3676.34, -3663.16, 138.522,1)
	t=0
	while 坐标范围怪物数量(3696.396973,-3649.746338,139.1770935,10) < 1 and HP() > 1 do 
		延时(100)
		t=t+1
		if t>70 then
			break
		end
	end
	if MP() > 1200 or 存在BUFF("节能施法") then  --第四场雪
		使用技能("暴风雪")
	else
		使用技能("暴风雪(等级 1)")
	end
	指向坐标(3696.396973,-3649.746338,139.1770935)
	延时(300)
	if 读条中() then
		for i=1,38 do 
			延时(200)
			if not 读条中() then
				break
			end
		end
	end
	if 坐标范围怪物数量(3676.34, -3663.16, 138.522,8)>0 then
		使用技能("冰霜新星(等级 1)")
	end
	STSM回血()
	
	走到(3632.76, -3640.4, 138.307,1)
	STSM回蓝()
	if 战斗中() then
		t=0
		while 坐标范围怪物数量(3663.985596,-3654.861328,139.102951,10) < 1 and HP() > 1 do 
			延时(100)
			t=t+1
			if t>70 then
				break
			end
		end
	else
		return
	end
	if 战斗中() then
		if MP() > 1200 or 存在BUFF("节能施法") then  --第五场雪
			使用技能("暴风雪")
		else
			使用技能("暴风雪(等级 1)")
		end
		指向坐标(3663.985596,-3654.861328,139.102951)
		延时(300)
		if 读条中() then
			for i=1,38 do 
				延时(200)
				if not 读条中() then
					break
				end
			end
		end
	else
		return
	end
	STSM回血()
	走到(3627.67, -3613.8, 138.468,1)
	STSM回蓝()
	if 战斗中() then
		t=0
		while 坐标范围怪物数量(3643.231689,-3635.658691,138.1787567,15) < 1 and HP() > 1 do 
			延时(100)
			t=t+1
			if t>70 then
				break
			end
		end
	else
		return
	end
	if 战斗中() then
		if MP() > 1200 or 存在BUFF("节能施法") then  --第五场雪
			使用技能("暴风雪")
		else
			使用技能("暴风雪(等级 1)")
		end
		指向坐标(3643.231689,-3635.658691,138.1787567)
		延时(300)
		if 读条中() then
			for i=1,38 do 
				延时(200)
				if not 读条中() then
					break
				end
			end
		end
	else
		return
	end
	单杀处理()
end
function 杀怪1(boss)
	if HP()<=1 then
		return
	end
	if boss == nil then
		boss=0
	end
	if boss>0 then
		走到(3710.56, -3596.66, 141.164)
		闪现走到(3699.21, -3627.13, 140.062,1,5)
		路线2()
	else
		if 等级() >= 60 then
			朝向坐标(3653.6, -3583.31, 137.742)
			按键("w",1)
			延时(200)
			闪现走到(3653.6, -3583.31, 137.742,1,5)
			STSM回血()
			if 拉怪下雪() then
			else
				延时(500)
				使用技能("暴风雪")  --第一场
				指向坐标(3652.220703, -3556.166748, 137.9362793)
				x,y,z =当前坐标()
				for i=1,40 do 
					延时(200)
					if not 读条中() then
						break
					end
					if 坐标范围怪物数量(x,y,z,6) >0 then
						break
					end
				end
				x,y,z =当前坐标()
				if 坐标范围怪物数量(x,y,z,8) >0 then
					使用技能("冰霜新星(等级 1)")
				end
			end
		end
		走到(3654.79, -3600.71, 137.083,1)
		延时(100)
		for ii=1,2 do
			if 拉怪下雪() then
			else
				break
			end
			if ii==2 then
				x,y,z =当前坐标()
				if 坐标范围怪物数量(x,y,z,10) >0 then
					朝向坐标(3652.54, -3635.6, 138.457)
					使用技能("冰霜新星(等级 1)")
				end
				break
			end
			朝向坐标(3652.54, -3635.6, 138.457)
			移动("前",2800)
		end
		使用物品("法力红宝石")
		走到(3652.54, -3635.6, 138.457,1)
		STSM回血()
		STSM回蓝()
		if 战斗中() then
			if 单点() then
			else
				if 拉怪下雪() then
				else
					if MP() > 1200 or 存在BUFF("节能施法") then  --第三场
						使用技能("暴风雪")
					else
						使用技能("暴风雪(等级 1)")
					end
					指向坐标(3652.755615, -3602.64209, 137.1260529)
					延时(200)
					for i=1,38 do 
						延时(200)
						if not 读条中() then
							break
						end
					end
					x,y,z = 当前坐标()
					if 坐标范围怪物数量(x,y,z,8) >0 then
						使用技能("冰霜新星(等级 1)")
					end
				end
			end
		end
	end
end
function 杀怪2(线路)
	if HP()<=1 or 分配方式()=="group" or 分配方式()=="roundrobin" then
		return
	end
	if 线路==nil then
		线路=1
	end
	if 线路==1 then
		if 等级() == 60 then
			走到(3653.95, -3573.35, 138.086,1,0,0.3)
			--走到(3653.94, -3569.87, 138.046,1,0,0.3)
			while os.clock()-t1<5.5 and HP()>1 do
				延时(100)
			end
			STSM回蓝()
			for ii=1,2 do
				使用技能("暴风雪") --第一场雪
				if ii==1 then
					指向坐标(3650.5, -3541.76, 137.89)
				else
					指向坐标(3649.91, -3545.76, 137.89)
				end
				延时(300)
				if 读条中() then
					ks=os.clock()
					for i=1,38 do 
						延时(200)
						if not 读条中() then
							if os.clock()-ks<5 then
								拉怪下雪()
							end
							break
						end
					end
					break
				end
			end
		else
			走到(3654.87,-3582.71,137.63,1,0,0.3)
			if 拉怪下雪() then
			else
				使用技能("暴风雪") --第一场雪
				指向坐标(3649.91, -3548.76, 137.89)
				延时(300)
				if 读条中() then
					ks=os.clock()
					for i=1,38 do 
						延时(200)
						if not 读条中() then
							break
						end
					end
				end
			end
		end
	end
	if 战斗中() then
		朝向坐标(3651.91, -3635.26, 138.474)
		按键("w",1)
		延时(200)
		if 等级() == 60 then
			闪现走到(3653.09, -3597.98, 137.237,1)
		else
			使用技能("闪现术")
			移动("前",1000)
		end
	end
	STSM回血()
	if HP()<=1 then
		return
	end
	if 战斗中() then
		if 单点() then
		else
			if 战斗中() then
				if 拉怪下雪() then
				else
					使用技能("暴风雪")  -- 第二场雪
					for i=1,30 do
						if 坐标范围怪物数量(3652.902832, -3569.82251, 138.0829468,8)>0 then
							break
						end
						延时(200)
						if HP()<=1 then
							return
						end
					end
					指向坐标(3652.902832, -3569.82251, 138.0829468)
					延时(300)
					for i=1,38 do 
						延时(200)
						if not 读条中() then
							break
						end
					end
				end
			end
		end
	end
	if 战斗中() then
		使用技能("寒冰护体")
		走到(3653, -3606.97, 137.077)
		STSM回血()
		使用技能("防护冰霜结界")
		移动("前",1600)
		if 单点() then
		else
			if 战斗中() then
				if 拉怪下雪() then
				else
					for i=1,30 do 
						延时(200)
						if 坐标范围怪物数量(3653.701416, -3583.661133, 137.7131042,10)>0 then
							break
						end
						if HP()<=1 then
							return
						end
					end
					if MP() > 1200 or 存在BUFF("节能施法") then  --第三场雪
						使用技能("暴风雪")
					else
						使用技能("暴风雪(等级 1)")
					end
					指向坐标(3653.701416, -3583.661133, 137.7131042)
					延时(300)
					for i=1,38 do 
						延时(200)
						if not 读条中() then
							break
						end
					end
					if 坐标范围怪物数量(3653, -3606.97, 137.077,8)>0 then
						使用技能("冰霜新星(等级 1)")
					end
				end
			end
		end
	end
	if 战斗中() then
		走到(3651.91, -3635.26, 138.474,1)
		STSM回血()
		if 战斗中() then
			使用物品("法力红宝石")
		else
			return
		end
	end
	if 战斗中() then
		if 单点() then
		else
			if 战斗中() then
				if 拉怪下雪() then
				else
					if MP() > 1200 or 存在BUFF("节能施法") then --第四场雪
						使用技能("暴风雪")
					else
						使用技能("暴风雪(等级 1)")
					end
					指向坐标(3652.501465, -3600.465576, 137.2023926)
					延时(300)
					for i=1,38 do 
						延时(200)
						if not 读条中() then
							break
						end
						if HP()<=1 then
							return
						end
					end
				end
			end
		end
	end
end
function 杀怪3()
	if HP()<=1 or 分配方式()=="group" or 分配方式()=="roundrobin" then
		return
	end
	STSM回蓝()
	if 战斗中() then
		走到(3652.27, -3651.76, 139.004,1)
		if 单点() then
		else
			if 战斗中() then
				if 拉怪下雪() then
				else
					单点()
				end
			end
		end
	end
	if 战斗中() then
		闪现走到(3678.7, -3662.96, 138.576,1)
	end
	if 战斗中() then
		for i=1,30 do 
			延时(200)
			if 坐标范围怪物数量(3658.59, -3638.12, 138.361,12)>0 then
				break
			end
			if HP()<=1 then
				return
			end
		end
		STSM回血()
		if 战斗中() then
			if 单点() then
			else
				if 坐标范围怪物数量(3658.59, -3638.12, 138.361,12)>0 then
					local ddzz=0
					if ddzz==0 then
						done=0
						for i=1,10 do
							if MP() > 1200 or 存在BUFF("节能施法") then
								使用技能("暴风雪")
							else
								使用技能("暴风雪(等级 1)")
							end
							指向坐标(3658.59, -3638.12, 138.361)
							for i=1,38 do 
								延时(200)
								if not 读条中() then
									break
								else
									done=1
								end
								if HP()<=1 then
									return
								end
							end
							if done==1 then
								break
							end
							if HP()<=1 then
								return
							end
							延时(150)
						end
					end
				else
					单点()
				end
			end
		end
		STSM回血()
	else
		return
	end
	STSM回蓝()
	if 单点() then
	else
		if 战斗中() then
			if 坐标范围怪物数量(3678.04, -3661.2, 138.602,10) == 0 and 坐标范围怪物数量(3666.93, -3647.59, 138.547,10)>0 then
				if MP() > 1200 or 存在BUFF("节能施法") then
					使用技能("暴风雪")
				else
					使用技能("暴风雪(等级 1)")
				end
				指向坐标(3666.93, -3647.59, 138.547)
				for i=1,40 do 
					延时(200)
					if not 读条中() then
						break
					end
					if 坐标范围怪物数量(3678.7, -3662.96, 138.576,7) > 0 then
						使用技能("冰霜新星(等级 1)")
						break
					end
					if HP()<=1 then
						return
					end
				end
				STSM回血()
			end
		end
	end
	if 战斗中() then
		朝向坐标(3699.72, -3653.86, 138.999)
		走到(3699.72, -3653.86, 138.999,0,0,8)
		if HP() / MaxHP() < 0.8 then
			使用技能("寒冰护体")
		end
		走到(3699.72, -3653.86, 138.999,1)
		延时(200)
		if 战斗中() then
			if MP()<300 then
				使用技能("唤醒")
				延时(3000)
			end
			for i=1,60 do 
				延时(200)
				if not 战斗中() or 坐标范围怪物数量(3679.634277,-3661.159424, 138.6226044,12)>0 then
					break
				end
			end
		else
			return
		end
		if 战斗中() then
			if 单点() then
			else
				if 战斗中() then
					if MP() > 1200 or 存在BUFF("节能施法") then
						使用技能("暴风雪")
					else
						使用技能("暴风雪(等级 1)")
					end
					指向坐标(3679.634277,-3661.159424, 138.6226044)
					for i=1,40 do 
						延时(200)
						if not 读条中() then
							break
						end
					end
				end
			end
		else
			return
		end
		STSM回血()
		走到(3699.09, -3618.74, 140.132,1)
		if 战斗中() and 坐标范围怪物数量(3699.09, -3618.74, 140.132,10)==0 then
			if 战斗中() then
				for i=1,60 do 
					延时(200)
					if not 战斗中() or 坐标范围怪物数量(3697.941162,-3645.772461, 139.4715576,12)>0 then
						break
					end
				end
			else
				return
			end
			if 单点胖子() then
			else
				if 战斗中() and 坐标范围怪物数量(3699.09, -3618.74, 140.132,10)==0 then
					if MP() > 1200 or 存在BUFF("节能施法") then
						使用技能("暴风雪")
					else
						使用技能("暴风雪(等级 1)")
					end
					按键("tab")
					指向坐标(3697.941162,-3645.772461, 139.4715576)
					for i=1,40 do 
						延时(200)
						if not 读条中() then
							break
						end
						if HP()<=1 then
							return
						end
					end
					if 坐标范围怪物数量(3699.09, -3618.74, 140.132,9)>0 then
						使用技能("冰霜新星(等级 1)")
					end
				end
			end
		end
		单杀处理()
	else
		return
	end
end
function 杀怪4()
	if HP()<=1 or 分配方式()=="group" or 分配方式()=="roundrobin" then
		return
	end
	走到(3602.28, -3489.53, 135.907,1,0,0.3)
	while os.clock()-t1<5.5 and HP()>1 do
		延时(100)
	end
	STSM回蓝()
	for ii=1,2 do
		使用技能("暴风雪") --第一场雪
		if ii==1 then
			指向坐标(3576.461182,-3465.87085,135.6259003)
		else
			指向坐标(3578.461182,-3465.87085,135.6259003)
		end
		延时(300)
		if 读条中() then
			ks=os.clock()
			for i=1,38 do 
				延时(200)
				if not 读条中() then
					if os.clock()-ks<5 then
						拉怪下雪()
					end
					break
				end
			end
			break
		end
	end
	闪现走到(3615.08, -3505.27, 137.247,1,4)
	处理眼睛()
	拉怪下雪(2)
	使用技能("寒冰护体")
	走到(3621.57, -3513.83, 137.082,1)
	STSM回血()
	处理眼睛()
	拉怪下雪(2)
	if 战斗中() then
		使用技能("寒冰护体")
		使用物品("法力红宝石")
		走到(3631.38, -3524.74, 136.828,1)
		处理眼睛()
	end
	if 战斗中() then
		STSM回蓝()
		拉怪下雪(2)
	end
	if 战斗中() then
		走到(3642.92, -3537.14, 138.07,1)
		处理眼睛()
		拉怪下雪(2)
	end
	if 战斗中() then
		闪现走到(3654.41, -3577.84, 137.931,1)	
	end
	if 战斗中() then
		for i=1,60 do 
			延时(300)
			if 坐标范围怪物数量(3644.953857,-3546.796875,138.089325,12)>0 or 战斗中() == false then
				break
			end
		end
	end
	if 战斗中() then
		if MP() > 1200 or 存在BUFF("节能施法") then 
			使用技能("暴风雪")
		else
			使用技能("暴风雪(等级 1)")
		end
		指向坐标(3644.953857,-3546.796875,138.089325)
		延时(300)
		for i=1,38 do 
			延时(200)
			if not 读条中() then
				break
			end
		end
	end
	单点()
	杀怪2(2)
	杀怪3()
end
function 杀怪4_1()
	if HP() <= 1 then
		return
	end
	按键("w",1)
	延时(500)
	闪现走到(3600.12, -3490.38, 135.869,1)
	处理眼睛()
	拉怪下雪(2)
	使用技能("寒冰护体")
	走到(3621.57, -3513.83, 137.082,1)
	处理眼睛()
	STSM回血()
	拉怪下雪(2)
	使用技能("寒冰护体")
	使用物品("法力红宝石")
	走到(3631.38, -3524.74, 136.828,1)
	处理眼睛()
	拉怪下雪(2)
	if 战斗中() then
		使用技能("寒冰护体")
		走到(3642.92, -3537.14, 138.07,1)
	处理眼睛()
		STSM回蓝()
	end
	if 战斗中() then
		拉怪下雪(2)
	end
	if 战斗中() then
		闪现走到(3654.41, -3577.84, 137.931,1)
	end
	if 战斗中() then
		for i=1,60 do 
			延时(300)
			if 坐标范围怪物数量(3644.953857,-3546.796875,138.089325,12)>0 then
				break
			end
		end
	end
	if 战斗中() then
		if MP() > 1200 or 存在BUFF("节能施法") then  --第三场雪
			使用技能("暴风雪")
		else
			使用技能("暴风雪(等级 1)")
		end
		指向坐标(3644.953857,-3546.796875,138.089325)
		延时(300)
		for i=1,38 do 
			延时(200)
			if not 读条中() then
				break
			end
		end
	end
	杀怪2(2)
	杀怪3()
end
function 处理眼睛(wait)
	if HP()<=1 then
		return false
	end
	if wait==nil then
		wait=0
	end
	x,y,z = 当前坐标()
	if 范围选怪(x,y,z,23,"纳克萨玛斯之眼")~=0 then
		寻路结束()
		延时(300)
		for fi=1,2 do
			x,y,z=目标坐标()
			if x~=0 then
				for ffi=1,3 do
					x,y,z=目标坐标()
					朝向坐标(x,y,z)
					走到(x,y,z,1,0,19)
					按键("w")
					延时(100)
					if zy == "法师" then
						while 技能可用("火焰冲击") == false do 
							延时(100)
						end
						使用技能("火焰冲击")
						延时(500)
						if not 有目标() or 技能可用("火焰冲击")==false then
							break
						end
					elseif zy == "圣骑士" then
						while 技能可用("驱邪术") == false do 
							延时(100)
						end
						使用技能("驱邪术")
						延时(500)
						if not 有目标() or 技能可用("驱邪术")==false then
							break
						end
					end
				end
				break
			end
		end
		if wait==1 then
			延时(1300)
		end
		return true
	end
	return false
end
function 拉怪2(boss)
	if HP()<=1 or 分配方式()=="group" or 分配方式()=="roundrobin" then
		return
	end
	if boss == nil then
		boss=0
	end
	走到(3652.68, -3545.39, 137.875,1)
	while 技能可用("寒冰屏障") == false do 
		提示("等待冰箱CD...")
		延时(500)
		if 技能可用("急速冷却") then
			使用技能("急速冷却")
		end
		延时(500)
	end
	local yanjing=0
	if 坐标范围怪物数量(3618.430176,-3503.268799,136.9620819,55,"缝补憎恶",1) > 0 and HP()>1 then
		pangzi=1
		while 坐标范围怪物数量(3655.643066,-3499.330566,136.4905243,8,"缝补憎恶",1)==0 and HP()>1 do 
			延时(300)
		end
	end
	使用技能("寒冰护体")
	延时(1400)
	使用技能("法力护盾")
	走到(3644.42, -3522.75, 136.859,1)
	if 坐标范围怪物数量(3604.25708,-3488.064941,135.8951263,30,"斯库尔",1) > 0 then
		boss=1
	else
		boss=0
	end
	if 坐标范围怪物数量(3644.42, -3522.75, 136.859,8) > 0 then
		使用技能("冰霜新星(等级 1)")
	end
	if yanjing==0 then
		if 处理眼睛() then
			yanjing=1
		end
	end
	走到(3637.65, -3516.5, 136.457,1)
	if 坐标范围怪物数量(3637.65, -3516.5, 136.457,8) > 0 then
		使用技能("冰霜新星(等级 1)")
	end
	if yanjing==0 then
		if 处理眼睛() then
			yanjing=1
		end
	end
	if 坐标范围怪物数量(3604.25708,-3488.064941,135.8951263,30,"斯库尔",1) == 0 then
		走到(3631.25, -3511.9, 136.456,1)
		if 坐标范围怪物数量(3631.25, -3511.9, 136.456,8) > 0 then
			使用技能("冰霜新星(等级 1)")
		end
		if yanjing==0 then
			if 处理眼睛() then
				延时(1500)
				yanjing=1
			end
		end
		走到(3622.61, -3507.68, 136.852,1)
		使用技能("暴风雪(等级 1)")
		指向坐标(3599.822266,-3482.464844,135.2822571)
	end
	范围选怪(3605.81,-3515,137.989,3,"恶疫食尸鬼")
	延时(1500)
	for i=1,3 do
		朝向坐标(3605.81,-3515,137.989)
		使用技能("寒冰箭(等级 1)")
		延时(200)
		if 读条中() then
			break
		end
	end
	while 读条中() do 
		延时(100)
	end
	延时(100)
	朝向坐标(3641.71, -3509.08, 137.766)
	按键("w",1)
	延时(100)
	使用技能("闪现术")
	走到(3652.16, -3506.96, 136.51,1)
	范围选怪(3686.18,-3496.08,134.76,5)
	for i=1,3 do
		朝向坐标(3686.18,-3496.08,134.76)
		使用技能("寒冰箭(等级 1)")
		延时(200)
		if 读条中() then
			break
		end
	end
	范围选怪(3644.4,-3477.18,138.352,4,"恶疫食尸鬼")
	while 读条中() do 
		延时(100)
	end
	延时(100)
	使用技能("法术反制")
	走到(3651, -3539.42, 137.868,1)
	if HP()<=1 then
		return
	end
	朝向坐标(3653.6, -3583.31, 137.742)
	for i=1,50 do 
		if 坐标范围怪物数量(3651, -3539.42, 137.868,10)>0 then
			break
		end
		延时(100)
	end
	if HP() > 1 then
		使用技能("寒冰屏障")
		bxtime=os.clock()
		延时(9500)
		取消BUFF("寒冰屏障")
		使用技能("急速冷却")
	end
end
function 等待拉怪(boss,times)
	if HP()<=1 then
		return
	end
	if boss == nil then
		boss=0
	end
	name=""
	使用物品("魔法山泉水")
	使用物品("魔法晶水")
	if boss>0 then
		name = 取单位名称("party1")
	else
		if times==1 or times==3 or times==5 then
			name = 取单位名称("party1")
		else
			if 拉怪队员=="" then
				name = 坐标范围内玩家(3652.68, -3545.39, 137.875,3)
				while name=="" and HP()>1 and 拉怪队员=="" do 
					延时(100)
					name = 坐标范围内玩家(3652.68, -3545.39, 137.875,3)
					if name~="" then
						break
					end
					延时(100)
					name = 坐标范围内玩家(3657.22, -3496.96, 136.573,15)
					if name~="" then
						break
					end
					延时(100)
					name = 坐标范围内玩家(3557.01, -3436.03, 136.242,20)
					if name~="" then
						break
					end
					if 分配方式()=="group" or 分配方式()=="roundrobin" then
						return
					end
				end
				if name~="" then
					拉怪队员=name
				end
			else
				name=拉怪队员
			end
		end
	end
	提示("拉怪的是："..name)
	if name ~= "" then
		while 目标存在BUFF(name,"寒冰屏障") == false and HP()>1 do 
			延时(100)
			if 分配方式()=="group" or 分配方式()=="roundrobin" then
				return
			end
			处理眼睛()
		end
		if HP() == 0 then
			return
		end
		t1=os.clock()
		使用技能("寒冰护体")
		延时(1500)
		使用技能("防护冰霜结界")
		if not 在坐标范围(3638.88, -3588.69, 138.133,2) then
			延时(1400)
		end
		while os.clock()-t1<2.5  and HP()>1 do
			延时(100)
		end
		if times<3 then
			杀怪2()
			杀怪3()
		else
			杀怪4()
		end
	end
end
function 补状态()
	if HP() == 0 then
		return
	end
	清除目标()
	延时(500)
	if 背包物品数量("魔法山泉水") + 背包物品数量("魔法晶水") < 5 then
		使用技能("造水术")
		延时(3500)
	end
	回满()
	if 存在技能("制造魔法玉石") then
		if 背包物品数量("法力刚玉") > 0 then
			销毁物品("法力刚玉",1)
		end
		使用技能("制造魔法玉石")
		延时(3300)
	end
	使用技能("冰甲术")
	延时(1500)
	使用技能("奥术智慧")
	延时(1500)
	使用技能("魔法抑制")
	延时(1500)
	回满()
end
function 进门()
	if HP()<=1 then
		return
	end
	if 在坐标范围(3599.31, -3653.66, 138.511,30) then
		走到(3597.03, -3654.61, 138.509)
		走到(3612.21, -3648.1, 138.511,1)
		走到(3621.23, -3643.85, 138.51,1)
		打开身边目标("仆从入口大门")
		延时(200)
		while 读条中() do 
			延时(500)
		end
		走到(3626.58, -3636.93, 138.673,1)
		走到(3624.69, -3622.69, 138.708)
		走到(3659.67, -3587, 137.061)
		走到(3653.49, -3544.2, 137.861,1)
	end
end
function 第一波()
	if HP()<=1 then
		return
	end
	x,y,z = 当前坐标()
	if 在坐标范围(3653.49, -3544.2, 137.861,20) then
		补状态()
		while true do 
			拉怪1()
			if HP() == 0 then
				STSM复活()
				走到(3612.21, -3648.1, 138.511,1)
				补状态()
			else
				break
			end
		end
		杀怪1()
		杀怪3()
	end
end
function 拾取()
	if HP()<=1  or 分配方式()=="group" or 分配方式()=="roundrobin" then
		return
	end
	if 存在DEBUFF("死尸虫") or 存在DEBUFF("食尸鬼瘟疫") then
		使用技能("寒冰屏障")
		bxtime=os.clock()
		延时(500)
		if 存在DEBUFF("死尸虫") or 存在DEBUFF("食尸鬼瘟疫") then
			使用技能("急速冷却")
			延时(1000)
			使用技能("寒冰屏障")
			bxtime=os.clock()
			延时(500)
		end
		取消BUFF("寒冰屏障")
	end
	if 在坐标范围(3652.54, -3635.6, 138.457,4) then
		走到(3653.88, -3629.87, 137.97,1)
	end
	if 在坐标范围(3652.27, -3651.76, 139.004,4) then
		走到(3652.2, -3628.96, 137.937,1)
	end
	STSM扫地()
	清除目标()
	走到(3653.95, -3573.35, 138.086,1)
end
function 第二波()
	if HP()<=1 or 分配方式()=="group" or 分配方式()=="roundrobin" then
		return
	end
	local la=0
	if 拉怪队员 == "" then
		--[[if 是否队长() == false and 等级() == 60 and 技能可用("寒冰屏障") then
			name = 坐标范围内玩家(3655.13, -3569.13, 137.99,3)
			if name~="" then
				拉怪队员=name
			end
			name2 = 坐标范围内玩家(3657.22, -3496.96, 136.573,40)
			if name2~="" then
				拉怪队员=name
			end
			name3=坐标范围内玩家(3652.68, -3545.39, 137.875,20)
			if name3~="" then
				拉怪队员=name
			end
			if name=="" and name2=="" and name3=="" then
				走到(3655.13, -3569.13, 137.99,1)
				使用技能("寒冰护体")
				延时(10000)
				使用技能("法力护盾")
				回满()
				la=1
				拉怪队员 = 取单位名称("player")
			end
			
		end--]]
	elseif 拉怪队员 == 取单位名称("player") then
		la=1
	end
	if HP()<=1 then
		return
	end
	if la==1 then
		拉怪2()
		杀怪1()
		杀怪3()
	else
		等待拉怪(0,2)
	end
end
function 拉怪3(boss)
	if HP()<=1 then
		return
	end
	local pangzi=0
	if boss == nil then
		boss=0
	end
	while 技能可用("寒冰屏障") == false and HP()>0 do 
		延时(1000)
		提示("等待冰箱CD。。。")
	end
	local yanjing=0
	走到(3572.51, -3453.05, 135.937,1)
	if yanjing==0 then
		if 处理眼睛(1) then
			yanjing=1
		end
	end
	开门()
	延时(2500)
	while 读条中() do 
		延时(100)
	end
	延时(100)
	走到(3557.01, -3436.03, 136.242,1)
	while 坐标范围怪物数量(3557.01, -3436.03, 136.242,30,"食尸鬼|缝补",1) ==0 do 
		延时(500)
	end
	使用技能("寒冰护体")
	延时(1500)
	使用技能("防护冰霜结界")
	延时(500)
	开门()
	开门()
	延时(2500)
	while 读条中() do 
		延时(100)
	end
	使用技能("法力护盾")
	走到(3550.26, -3424.54, 135.859)
	朝向坐标(3549.12, -3388.86, 133.331)
	使用技能("冰霜新星(等级 1)")
	范围选怪(3549.12, -3388.86, 133.331,8)
	延时(300)
	while 技能可用("法术反制") and HP()>0 do 
		使用技能("法术反制")
		延时(200)
	end
	闪现走到(3553.84, -3434.41, 135.973)
	朝向坐标(3569.55, -3451.31, 136.317)
	开门()
	开门()
	延时(200)
	x,y,z = 当前坐标()
	if x>3553.84 then
	else
		开门()
		延时(200)
	end
	走到(3569.55, -3451.31, 136.317)
	开门()
	延时(100)
	开门()
	走到(3572.91, -3459.2, 135.887)
	走到(3570.75, -3461.07, 136.346,1)
	朝向坐标(3576.9, -3465.25, 135.569)
	for i=1,50 do 
		if 坐标范围怪物数量(3571.17, -3460.92, 136.324,10)>0 or HP()==0 then
			break
		end
		延时(100)
	end
	--[[x,y,z = 当前坐标()
	if 坐标范围怪物数量(x,y,z,7)>0 then
		跳()
		延时(100)
		朝向坐标(3553.84, -3434.41, 135.973)
		延时(100)
		使用技能("冰锥术(等级 1)")
	end
	走到(3568.92, -3451.89, 136.397)
	延时(100)
	打开身边目标()
	打开身边目标()
	走到(3604.01, -3493.85, 136.337)
	走到(3613.81, -3503.3, 137.178)
	bz=0
	x,y,z = 当前坐标()
	if 坐标范围怪物数量(x,y,z,7)>0 then
		跳()
		延时(100)
		朝向坐标(3553.84, -3434.41, 135.973)
		延时(100)
		使用技能("冰锥术(等级 1)")
		朝向坐标(3651, -3539.42, 137.868)
		延时(1500)
		bz=1
	end
	使用技能("寒冰护体")
	走到(3628.93, -3521.43, 136.755)
	if bz==0 then
		x,y,z = 当前坐标()
		if 坐标范围怪物数量(x,y,z,7)>0 then
			跳()
			延时(100)
			朝向坐标(3553.84, -3434.41, 135.973)
			延时(100)
			使用技能("冰锥术(等级 1)")
			朝向坐标(3651, -3539.42, 137.868)
			延时(1500)
		end
	end
	使用技能("法力护盾")
	------------------------------------------------------
	走到(3651, -3539.42, 137.868,1)
	朝向坐标(3653.6, -3583.31, 137.742)
	for i=1,50 do 
		if 坐标范围怪物数量(3651, -3539.42, 137.868,10)>0 or HP()==0 then
			break
		end
		延时(100)
	end--]]
	if HP() > 1 then
		使用技能("寒冰屏障")
		bxtime=os.clock()
		延时(9000)
		取消BUFF("寒冰屏障")
	end
end
function 拉怪4(boss)
	if HP()<=1 then
		return
	end
	local pangzi=0
	if boss == nil then
		boss=0
	end
	while 技能可用("寒冰屏障") == false and HP()>0 do 
		延时(1000)
		提示("等待冰箱CD。。。")
	end
	local yanjing=0
	if 坐标范围怪物数量(3618.430176,-3503.268799,136.9620819,55,"缝补憎恶",1) > 0 and HP()>1 then
		pangzi=1
		return
		--[[while 坐标范围怪物数量(3658.013672,-3507.596191,136.6672211,8,"缝补憎恶",1)==0 and HP()>1 do 
			延时(300)
		end--]]
	end
	走到(3572.51, -3453.05, 135.937,1)
	if yanjing==0 then
		if 处理眼睛() then
			yanjing=1
		end
	end
	开门()
	延时(1500)
	while 读条中() do 
		延时(100)
	end
	延时(100)
	走到(3557.01, -3436.03, 136.242,1)
	while (坐标范围怪物数量(3533.66, -3389.11, 132.377,50,"缝补",1)>0 or 坐标范围怪物数量(3533.66, -3389.11, 132.377,38,"缝补|食尸鬼",1)>0) and HP()>1 do 
		延时(500)
	end
	使用技能("寒冰护体")
	延时(1500)
	使用技能("防护冰霜结界")
	延时(1400)
	开门()
	延时(100)
	使用技能("法力护盾")
	走到(3550.26, -3424.54, 135.859)
	走到(3541.63, -3400.42, 132.793,1)
	处理眼睛()
	走到(3552.34, -3387.33, 133.631,1)
	处理眼睛()
	走到(3556.28, -3362.56, 131.978,1)
	使用技能("暴风雪(等级 1)")
	延时(100)
	指向坐标(3560.391113,-3328.167725,129.4989014)
	延时(1500)
	范围选怪(3507.135254, -3379.592529, 134.331,8)
	走到(3535.24, -3382.67, 132.376)
	while 技能可用("法术反制") and HP()>0 do 
		使用技能("法术反制")
		延时(200)
	end
	朝向坐标(3553.84, -3434.41, 135.973)
	x,y,z = 当前坐标()
	if 坐标范围怪物数量(x,y,z,10,"尸|骷髅|缝合")>0 then
		使用技能("冰霜新星(等级 1)")
		延时(1400)
	end
	闪现走到(3553.84, -3434.41, 135.973)
	朝向坐标(3569.55, -3451.31, 136.317)
	开门()
	延时(100)
	开门()
	延时(200)
	x,y,z = 当前坐标()
	if x>3553.84 then
	else
	开门()
		延时(200)
	end
	走到(3569.55, -3451.31, 136.317)
	开门()
	延时(100)
	开门()
	走到(3572.91, -3459.2, 135.887)
	走到(3570.75, -3461.07, 136.346,1)
	朝向坐标(3576.9, -3465.25, 135.569)
	for i=1,50 do 
		if 坐标范围怪物数量(3571.17, -3460.92, 136.324,10)>0 or HP()==0 then
			break
		end
		延时(100)
	end
	--[[走到(3604.01, -3493.85, 136.337)
	bz=0
	x,y,z = 当前坐标()
	if 坐标范围怪物数量(x,y,z,8)>0 then
		跳()
		延时(100)
		朝向坐标(3553.84, -3434.41, 135.973)
		延时(100)
		使用技能("冰锥术(等级 1)")
		朝向坐标(3651, -3539.42, 137.868)
		延时(1500)
		bz=1
	end
	走到(3613.81, -3503.3, 137.178)
	x,y,z = 当前坐标()
	if 坐标范围怪物数量(x,y,z,8)>0 then
		跳()
		延时(100)
		朝向坐标(3553.84, -3434.41, 135.973)
		延时(100)
		使用技能("冰锥术(等级 1)")
		朝向坐标(3651, -3539.42, 137.868)
		延时(1500)
		bz=1
	end
	使用技能("寒冰护体")
	走到(3628.93, -3521.43, 136.755)
	if bz==0 then
		x,y,z = 当前坐标()
		if 坐标范围怪物数量(x,y,z,8)>0 then
			跳()
			延时(100)
			朝向坐标(3553.84, -3434.41, 135.973)
			延时(100)
			使用技能("冰锥术(等级 1)")
			朝向坐标(3651, -3539.42, 137.868)
			延时(1500)
		end
	end
	使用技能("法力护盾")
	------------------------------------------------------
	走到(3651, -3539.42, 137.868,1)
	朝向坐标(3653.6, -3583.31, 137.742)
	for i=1,50 do 
		if 坐标范围怪物数量(3651, -3539.42, 137.868,10)>0 or HP()==0 then
			break
		end
		延时(100)
	end--]]
	if HP() > 1 then
		使用技能("寒冰屏障")
		bxtime=os.clock()
		延时(9000)
		取消BUFF("寒冰屏障")
	end
end
function 拉怪5(boss)
	if HP()<=1 then
		return
	end
	local pangzi=0
	if boss == nil then
		boss=0
	end
	while 技能可用("寒冰屏障") == false and HP()>0 do 
		延时(500)
		提示("等待冰箱CD。。。")
		if 技能可用("急速冷却") then
			使用技能("急速冷却")
			延时(500)
		end
	end
	local yanjing=0
	if 坐标范围怪物数量(3618.430176,-3503.268799,136.9620819,55,"缝补憎恶",1) > 0 and HP()>1 then
		pangzi=1
		return
		--[[while 坐标范围怪物数量(3658.013672,-3507.596191,136.6672211,8,"缝补憎恶",1)==0 and HP()>1 do 
			延时(300)
		end--]]
	end
	走到(3572.51, -3453.05, 135.937,1)
	if yanjing==0 then
		if 处理眼睛(1) then
			yanjing=1
		end
	end
	开门()
	延时(100)
	while 读条中() do 
		延时(100)
	end
	延时(100)
	走到(3557.01, -3436.03, 136.242,1)
	while 坐标范围怪物数量(3533.66, -3389.11, 132.377,40,"缝补|食尸鬼",1)>0 and HP()>1 do 
		延时(500)
	end
	使用技能("寒冰护体")
	延时(1500)
	使用技能("防护冰霜结界")
	延时(1500)
	开门()
	延时(100)
	while 读条中() do 
		延时(100)
	end
	使用技能("法力护盾")
	走到(3550.26, -3424.54, 135.859)
	走到(3541.63, -3400.42, 132.793,1)
	处理眼睛()
	走到(3537.84, -3380.96, 132.377,1)
	处理眼睛()
	走到(3538.72, -3370.38, 132.377,1)
	处理眼睛()
	走到(3539.43, -3358.54, 131.267,1)
	处理眼睛()
	while 坐标范围怪物数量(3543.41, -3328.19, 129.352,30,"缝补|食尸鬼",1)>0 and HP()>1 do 
		延时(500)
	end
	走到(3543.41, -3328.19, 129.352)
	走到(3537.83, -3303.36, 130.962)
	---------------------------------
	走到(3527.94, -3300.72, 131.871,1)
	范围选怪(3494.283936,-3295.886963,130.9246674,6)
	使用技能("寒冰箭(等级 1)")
	使用技能("寒冰箭(等级 1)")
	延时(200)
	if 读条中() then
	else
		使用技能("暴风雪(等级 1)")
		指向坐标(3494.283936,-3295.886963,130.9246674)
		延时(1500)
	end
	闪现走到(3542.82, -3351.17, 130.11,1)
	处理眼睛()
	延时(500)
	范围选怪(3556.8,-3325.3,129,10)
	朝向坐标(3556.8,-3325.3,129)
	使用技能("寒冰箭(等级 1)")
	使用技能("寒冰箭(等级 1)")
	延时(200)
	while 读条中() do
		延时(100)
	end
	走到(3552.06, -3378.09, 132.99)
	处理眼睛()
	走到(3550.01, -3397.13, 133.09)
	处理眼睛()
	闪现走到(3551.34, -3429.69, 135.804)
	走到(3553.84, -3434.41, 135.973)
	朝向坐标(3568.92, -3451.89, 136.397)
	延时(100)
	开门()
	开门()
	延时(100)
	x,y,z = 当前坐标()
	if x>3553.84 then
		延时(200)
	else
	开门()
		延时(200)
	end
	走到(3569.55, -3451.31, 136.317)
	开门()
	延时(100)
	开门()
	走到(3572.91, -3459.2, 135.887)
	走到(3570.75, -3461.07, 136.346,1)
	朝向坐标(3576.9, -3465.25, 135.569)
	for i=1,50 do 
		if 坐标范围怪物数量(3571.17, -3460.92, 136.324,10)>0 or HP()==0 then
			break
		end
		延时(100)
	end
	if HP() > 1 then
		使用技能("寒冰屏障")
		bxtime=os.clock()
		延时(9000)
		取消BUFF("寒冰屏障")
	end
end
function 第三波()
	if 是否队长() then
		while true do
			拉怪3()
			if HP() == 0 then
				STSM复活()
				进门()
				路径走到("STSM2",3572.51, -3453.05, 135.937)
				补状态()
				回满()
			else
				break
			end
		end
		杀怪4_1()
	else
		等待拉怪(0,3)
	end
end
function 第四波()
	if HP()<=1 or 分配方式()=="group" or 分配方式()=="roundrobin" then
		return
	end
	local la=0
	if 拉怪队员 == "" then
		if 是否队长() == false and 等级() == 60 and 技能可用("寒冰屏障") then
			name = 坐标范围内玩家(3655.13, -3569.13, 137.99,3)
			if name~="" then
				拉怪队员=name
			end
			name2 = 坐标范围内玩家(3657.22, -3496.96, 136.573,40)
			if name2~="" then
				拉怪队员=name
			end
			name3=坐标范围内玩家(3652.68, -3545.39, 137.875,20)
			if name3~="" then
				拉怪队员=name
			end
			if name=="" and name2=="" and name3=="" then
				走到(3655.13, -3569.13, 137.99,1)
				使用技能("寒冰护体")
				延时(10000)
				使用技能("法力护盾")
				回满()
				la=1
				拉怪队员 = 取单位名称("player")
			end
		end
	elseif 拉怪队员 == 取单位名称("player") then
		la=1
	end
	if HP()<=1 then
		return
	end
	if la==1 then
		while true do
			拉怪4()
			if HP() == 0 then
				STSM复活()
				进门()
				补状态()
				路径走到("STSM2",3572.51, -3453.05, 135.937)
			else
				break
			end
		end
		杀怪4_1()
	else
		等待拉怪(0,4)
	end
end
function 第五波()
	if 是否队长() then
		拉怪5()
		杀怪4_1()
	else
		等待拉怪(0,5)
	end
end
function STSM复活()
	local fb=0
	if HP()<=1 then
		teamNum = 队伍人数()
		if HP()==0 then
			if not 在副本() then
				x,y,z  = 当前坐标()
				fb=1
			end
			释放灵魂()
			路径走到("STSM复活",3222.14, -4036.85, 108.384)
			if fb==1 then
				复活()
				走到(3233.59, -4048.46, 108.444,1)
			end
			if 是否队长() then
				队伍拾取()
				if 需要重置 == 1 then
					重置副本()
					需要重置 = 0
				end
			elseif teamNum<1 then
				if 需要重置 == 1 then
					重置副本()
					需要重置 = 0
				end
			end
			走到(3233.59, -4048.46, 108.444,1)
			走到(3234.77, -4051.73, 108.454,1)
			if teamNum<1 or teamNum > 1 and 分配方式()~="group" then
				移动("前",4111)
			end
		end
		if HP() == 1 then
			路径走到("STSM复活",3233.96, -4050.24, 108.449)
			复活()
			走到(3233.59, -4048.46, 108.444,1)
			走到(3234.77, -4051.73, 108.454,1)
			if teamNum<1 or teamNum > 1 and 分配方式()~="group" then
				if 是否队长() then
					队伍拾取()
					if 需要重置 == 1 then
						重置副本()
						需要重置 = 0
					end
				elseif teamNum<1 then
					if 需要重置 == 1 then
						重置副本()
						需要重置 = 0
					end
				end
				走到(3233.59, -4048.46, 108.444,1)
				走到(3234.77, -4051.73, 108.454,1)
				移动("前",4111)
			end
		end
		延时(1000)
		while 过图中() do 
			延时(100)
		end
		延时(1000)
		return true
	end
	return false
end
function STSM进副本(cz)
	if 在副本() then
		return
	end
	if cz==nil then
		cz=0
	end
	if 在坐标范围(3227, -4036, 108.423,40) then
		x,y,z = 当前坐标()
		if x<3222 then
			走到(3227, -4036, 108.423)
		end
		走到(3233.59, -4048.46, 108.444,1)
		延时(1000)
		if 等级()==70 or 是否队长() then
			if 需要重置==1 then
				--[[num=队伍人数()
				if num > 1 then
					while 坐标范围队员数量(3227, -4036, 108.423,40) < num-1 do
						if HP() <= 1 then
							STSM复活()
							复活()
						end
						延时(1000)
					end
				end--]]
				重置副本()
				需要重置=0
				cztime=os.clock()
				if HP() <= 1 then
					STSM复活()
					复活()
				end
				if 是否队长() and HP()>1 then
					运行宏("/p 进本")
					延时(2000)
				end
				需要重置=0
				if 已重置次数 ~= nil then
					已重置次数=已重置次数+1
					置重置次数(已重置次数)
				end
			end
		end
		走到(3234.77, -4051.73, 108.454,1)
		if 等级()==70 or 是否队长() then
			自由拾取()
		else
			延时(1000)
			while 分配方式() ~= "freeforall" and 分配方式()~="master" do 
				if HP() <= 1 then
					STSM复活()
					复活()
				end
				if 是否队长() then
					return
				end
				延时(1000)
			end
		end
		移动("前",2500)
		延时(1000)
		while 过图中() do 
			延时(1000)
		end
		延时(1000)
		if 在副本() then
			return
		else
			while not 在副本() do
				val = 检查挂机方案()
				if val == 11 or val == 22 then
					return
				end
				走到(3233.59, -4048.46, 108.444,1)
				延时(15000)
				走到(3234.77, -4051.73, 108.454)
				移动("前",4000)
				while 过图中() do 
					延时(1000)
				end
				延时(1000)
			end
		end
	end
end
function 胖子1()
	local fx=0
	走到(3645.27, -3544.76, 138.058,1)
	if 坐标范围怪物数量(3618.430176,-3503.268799,136.9620819,55,"缝补憎恶",1) > 0 and HP()>1 then
		朝向坐标(3643.85, -3520.3, 136.694)
		while 范围选怪(3643.85, -3520.3, 136.694,20,"缝补憎恶") == 0 do 
			延时(100)
		end
		延时(500)
	end
	local c=0
	while 有目标() and HP()>1 do 
		if c==0 or not 是否队长() then
			for i=1,2 do
				x,y,z = 目标坐标()
				朝向坐标(x,y,z)
				使用技能("寒冰箭")
				延时(500)
				while 读条中() do 
					延时(100)
					x,y,z = 目标坐标()
					朝向坐标(x,y,z)
				end
			end
			c=1
		end
		延时(100)
		x,y,z = 当前坐标()
		if 坐标范围怪物数量(x,y,z,8,"缝补憎恶") > 0 then
			使用技能("冰霜新星(等级 1)")
		end
		if fx==0 and not 在坐标范围(3700.810059,-3617.663574,140.2680664,20) then
			朝向坐标(3700.81,-3617.66,140.26)
		else
			fx=1
			if fx==1 then 
				if not 在坐标范围(3645.27, -3544.76, 138.058,20) then
					朝向坐标(3645.27, -3544.76, 138.058)
				else
					fx=0
					朝向坐标(3700.810059,-3617.663574,140.2680664)
				end
			end
		end
		移动("前",1500)
		延时(100)
	end
	摸尸体(40)
	走到(3653.95, -3573.35, 138.086,1)
	延时(200)
	while HP()>1 do 
		name = 坐标范围内玩家(3645.27, -3544.76, 138.058,25)
		if name == "" then
			break
		end
		延时(1000)
	end
	回满()
end
function 斯库尔()
	if 是否队长() then
		local yanjing=0
		走到(3648.26, -3540.29, 137.915,1)
		if 坐标范围怪物数量(3618.430176,-3503.268799,136.9620819,55,"缝补憎恶",1) > 0 and HP()>1 then
			while 坐标范围怪物数量(3658.013672,-3507.596191,136.6672211,8,"缝补憎恶",1)==0 and HP()>1 do 
				延时(300)
			end
		end
		使用技能("寒冰护体")
		延时(1000)
		走到(3647.66, -3532.25, 137.681)
		走到(3638.57, -3521.27, 136.728,1)
		if yanjing==0 then
			if 处理眼睛() then
				yanjing=1
			end
		end
		走到(3628.39, -3509.9, 136.587,1)
		if yanjing==0 then
			if 处理眼睛() then
				yanjing=1
			end
		end
		走到(3625.35, -3502.8, 136.654,1)
		if yanjing==0 then
			if 处理眼睛(1) then
				yanjing=1
			end
		end
		for i=1,5 do
			if 范围选怪(3603.86,-3486.61,135.896,5,"斯库尔") ~= 0 then
				break
			end
			延时(300)
		end
		朝向坐标(3595.14,-3480.09,134.864)
		移动("前",300)
		for i=1,5 do 
			朝向坐标(3595.14,-3480.09,134.864)
			使用技能("寒冰箭")
			延时(200)
			if 读条中() then
				break
			end
		end
		while 读条中() do 
			延时(100)
		end
		延时(100)
		闪现走到(3642.08, -3526.61, 137.191)
		使用技能("寒冰护体")
		走到(3647.24, -3547.74, 138.016,1)
		朝向坐标(3595.14,-3480.09,134.864)
		延时(3000)
		for i=1,50 do 
			使用技能("寒冰箭")
			延时(200)
			if 读条中() then
				break
			end
			if i>30 then
				移动("前",1000)
			end
		end
		while 读条中() do 
			延时(100)
		end
		延时(200)
		使用技能("寒冰护体")
		走到(3648.04, -3562.31, 138.449)
	else
		while HP()>0 do 
			if 范围选怪(3642.08, -3526.61, 137.191,20,"斯库尔") ~= 0 then
				break
			end
			延时(200)
		end
		走到(3658.24, -3562.72, 137.878,1)
	end
	使用技能("寒冰护体")
	while (战斗中() or 有目标()) and HP() > 0 do
		x,y,z = 目标坐标()
		if x~=0 then
			走到(x,y,z,1,0,35)
			朝向坐标(x,y,z)
		else
			朝向坐标(3647.24, -3547.74, 138.016)
		end
		延时(200)
		使用技能("寒冰箭")
		延时(200)
		while 读条中() do 
			延时(100)
		end
		if MP()/MaxMP() < 0.2 then
			使用物品("法力黄水晶")
		end
		if HP()/MaxHP() < 0.8 then
			使用技能("寒冰护体")
		end
	end
end
function STSM出本()
	if 在副本() then
		if not 在坐标范围(3597.28, -3654.81, 138.509,20) then
			x,y,z = 当前坐标()
			if y>-3537 then
				走到(3646.16, -3537.51, 137.958)
			end
			走到(3659.21, -3597.38, 136.939)
			走到(3626.42, -3641.44, 138.486,1)
			打开身边目标()
			延时(100)
		end
		走到(3597.28, -3654.81, 138.509)
		走到(3592.62, -3646.68, 138.502,1)
		if 是否队长() then
			运行宏("/p 出本")
			延时(2000)
		end
		走到(3589.45, -3640.54, 138.482)
		移动("前",4000)
		while 过图中() do 
			延时(100)
		end
		延时(2000)
	end
end
function 打完修整(波次)
	if 波次 == nil then
		波次=1
	end
	if 存在DEBUFF("死尸虫|食尸鬼瘟疫|鬼魅幻影")  then
		使用技能("寒冰屏障")
		bxtime=os.clock()
		延时(500)
		if 存在DEBUFF("死尸虫|食尸鬼瘟疫|鬼魅幻影") then
			使用技能("急速冷却")
			延时(1000)
			使用技能("寒冰屏障")
			bxtime=os.clock()
			延时(500)
		end
		取消BUFF("寒冰屏障")
	end
	x,y,z = 当前坐标()
	if y<-3580 then
		拾取()
	end
	if 波次>2 then
		拾取2()
		路径走到("STSM2",3602.28, -3489.53, 135.907,1)
	else
		走到(3653.95, -3573.35, 138.086,1)
	end
	if 是否队长() then
		运行宏("/run SetLootMethod('master',UnitName('player'))")
	end
	if HP()>1 then
		while 队伍有死亡() do 
			提示("队伍有死亡，等待其复活")
			延时(5000)
			if HP() == 0 or 分配方式() == "group" then
				break
			end
		end
		if 波次<4 then
			if MP() >1470 then
				使用技能("制造魔法红宝石")
				延时(3500)
			end
			回满()
			if HP() > 1 then
				if 背包物品数量("法力红宝石") < 1 then
					使用技能("制造魔法红宝石")
					延时(3500)
				end
			end
		end
	end
end
function 等待集合()
	local weizhi=1
	if HP() > 1 then
		if 在坐标范围(3653.95, -3573.35, 138.086,55) then
			走到(3653.95, -3573.35, 138.086,1)
			weizhi = 1
		else
			weizhi = 2
			路径走到("STSM2",3602.28, -3489.53, 135.907)
		end
		if 是否队长() then
			if weizhi == 1 then
				t=0
				while 坐标范围队员数量(3653.95, -3573.35, 138.086,7) + 坐标范围队员数量(3602.28, -3489.53, 135.907,5) < 2 do 
					延时(300)
					t=t+1
					if t>320 then
						break
					end
				end
			else
				t=0
				while 坐标范围队员数量(3602.28, -3489.53, 135.907,7) < 2 do 
					延时(300)
					t=t+1
					if t>320 then
						break
					end
					处理眼睛()
				end
			end
			自由拾取()
		else
			if 拉怪队员~="" then
				while 分配方式() =="master" do 
					延时(500)
					处理眼睛()
				end
			end
		end
		回满()
	end
end
function STSM_2()
	while 队伍人数() < 2 do 
		邀请小号()
		同意进组()
	end
	while 在飞机上() do 
		延时(1000)
	end
	if 等级() == 60 then
		STSM设置勿扰()
	end
	while true do
		邀请小号()
		if 等级() < 54 then
			local ci=0
			while true do 
				STSM复活()
				STSM进副本()
				延时(1000)
				ci=ci+1
				if ci > 60 then
					跳()
					ci=0
				end
				if 分配方式()=="group" then
					STSM出本()
				end
			end
		else
			跑本()
			sikuer=0
			STSM复活()
			if 是否队长() then
				邀请小号()
			end
			STSM进副本()
			取消BUFF("银色黎明委任徽章")
			if 在副本() then
				if 坐标范围怪物数量(3642.11, -3638.45, 138.505,25,"",1)>0 then
					第一波()
					打完修整(1)
					if not 是否队长() then
						n=取随机数(100,7000)
						if n % 2 == 1 then
							销毁物品("魔法山泉水|魔法晶水|魔法苏打水")
							使用技能("造水术")
							延时(3500)
						end
					end
				else
					进门()
					if 是否队长() then
						运行宏("/run SetLootMethod('master',UnitName('player'))")
					end
					摸尸体(50)
					补状态()
				end
				等待集合()
				if 坐标范围怪物数量(3605.81,-3515,137.989,3,"恶疫食尸鬼",1)>0 and HP()>0 then
					走到(3653.95, -3573.35, 138.086,1)
					第二波()
					打完修整(2)
					等待集合()
					延时(1000)
					if HP() > 1 then
						if 等级() < 60 then
							走到(3639.56, -3536.29, 138.451,1,0,6)
						else
							走到(3639.56, -3536.29, 138.451,1,0,1)
						end
						使用技能("寒冰护体")
						延时(1000)
						清除目标()
						if 坐标范围怪物数量(3604.25708,-3488.064941,135.8951263,30,"斯库尔",1) > 0 then
							sikuer=1
						else
							sikuer=0
						end
						打开身边目标()
						延时(500)
						if 读条中() then
							while 读条中() do 
								延时(1000)
							end
							延时(1500)
						else
							走到(3648.16, -3540.58, 137.917,1,0,1)
							延时(2000)
							朝向坐标(3639.56, -3536.29, 138.451)
							按键("w")
							延时(100)
							使用技能("冰霜新星(等级 1)")
							延时(1500)
							使用技能("魔爆术")
							延时(1500)
							while 战斗中() or 有目标() or 坐标范围怪物数量(3648.16, -3540.58, 137.917,13)>0 do 
								使用技能("魔爆术")
								延时(1500)
							end
						end
						
					end
				end
				if sikuer==0 and 分配方式()~="group" then
					if 坐标范围怪物数量(3618.430176,-3503.268799,136.9620819,55,"缝补憎恶",1) == 0 and HP()>1 then
						到内杀怪点()
						使用技能("魔法抑制")
						for i=1,10 do 
							处理眼睛()
							延时(500)
						end
						if 是否队长() then
							走到(3572.51, -3453.05, 135.937,1)
							回满()
							if 坐标范围怪物数量(3557.01, -3436.03, 136.242,25,"尸体|骷髅",1) > 0 then
								第三波()
								打完修整(3)
								if HP() == 0 then
									STSM复活()
									进门()
									补状态()
									路径走到("STSM2",3602.28, -3489.53, 135.907)
								end
								等待集合()
							end
							走到(3602.28, -3489.53, 135.907,1)
							第四波()
							打完修整(4)
							--[[if HP() == 0 then
								STSM复活()
								进门()
								补状态()
								路径走到("STSM2",3602.28, -3489.53, 135.907)
							end
							等待集合()
							第五波()
							打完修整(2)--]]
							if HP() == 0 then
								STSM复活()
							end
						else
							if 分配方式() == "freeforall" and HP() > 1 then 
								走到(3572.51, -3453.05, 135.937,1)
								if 坐标范围怪物数量(3557.01, -3436.03, 136.242,25,"尸体|骷髅",1) > 0 then
									走到(3602.28, -3489.53, 135.907,1)
									处理眼睛()
									使用物品("魔法甜面包")
									使用物品("魔法肉桂面包")
									使用物品("魔法苏打水")
									使用物品("魔法晶水")
									使用物品("魔法山泉水")
									第三波()
									打完修整(3)
									if HP() == 0 then
										STSM复活()
										进门()
										补状态()
										路径走到("STSM2",3602.28, -3489.53, 135.907)
									end
									等待集合()
								end
								走到(3602.28, -3489.53, 135.907,1)
								第四波()
								打完修整(4)
								--[[if HP() == 0 then
									STSM复活()
									进门()
									补状态()
									路径走到("STSM2",3602.28, -3489.53, 135.907)
								end
								等待集合()
								第五波()
								打完修整(2)--]]
								--[[if HP() == 0 then
									STSM复活()
								end--]]
							end
						end
					end
				end
				if HP() > 1 then
					if 是否队长() == false then
						while 分配方式() == "freeforall" or 分配方式() == "master" do 
							延时(500)
						end
					end
					if 检查回城() then
					else
						if 是否队长() then
							队伍拾取()
						end
						需要重置=1
						if 在副本() then
							if 是否队长() == false then
								while os.clock()-cztime<840 do 
									提示("等待重置时间")
									延时(1000)
								end
							end
							if 是否队长() then
								队伍拾取()
							end
							STSM出本()
						end
					end
				else
					STSM复活()
					检查回城()
				end
			end
		end
	end
end
function 前门准备()
	if not 在坐标范围(3561.91, -3444.85, 136.796,10) then
		路径走到("STSM2",3572.65, -3452.92, 135.921)
		if 是否队长() then
			开门()
			延时(2500)
			while 读条中() do 
				延时(100)
			end
		else
			while 坐标范围内玩家(3554.96, -3444.81, 137.351,8) == "" do 
				延时(200)
				处理眼睛()
			end
			开门()
		end
		走到(3567.09, -3446.45, 136.726)
		走到(3554.5, -3444.68, 137.372,1)
		if 是否队长() then
			t=0
			while 坐标范围队员数量(3554.5, -3444.68, 137.372,7)  < 2 do 
				延时(300)
				t=t+1
				if t>320 then
					break
				end
			end
			自由拾取()
		else
			if 拉怪队员~="" then
				while 分配方式() =="master" do 
					延时(500)
					处理眼睛()
				end
			end
		end
		回满()
	end
end
function 前门拉怪1()
	if HP() <= 1 or 分配方式() ~= "freeforall" then
		return
	end
	if 在坐标范围(3556.8, -3436.23, 136.217,10) then
		走到(3556.8, -3436.23, 136.217,1)
		朝向坐标(3547.95, -3426.81, 135.674)
		while 坐标范围怪物数量(3557.01, -3436.03, 136.242,30,"缝补憎恶|食尸鬼",1) >0 or 坐标范围怪物数量(3531.15, -3391.8, 132.377,25,"缝补憎恶|食尸鬼",1) >0 do 
			延时(500)
		end
		使用技能("寒冰护体")
		延时(1500)
		使用技能("防护冰霜结界")
		开门()
		延时(500)
		while 读条中() do 
			延时(100)
		end
		走到(3546.2, -3423.52, 135.468,0,0,1)
		使用技能("冰霜新星(等级 1)")
		走到(3545.51, -3415.51, 134.882,0,1,2)
		处理眼睛()
		朝向坐标(3531.15, -3391.8, 132.377)
		延时(500)
		使用技能("急速冷却")
		使用技能("冰霜新星(等级 1)")
		走到(3531.15, -3391.8, 132.377,1,0,4)
		处理眼睛()
		while 技能可用("暴风雪") == false do 
			延时(100)
		end
		使用技能("暴风雪(等级 1)")
		指向坐标(3534.346191,-3359.871338,132.0745544)
		范围选怪(3545.63, -3385.97, 132.854,8,"尸|骷髅")
		延时(1500)
		朝向坐标(3545.63, -3385.97, 132.854)
		使用技能("火焰冲击(等级 1)")
		朝向坐标(3499.88, -3382.46, 135.026)
		按键("w",1)
		--范围选怪(3462.196533,-3386.862549,138.8375854,6,"尸|骷髅")
		延时(1400)
		闪现走到(3499.88, -3382.46, 135.026,1,3)
		延时(300)
		
		--闪现走到(3488.56, -3391.39, 136.637,0,10)
		--[[while 技能可用("法术反制") and HP()>0 do 
			使用技能("法术反制")
			延时(100)
		end
		走到(3499.88, -3382.46, 135.026,1,0,5)--]]
		朝向坐标(3534.98, -3412.32, 134.152)
		if HP() > 0 then
			while 技能可用("寒冰屏障") ==false and HP()>0 do 
				延时(100)
			end
			使用技能("寒冰屏障")
			延时(9500)
			取消BUFF("寒冰屏障")
		end
	end
end
function 前门杀怪主()
	按键("w",1)
	延时(200)
	闪现走到(3534.98, -3412.32, 134.152,1,10)
	使用技能("暴风雪")
	指向坐标(3515.359619,-3395.629639,134.8429565)
	延时(200)
	for i=1,38 do 
		延时(200)
		if not 读条中() then
			break
		end
	end
	走到(3545.74, -3422.9, 135.434,1)
	使用技能("暴风雪(等级 1)")
	指向坐标(3527.69, -3404.58, 133.369)
	延时(200)
	for i=1,22 do 
		延时(200)
		if not 读条中() then
			break
		end
	end
end
function 前门接怪()
	if 在坐标范围(3556.8, -3436.23, 136.217,10) then
		使用技能("寒冰护体")
		延时(1000)
		走到(3556.8, -3436.23, 136.217,1)
		朝向坐标(3547.95, -3426.81, 135.674)
		开门()
		使用技能("防护冰霜结界")
		开门()
		走到(3549.17, -3427.92, 135.714)
	end
	闪现走到(3527.69, -3404.58, 133.369,1)
	if 处理眼睛(1) then
	end
	使用技能("暴风雪")
	指向坐标(3505.533447,-3388.620605,134.634903)
	延时(200)
	for i=1,38 do 
		延时(200)
		if not 读条中() then
			break
		end
	end
	走到(3545.74, -3422.9, 135.434,1)
	使用技能("暴风雪")
	指向坐标(3520.044922,-3398.262207,133.3132629)
	延时(200)
	for i=1,38 do 
		延时(200)
		if not 读条中() then
			break
		end
	end
end
function 前门杀怪2()
	走到(3554.44, -3433.94, 135.929)
	朝向坐标(3570.43, -3450.51, 136.227)
	开门()
	走到(3570.43, -3450.51, 136.227)
	开门()
	走到(3579.75, -3460.52, 135.376)
	闪现走到(3601.83, -3487.68, 135.749,1,0.3)
	while 坐标范围怪物数量(3578.89624,-3460.325928,135.334198,15,"尸|骷髅|缝合")==0 and HP()>0 do 
		处理眼睛()
		延时(100)
	end
	使用技能("暴风雪")
	指向坐标(3578.89624,-3460.325928,135.334198)
	延时(200)
	for i=1,38 do 
		延时(200)
		if not 读条中() then
			break
		end
	end
	走到(3612.99, -3507.29, 137.59,1,1)
	处理眼睛()
	拉怪下雪(2)
	使用技能("寒冰护体")
	走到(3621.57, -3513.83, 137.082,1)
	STSM回血()
	处理眼睛()
	拉怪下雪(2)
	if 战斗中() then
		使用技能("寒冰护体")
		使用物品("法力红宝石")
		走到(3631.38, -3524.74, 136.828,1)
		处理眼睛()
	end
	if 战斗中() then
		STSM回蓝()
		拉怪下雪(2)
	end
	if 战斗中() then
		走到(3642.92, -3537.14, 138.07,1)
		处理眼睛()
		拉怪下雪(2)
	end
	if 战斗中() then
		闪现走到(3654.41, -3577.84, 137.931,1)
	end
	if 战斗中() then
		for i=1,60 do 
			延时(300)
			if 坐标范围怪物数量(3644.953857,-3546.796875,138.089325,12)>0 or 战斗中() == false then
				break
			end
		end
	end
	if 战斗中() then
		if MP() > 1200 or 存在BUFF("节能施法") then 
			使用技能("暴风雪")
		else
			使用技能("暴风雪(等级 1)")
		end
		指向坐标(3644.953857,-3546.796875,138.089325)
		延时(300)
		for i=1,38 do 
			延时(200)
			if not 读条中() then
				break
			end
		end
	end
	单点()
	杀怪2(2)
	杀怪3()
end
function 前门等待拉怪()
	if HP()<=1 or 分配方式() == "group" or 分配方式() == "roundrobin" then
		return
	end
	name=""
	使用物品("魔法苏打水")
	使用物品("魔法晶水")
	使用物品("魔法山泉水")
	name = 取单位名称("party1")
	提示("拉怪的是："..name)
	if name ~= "" then
		while 目标存在BUFF(name,"寒冰屏障") == false and HP()>1 do 
			延时(100)
			if 分配方式()=="group" or 分配方式()=="roundrobin" then
				return
			end
		end
		if HP() == 0 then
			return
		end
		前门接怪()
		前门杀怪2()
	end
end
function 前门第一波()
	if 是否队长() then
		前门拉怪1()
		前门杀怪主()
		前门杀怪2()
	else
		前门等待拉怪()
	end
end
function STSM_3()
	while 队伍人数() < 2 do 
		邀请小号()
		同意进组()
	end
	while 在飞机上() do 
		延时(1000)
	end
	if 等级() == 60 then
		STSM设置勿扰()
	end
	while true do
		邀请小号()
		if 等级() < 54 then
			local ci=0
			while true do 
				STSM复活()
				STSM进副本()
				延时(1000)
				ci=ci+1
				if ci > 60 then
					跳()
					ci=0
				end
				if 分配方式()=="group" then
					STSM出本()
				end
			end
		else
			跑本()
			sikuer=0
			STSM复活()
			if 是否队长() then
				邀请小号()
			end
			STSM进副本()
			取消BUFF("银色黎明委任徽章")
			if 在副本() then
				if 坐标范围怪物数量(3642.11, -3638.45, 138.505,25,"",1)>0 then
					第一波()
					打完修整(1)
					if not 是否队长() then
						n=取随机数(100,7000)
						if n % 2 == 1 then
							销毁物品("魔法山泉水|魔法晶水|魔法苏打水")
							使用技能("造水术")
							延时(3500)
						end
					end
				else
					进门()
					if 是否队长() then
						运行宏("/run SetLootMethod('master',UnitName('player'))")
					end
					摸尸体(50)
					补状态()
				end
				if 坐标范围怪物数量(3605.81,-3515,137.989,3,"恶疫食尸鬼",1)>0 and HP()>0 then
					等待集合()
					走到(3653.95, -3573.35, 138.086,1)
					第二波()
					打完修整(2)
					等待集合()
					延时(1000)
					if HP() > 1 then
						if 等级() < 60 then
							走到(3639.56, -3536.29, 138.451,1,0,6)
						else
							走到(3639.56, -3536.29, 138.451,1,0,1)
						end
						使用技能("寒冰护体")
						延时(1000)
						清除目标()
						if 坐标范围怪物数量(3604.25708,-3488.064941,135.8951263,30,"斯库尔",1) > 0 then
							sikuer=1
						else
							sikuer=0
						end
						if 打开身边目标() then
							延时(500)
							if 读条中() then
								while 读条中() do 
									延时(1000)
								end
								延时(1500)
							else
								走到(3648.16, -3540.58, 137.917,1,0,1)
								延时(2000)
								朝向坐标(3639.56, -3536.29, 138.451)
								按键("w")
								延时(100)
								使用技能("冰霜新星(等级 1)")
								延时(1500)
								使用技能("魔爆术")
								延时(1500)
								while 战斗中() or 有目标() or 坐标范围怪物数量(3648.16, -3540.58, 137.917,13)>0 do 
									使用技能("魔爆术")
									延时(1500)
								end
							end
						end
					end
				end
				if sikuer==0 and 分配方式()~="group" then
					if 坐标范围怪物数量(3618.430176,-3503.268799,136.9620819,55,"缝补憎恶",1) == 0 and HP()>1 then
						到内杀怪点()
						使用技能("魔法抑制")
						for i=1,10 do 
							处理眼睛()
							延时(500)
						end
						if 是否队长() then
							if 坐标范围怪物数量(3557.01, -3436.03, 136.242,25,"尸体|骷髅",1) > 0 then
								前门准备()
								回满()
								前门第一波()
								打完修整(3)
								if HP() == 0 then
									STSM复活()
									进门()
									补状态()
									路径走到("STSM2",3602.28, -3489.53, 135.907)
								end
								等待集合()
							end
							
							走到(3602.28, -3489.53, 135.907,1)
							第五波()
							打完修整(4)
							--[[if HP() == 0 then
								STSM复活()
								进门()
								补状态()
								路径走到("STSM2",3602.28, -3489.53, 135.907)
							end
							等待集合()
							第五波()
							打完修整(2)--]]
							if HP() == 0 then
								STSM复活()
							end
						else
							if 分配方式() == "freeforall" and HP() > 1 then 
								if 坐标范围怪物数量(3557.01, -3436.03, 136.242,25,"尸体|骷髅",1) > 0 then
									前门准备()
									处理眼睛()
									使用物品("魔法肉桂面包")
									使用物品("魔法甜面包")
									使用物品("魔法山泉水")
									使用物品("魔法晶水")
									使用物品("魔法苏打水")
									前门第一波()
									打完修整(3)
									if HP() == 0 then
										STSM复活()
										进门()
										补状态()
										路径走到("STSM2",3602.28, -3489.53, 135.907)
									end
									等待集合()
								end
								走到(3602.28, -3489.53, 135.907,1)
								第五波()
								打完修整(4)
								--[[if HP() == 0 then
									STSM复活()
									进门()
									补状态()
									路径走到("STSM2",3602.28, -3489.53, 135.907)
								end
								等待集合()
								第五波()
								打完修整(2)--]]
								if HP() == 0 then
									STSM复活()
								end
							end
						end
					end
				end
				if HP() > 1 then
					if 是否队长() == false then
						while 分配方式() == "freeforall" or 分配方式() == "master" do 
							延时(500)
						end
					end
					if 检查回城() then
					else
						if 是否队长() then
							队伍拾取()
						end
						需要重置=1
						if 在副本() then
							if 是否队长() == false then
								while os.clock()-cztime<840 do 
									提示("等待重置时间")
									延时(1000)
								end
							end
							if 是否队长() then
								队伍拾取()
							end
							STSM出本()
						end
					end
				else
					STSM复活()
					检查回城()
				end
			end
		end
	end
end
function MLD跑路()
	if 在坐标范围(763.391, -606.285, -32.7622,20) then
		if 队伍人数() > 1 then
			自由拾取()
		end
		回满()
		使用技能("奥术智慧")
		延时(1500)
		使用技能("冰甲术")
		走到(763.591, -606.585, -32.7622)
		走到(791.177, -590.576, -33.0124)
		走到(788.362, -581.574, -33.1095)
		闪现走到(780.381, -548.489, -32.6954,1)
		if mincaiyao >225 then
			if 坐标范围有采集物(782.875, -541.437, -34.0273,5) and 可循环() then
				走到(782.875, -541.437, -34.0273,1)
				延时(300)
				范围采集(5)
			end
		end
		走到(793.957, -508.346, -53.0403)
		走到(836.211, -456.804, -56.2099)
		闪现走到(845.213, -428.623, -55.1317)
		走到(858.031, -417.811, -52.368)
		走到(872.286, -399.807, -51.724)
		走到(874.321, -385.596, -52.0486)
		走到(873.912, -378.399, -52.0496)
		走到(867.859, -365.768, -52.0496)
		走到(833.443, -331.159, -51.578,1)
		if mincaiyao >= 245 then
			if 坐标范围有采集物(854.413, -323.21, -51.5783,5) and 可循环() then
				走到(854.413, -323.21, -51.5783,1,0,4)
				延时(300)
				范围采集(5)
			end
			走到(833.443, -331.159, -51.578,1)
		end
		走到(807.585, -351.722, -51.6754,1)
		走到(799.974, -349.355, -51.6002,1)
		走到(782.297, -337.916, -50.1624,1)
		走到(765.008, -330.999, -51.2048,1)
		if mincaiyao >= 245 then
			if 坐标范围有采集物(753.596, -322.001, -51.5766,5) and 可循环() then
				走到(753.232, -320.83, -51.5766,1)
				延时(300)
				范围采集(5)
			end
			走到(765.008, -330.999, -51.2048,1)
		end
		使用技能("寒冰护体")
		延时(500)
		走到(745.523, -332.114, -50.6224)
		闪现走到(718.186, -322.614, -51.1647)
		走到(698.646, -314.874, -51.9323)
		走到(673.937, -323.255, -52.0977)
		--走到(669.042, -321.493, -52.0477)
		走到(662.702, -323.304, -52.0204)
		走到(659.158, -320.772, -52.0204)
		走到(658.579, -316.146, -52.02)
		--[[走到(665.065, -319.952, -50.5197,1,1,3)
		if 战斗中() then
			while 战斗中() do 
				延时(500)
			end
			延时(2000)
		end
		while 在坐标范围(658.086, -316.969, -52.0193,3) == false do
			朝向坐标(658.086, -316.969, -52.0193)
			按键("w",1)
			延时(100)
			跳()
			延时(500)
			按键("w",2)
			x,y,z = 当前坐标()
			if z < -52 then
				break
			end
		end--]]
		走到(650.669, -305.92, -52.1218)
		走到(645.627, -283.453, -52.7272)
		走到(648.341, -271.066, -53.002)
		走到(654.85, -256.272, -53.2285)
		if 战斗中() then
			朝向坐标(664.597, -251.07, -61.6945)
			跳()
			延时(1000)
			寻路结束()
			while 战斗中() do 
				延时(1000)
			end
			x,y,z = 当前坐标()
			while z > -64 and HP()>1 do 
				跳()
				延时(200)
				按键("w",1)
				延时(500)
				按键("w",2)
				x,y,z = 当前坐标()
			end
			走到(668.877, -248.379, -64.3912)
			走到(665.717, -236.665, -64.3912)
		else
			走到(661.962, -238.641, -64.3911)
		end
		闪现走到(663.941, -211.615, -64.3912,1,0.3)
		x,y,z = 当前坐标()
		while y < -211.3 and HP()>1 do
			跳()
			延时(300)
			按键("w",1)
			延时(300)
			按键("w",2)
			x,y,z = 当前坐标()
		end
		走到(673.034, -210.752, -59.9494)
		走到(689.075, -255.119, -53.0644)
		走到(691.916, -253.462, -53.0528)
		走到(693.88, -228.835, -47.3005)
		走到(693.98, -183.798, -48.1297)
		走到(672.233, -166.692, -48.9243)
		走到(660.016, -165.237, -51.2095)
		闪现走到(647.996, -142.76, -51.2938,1)
		if mincaiyao >= 245 then
			if 坐标范围有采集物(674.88, -140.9, -48.7,20) and 可循环() then
				走到(674.88, -140.9, -48.7,1)
				延时(300)
				范围采集(5)
			end
		end
		走到(630.764, -151.071, -53.1435,1)
		走到(618.096, -147.695, -54.3212,1)
		if mincaiyao >= 245 and 可循环() then
			if 坐标范围有采集物(600.963, -166.816, -55.1833,10) then
				走到(610.328, -160.145, -55.0941)
				走到(600.963, -166.816, -55.1833,1)
				延时(300)
				范围采集(5)
				走到(610.328, -160.145, -55.0941,1)
			end
			走到(618.096, -147.695, -54.3212,1)
		end
		while 存在DEBUFF("复活虚弱") do 
			提示("等待复活虚弱时间")
			延时(1000)
		end
		邀请小号()
		自由拾取()
	end
end
function 瀑布拉怪(mode)
	if mode==nil then
		mode=1
	end
	if 在坐标范围(618.096, -147.695, -54.3212,20) then
		while 存在DEBUFF("复活虚弱") do 
			提示("等待复活虚弱时间")
			延时(1000)
		end
		回满()
		if not 存在BUFF("奥术智慧") then
			使用技能("奥术智慧")
			延时(1500)
			使用技能("冰甲术")
			延时(1500)
		end
		if 背包物品数量("法力红宝石") == 0 then
			使用技能("制造魔法红宝石")
			延时(3500)
		end
		if 背包物品数量("法力黄水晶") == 0 then
			使用技能("制造魔法黄水晶")
			延时(3500)
		end
		使用技能("魔法抑制")
		延时(1500)
		回满()
		使用技能("寒冰护体")
		延时(1500)
		回满()
		走到(611.708, -135.682, -54.8031)
		走到(614.247, -123.873, -55.0252)
		走到(618.573, -115.278, -57.4998)
		走到(642.506, -104.166, -56.3862,1)
		if mincaiyao >= 245 then
			if 坐标范围有采集物(639.935, -103.379, -56.3138,10) then
				走到(639.935, -103.379, -56.3138,1)
				延时(300)
				范围采集(5)
			end
			走到(642.506, -104.166, -56.3862,1)
		end
		
		使用技能("暴风雪(等级 1)")
		指向坐标(623.1751709,-130.7037659,-54.83369827)
		延时(2000)
		走到(653.879, -107.377, -56.3867)
		--[[朝向坐标(681.737, -105.088, -56.0994)
		延时(1000)
		跳()
		延时(100)
		使用技能("冰霜新星(等级 1)")
		延时(1400)--]]
		闪现走到(681.737, -105.088, -56.0994)
		走到(704.843, -104.284, -56.3065,1)
		使用技能("暴风雪(等级 1)")
		指向坐标(669.6660156,-110.8787842,-56.10794449)
		延时(1600)
		走到(738.171, -100.246, -56.4933)
		走到(745.172, -105.65, -56.4477)
		走到(758.45, -96.9165, -56.4252)
		local tiao=0
		if 种族() == "侏儒" then
			tiao=1
		end
		走到(785.932, -79.7509, -57.1264)
		朝向坐标(828.736, -53.6831, -86.9803)
		if tiao==1 then
			跳()
			延时(410)
		end
		延时(1600)
		if HP() == 0 then
			return
		end
		使用技能("闪现术")
		走到(831.038, -50.2699, -86.9904,1)
		延时(1500)
		使用技能("寒冰护体")
		延时(1500)
		--[[while 坐标范围怪物数量(831.7814331,-19.94474411,-87.02040863,20,"塞雷布拉斯",1) > 0 do 
			延时(500)
		end--]]
		使用技能("暴风雪(等级 1)")
		指向坐标(835.8095093,-15.94311905,-87.13134766)
		延时(3000)
		范围选怪(813.3191528,-38.4753685,-87.56726074,15,"洞窟|洞穴")
		朝向坐标(813.3191528,-38.4753685,-87.56726074)
		使用技能("寒冰箭(等级 1)")
		延时(500)
		while 读条中() do 
			延时(100)
		end
		走到(830.675, -60.4877, -87.1633)
		闪现走到(839.405, -85.1379, -87.3543)
		范围选怪(835.616, -98.6321, -88.7195,15,"洞窟")
		local mobao=0
		if zr == 1 then
			走到(844.226, -91.3207, -87.2788)
			朝向坐标(852.008, -93.2108, -87.2356)
			跳()
			延时(100)
			朝向坐标(835.616, -98.6321, -88.7195)
			延时(100)
			使用技能("火焰冲击(等级 1)")
			走到(856.237, -93.7204, -87.2284)
			走到(863.383, -100.532, -87.1175,0,1)
			走到(867.575, -115.366, -87.4046)
			朝向坐标(860.786, -124.384, -88.4218)
			走到(860.786, -124.384, -88.4218,0,0,7)
			if 坐标范围怪物数量(859.786, -124.384, -88.4218,20,"塞雷布拉斯",1) > 0 then
				mobao=1
			end
			走到(860.786, -124.384, -88.4218,0,0,4)
			if mobao==1 then
				朝向坐标(858.961, -144.517, -88.2893)
				使用技能("魔爆术(等级 1)")
				移动("右",800)
				按键("w",1)
				延时(400)
			end
		else
			走到(843.243, -90.5992, -87.2852)
			跳()
			延时(100)
			朝向坐标(835.616, -98.6321, -88.7195)
			延时(100)
			使用技能("火焰冲击(等级 1)")
			朝向坐标(859.786, -124.384, -88.4218)
			走到(859.786, -124.384, -88.4218,0,0,6)
			if 坐标范围怪物数量(859.786, -124.384, -88.4218,20,"塞雷布拉斯",1) > 0 then
				mobao=1
			end
			走到(859.786, -124.384, -88.4218)
			if mobao==1 then
				朝向坐标(858.961, -144.517, -88.2893)
				使用技能("魔爆术(等级 1)")
				移动("右",800)
				--朝向坐标(858.961, -144.517, -88.2893)
				按键("w",1)
				延时(1000)
			end
			延时(400)
		end
		if HP() == 0 then
			return
		end
		朝向坐标(858.961, -144.517, -88.2893)
		跳()
		延时(200)
		使用技能("冰霜新星(等级 1)")
		while 技能可用("冰霜新星(等级 1)") and HP()>1 do 
			使用技能("冰霜新星(等级 1)")
			延时(100)
		end
		延时(100)
		走到(858.961, -144.517, -88.2893,0,0,8)
		范围选怪(844.699, -145.61, -88.4075,15,"洞窟")
		走到(858.835, -154.223, -88.3232)
		跳()
		延时(100)
		朝向坐标(844.699, -135.61, -88.4075)
		使用技能("火焰冲击(等级 1)")
		延时(100)
		走到(858.56, -162.788, -87.4989)
		朝向坐标(861.406, -175.139, -86.8879)
		延时(500)
		范围选怪(842.24, -170.864, -88.3363,15,"洞窟")
		走到(861.406, -175.139, -86.8879)
		走到(857.998, -188.069, -82.577)
		使用技能("法术反制")
		走到(847.471, -199.792, -76.7034)
		朝向坐标(831.438, -216.138, -74.869)
		--闪现走到(831.438, -216.138, -74.869,0,8)
		使用技能("闪现术")
		延时(300)
		走到(813.594, -212.419, -77.1489,1)
		--[[使用技能("暴风雪(等级 1)")
		指向坐标(812.6882324,-242.1257324,-60.66407776)--]]
		范围选怪(813.9749756, -230.7633057, -74.763,8,"软泥怪")
		朝向坐标(813.9749756, -230.7633057, -74.763)
		延时(1000)
		--延时(1500)
		--[[朝向坐标(798.979, -196.661, -77.1489)
		按键("w",1)
		延时(100)
		跳()
		延时(100)
		朝向坐标(813.9749756, -230.7633057, -74.763)--]]
		使用技能("火焰冲击(等级 1)")
		朝向坐标(798.979, -196.661, -77.1489)
		按键("w",1)
		while 在坐标范围(798.979, -196.661, -77.1489,11)==false and HP() > 0 do 
			if 存在DEBUFF("击倒") then
				使用技能("寒冰屏障")
				延时(300)
				取消BUFF("寒冰屏障")
			end
			朝向坐标(798.979, -196.661, -77.1489)
			延时(10)
		end
		使用技能("法力护盾")
		走到(798.979, -196.661, -77.1489)
		跳()
		延时(100)
		朝向坐标(823.608, -214.189, -77.1489)
		延时(150)
		使用技能("冰锥术(等级 1)")
		走到(791.917, -191.408, -76.593)
		if 存在DEBUFF("击倒") then
			使用技能("寒冰屏障")
			延时(300)
			取消BUFF("寒冰屏障")
		end
		走到(785.691, -190.08, -72.4957)
		走到(778.906, -194.189, -70.3603)
		使用技能("寒冰护体")
		走到(771.731, -206.511, -66.3274)
		朝向坐标(758.664, -197.692, -63.4229)
		跳()
		延时(300)
		使用技能("冰霜新星(等级 1)")
		延时(200)
		走到(758.664, -197.692, -63.4229,0,0,6)
		使用技能("寒冰护体")
		走到(768.082, -193.401, -60.9605,0,0,9)
		走到(777.014, -175.638, -56.8859)
		走到(781.478, -160.388, -55.9545,0,0,5)
		
		闪现走到(777.303, -128.266, -56.4562)
		范围选怪(744.5,-116.6,-56.4026947,8,"")
		走到(764.731, -121.482, -57.5135)
		走到(753.851, -110.59, -57.5153)
		走到(754.102, -101.831, -57.471)
		朝向坐标(749.111, -73.5426, -57.4371)
		跳()
		延时(100)
		朝向坐标(743.7984009,-127.606636,-56.4026947)
		使用技能("火焰冲击(等级 1)")
		朝向坐标(744.343, -64.7728, -56.5382)
		延时(2000)
		使用物品("法力黄水晶")
		使用技能("法力护盾")
		范围选怪(750.123,-42.8777,-56.2364,15,"")
		if HP() == 0 then
			return
		end
		--走到(732.303, -67.7582, -57.4993)
		走到(744.343, -64.7728, -56.5382)
		--[[while 技能可用("法术反制") do 
			使用技能("法术反制")
			延时(100)
		end
		延时(1200)--]]
		朝向坐标(724.884, -71.4213, -57.4999)
		使用技能("法术反制")
		延时(900)
		跳()
		延时(100)
		朝向坐标(777.303, -128.266, -56.4562)
		延时(100)
		使用技能("冰锥术(等级 1)")
		延时(100)
		朝向坐标(679.766, -91.9448, -57.5)
		延时(1200)
		朝向坐标(679.766, -91.9448, -57.5)
		使用技能("冰霜新星(等级 1)")
		--[[跳()
		延时(100)--]]
		--[[使用技能("冰霜新星(等级 1)")
		延时(1400)--]]
		使用技能("冰霜新星(等级 1)")
		while 技能可用("冰霜新星") and HP() > 1 do 
			if 存在DEBUFF("击倒") then
				使用技能("寒冰屏障")
				延时(300)
				取消BUFF("寒冰屏障")
				延时(1000)
			end
			延时(100)
			使用技能("冰霜新星(等级 1)")
		end
		延时(1300)
		闪现走到(679.766, -91.9448, -57.5)
		朝向坐标(651.09, -90.3405, -57.5)
		延时(1500)
		使用技能("寒冰护体")
		走到(651.09, -90.3405, -57.5)
		使用技能("寒冰护体")
		走到(631.267, -97.3181, -57.5)
		范围选怪(616.6940918,-102.009903,-56.82166672,10)
		if HP() == 0 then
			return
		end
		走到(626.304, -108.632, -55.5598)
		跳()
		延时(100)
		朝向坐标(616.6940918,-102.009903,-56.82166672)
		使用技能("火焰冲击(等级 1)")
		朝向坐标(613.004, -139.851, -54.6936)
		--延时(1500)
		--使用技能("法力护盾")
		走到(613.004, -139.851, -54.6936)
		走到(608.509, -145.628, -54.8515)
		延时(200)
		使用技能("魔爆术(等级 1)")
		朝向坐标(625.024, -169.186, -53.8577)
		延时(1400)
		朝向坐标(625.024, -169.186, -53.8577)
		使用技能("闪现术")
		延时(200)
		--走到(614.039, -148.234, -54.7507,0,0,1)
		走到(626.322, -178.737, -53.8577)
		朝向坐标(625.406, -186.789, -64.7436)
		延时(800)
		使用技能("魔爆术(等级 1)")
		走到(626.406, -201.689, -64.7436)
		闪现走到(640.925, -231.52, -58.3232,1)
		回血()
		延时(100)
		使用技能("唤醒")
		延时(8000)
		范围选怪(658.8982544,-226.1913147,-63.89769745,10)
		朝向坐标(658.8982544,-226.1913147,-63.89769745)
		使用技能("寒冰箭(等级 1)")
		使用技能("寒冰箭(等级 1)")
		延时(400)
		while 读条中() do 
			延时(100)
		end
		范围选怪(612.3360596,-208.5382538,-63.89769745,10)
		if HP() == 0 then
			return
		end
		朝向坐标(612.3360596,-208.5382538,-63.89769745)
		延时(400)
		for i=1,3 do
			朝向坐标(612.3360596,-208.5382538,-63.89769745)
			使用技能("寒冰箭(等级 1)")
			延时(100)
			使用技能("寒冰箭(等级 1)")
			延时(200)
			if 读条中() then
				break
			else
				移动("前",300)
				延时(100)
			end
		end
		while 读条中() do 
			延时(100)
		end
		if HP() == 0 then
			return
		end
		走到(642.364, -250.158, -52.9236)
		闪现走到(645.801, -284.277, -52.6911)
		朝向坐标(648.915, -302.613, -52.274)
		延时(1500)
		使用技能("寒冰护体")
		走到(648.915, -302.613, -52.274)
		回血()
		走到(656.789, -324.235, -52.0206)
		走到(640.788, -338.643, -52.0197)
		走到(633.774, -355.572, -52.0182)
		使用技能("法力护盾")
		走到(624.133, -357.041, -52.0182)
		走到(613.68, -368.543, -52.0185,1)
		使用技能("暴风雪(等级 1)")
		指向坐标(608.091, -399.767, -52.0185)
		范围选怪(588.218, -383.807, -52.0205,10)
		if HP() == 0 then
			return
		end
		延时(1400)
		使用技能("寒冰箭(等级 1)")
		延时(500)
		while 读条中() do 
			延时(100)
		end
		闪现走到(631.753, -352.487, -52.0194,1)
		延时(1000)
		朝向坐标(688.896, -364.601, -52.2051)
		if 存在DEBUFF("断筋") then
			按键("w",1)
			使用技能("寒冰屏障")
			延时(300)
			取消BUFF("寒冰屏障")
			延时(700)
		end
		延时(200)
		按键("w",1)
		延时(100)
		跳()
		延时(200)
		使用技能("冰霜新星(等级 1)")
		朝向坐标(688.896, -364.601, -52.2051)
		延时(1400)
		走到(665.474, -361.561, -52.177,0,0,7)
		走到(688.48, -365.314, -52.2181)
		范围选怪(696.108,-372.306,-52.0192,8)
		朝向坐标(710.058, -349.689, -51.9105)
		延时(2000)
		使用技能("寒冰护体")
		延时(1500)
		走到(710.058, -349.689, -51.9105,0,0,6)
		使用技能("法术反制")
		跳()
		延时(200)
		朝向坐标(688.48, -365.314, -52.2181)
		使用技能("冰锥术(等级 1)")
		朝向坐标(723.734, -337.434, -51.4976)
		走到(723.734, -337.434, -51.4976)
		朝向坐标(755.467, -348.766, -50.6632)
		闪现走到(755.467, -348.766, -50.6632)
		走到(767.756, -363.647, -61.5543)
		使用技能("寒冰护体")
		走到(775.798, -364.403, -61.242)
		走到(785.057, -374.368, -58.9388)
		走到(799.976, -405.354, -57.3546)
		走到(803.204, -424.736, -53.6516)
		走到(820.616, -456.127, -56.3024)
		走到(809.255, -483.334, -54.4946)
		闪现走到(782.004, -519.662, -52.6967)
		if HP() == 0 then
			return
		end
		延时(200)
		跳()
		延时(500)
		走到(789.311, -526.914, -47.3736)
		走到(799.128, -520.655, -43.2192)
		走到(803.425, -514.527, -41.5426)
		走到(802.78, -506.009, -40.8297,0,0,1.5)
		走到(796.384, -496.191, -39.9206,0,0,1.5)
		朝向坐标(784.319, -490.147, -39.9877)
		使用技能("寒冰护体")
		走到(784.3, -491.919, -40.0578,1)
		朝向坐标(784.319, -493.147, -39.9877)
		使用技能("法力护盾")
		延时(1500)
		if HP() == 0 then
			return
		end
		local dg1=0
		while 坐标范围怪物数量(792.749, -500.267, -53.0573) < 1 and HP()>1 do 
			延时(100)
			dg1=dg1+1
			if dg1>100 then
				if not 战斗中() then
					break
				end
			end
		end
		if dg1>100 and not 战斗中() then
			return
		end
		if HP() == 0 then
			return
		end
		使用技能("暴风雪(等级 1)")
		指向坐标(761.1047363, -514.7716064, -53.07720947)
		延时(2500)
		使用技能("暴风雪(等级 1)")
		指向坐标(778.152, -516.777, -49.7173)
		延时(7500)
		--[[使用技能("暴风雪(等级 1)")
		指向坐标(782.517, -523.566, -49.1065)
		延时(7000)--]]
		使用技能("暴风雪(等级 1)")
		指向坐标(810.9464111, -499.3264465, -40.43912125)
		延时(2000)
		走到(766.931, -472.79, -41.0056)
		朝向坐标(748.509, -471.278, -38.562)
		使用技能("冰霜新星(等级 1)")
		走到(757.742, -471.563, -39.6471)
		走到(741.959, -472.647, -39.2761)
		走到(721.778, -484.841, -39.8981)
		使用技能("寒冰护体")
		走到(720.121, -490.976, -36.9391)
		走到(722.851, -496.372, -37.0652)
		使用技能("魔爆术(等级 1)")
		走到(729.74, -510.59, -41.4617)
		闪现走到(747.627, -535.645, -33.258)
		走到(759.718, -531.746, -38.738,1,1)
		走到(763.688, -531.629, -38.8438,1)
		延时(500)
		使用技能("暴风雪(等级 1)")
		指向坐标(745.4859619,-530.5743408,-35.43308258)
		延时(8000)
		if HP() == 0 then
			return
		end
		延时(1000)
		使用技能("暴风雪(等级 1)")
		指向坐标(756.4210205, -548.9049072, -32.84716415)
		for i=1,30 do 
			延时(200)
			if MLD_坐标范围精英数量(763.688, -531.629, -38.8438,13) > 0 then
				break
			end
		end
		走到(771.357, -535.681, -37.6926)
		使用技能("寒冰护体")
		走到(777.526, -534.254, -37.233)
		走到(789.183, -515.431, -52.8172)
		闪现走到(811.495, -479.974, -54.9067)
		使用技能("寒冰护体")
		走到(820.685, -453.155, -56.3268)
		走到(802.022, -421.955, -53.5253)
		使用技能("寒冰护体")
		走到(803.433, -416.151, -54.1066)
		使用技能("寒冰护体")
		走到(812.548, -405.543, -57.5175)
		使用技能("法力护盾")
		走到(822.661, -393.226, -58.826,1)
		范围选怪(856.248,-386.299,-64.1306,8)
		延时(100)
		使用技能("寒冰箭(等级 1)")
		延时(500)
		while 读条中() do 
			延时(100)
		end
		走到(811.628, -380.713, -59.1117)
		范围选怪(771.807,-348.971,-61.6844,10)
		走到(804.376, -364.839, -59.0288,1,0,3)
		延时(100)
		朝向坐标(771.807,-348.971,-61.6844)
		if HP() == 0 then
			return
		end
		for i=1,5 do
			使用技能("寒冰箭(等级 1)")
			延时(200)
			if 读条中() then
				break
			else
				移动("前",500)
				延时(100)
			end
		end
		while 读条中() do 
			延时(100)
		end
		延时(100)
		走到(806.031, -377.507, -59.0953)
		使用技能("魔爆术(等级 1)")
		朝向坐标(801.683, -423.303, -53.5241)
		延时(1500)
		闪现走到(801.683, -423.303, -53.5241)
		朝向坐标(806.267, -428.684, -53.8174)
		跳()
		延时(200)
		使用技能("冰霜新星(等级 1)")
		走到(806.267, -428.684, -53.8174)
		走到(828.996, -437.895, -56.2568)
		使用技能("魔法抑制")
		走到(835.624, -435.838, -55.9048)
		走到(842.141, -431.404, -56.2465)
		走到(856.093, -418.449, -52.4596)
		走到(869.579, -402.928, -52.0211)
		范围选怪(894.477,-406.576,-52.7567,5)
		走到(875.639, -393.522, -52.0496)
		使用技能("法术反制")
		走到(878.892, -388.126, -52.0496,0,0,7)
		闪现走到(877.638, -359.803, -52.0495)
		使用技能("魔爆术(等级 1)")
		范围选怪(865.298,-331.491,-50.2814,10)
		走到(856.246, -344.019, -51.9881)
		跳()
		延时(100)
		朝向坐标(865.298,-331.491,-50.2814)
		使用技能("火焰冲击(等级 1)")
		走到(818.954, -344.737, -51.5781)
		朝向坐标(798.466, -340.056, -51.5327)
		if 坐标范围怪物数量(818.954, -344.737, -51.5781,10)>0 then
			跳()
			延时(200)
			使用技能("冰霜新星(等级 1)")
		else
			使用技能("寒冰护体")
		end
		走到(767.137, -332.957, -50.8879)
		走到(749.454, -333.467, -50.6681)
		闪现走到(718.638, -328.809, -51.3676)
		闪现走到(691.102, -325.415, -52.0188)
		使用技能("寒冰护体")
		闪现走到(659.901, -322.675, -52.0207)
		走到(654.557, -317.339, -52.0207)
		走到(649.986, -304.2, -52.1951)
		走到(646.583, -286.455, -52.5134)
		--使用技能("寒冰护体")
		走到(648.341, -271.066, -53.002)
		走到(654.85, -256.272, -53.2285)
		走到(661.962, -238.641, -64.3911)
		闪现走到(663.941, -211.615, -64.3912,1,0.3)
		if HP() == 0 then
			return
		end
		x,y,z = 当前坐标()
		while y < -211.3 and HP() > 1 do
			跳()
			延时(300)
			按键("w",1)
			延时(300)
			按键("w",2)
			x,y,z = 当前坐标()
		end
		走到(673.034, -210.752, -59.9494)
		--走到(675.893, -213.942, -60.4436,1)675.396, -226.138, -59.421
		走到(675.396, -226.138, -59.421,1)
		if HP() == 0 then
			return
		end
		while 坐标范围怪物数量(649.314, -209.068, -60.3911,18) < 2  and HP() > 0 and 战斗中() do 
			延时(300)
		end
		使用技能("暴风雪(等级 1)")
		指向坐标(649.314, -209.068, -60.3911)
		范围选怪(684.78, -196.663, -60.5195)
		延时(7000)
		朝向坐标(686.322,-196.2,-60.5154)
		使用技能("法术反制")
		走到(678.81, -229.569, -58.6202)
		朝向坐标(687.563, -253.006, -53.0719)
		延时(1500)
		使用技能("寒冰护体")
		范围选怪(692.78, -264.663, -52.93619537,20)
		走到(687.563, -253.006, -53.0719)
		使用技能("火焰冲击(等级 1)")
		--走到(695.261, -260.196, -53.0468,0,0,9)
		--朝向坐标(702.015, -242.801, -50.0363)
		--使用技能("魔爆术(等级 1)")
		走到(702.015, -242.801, -50.0363,0,1,2)
		朝向坐标(702.015, -198.092, -47.2588)
		跳()
		延时(100)
		闪现走到(702.015, -198.092, -47.2588,0,2)
		--[[闪现走到(717.652, -219.622, -47.2597)
		使用技能("魔爆术(等级 1)")
		走到(702.015, -198.092, -47.2588,0,0,4)--]]
		朝向坐标(696.832, -153.179, -47.7869)
		if 坐标范围怪物数量(702.015, -198.092, -47.2588,15,"",1)>0 then
			跳()
			延时(200)
			使用技能("冰霜新星(等级 1)")
		end
--[[		走到(696.832, -153.179, -47.7869)
		使用技能("法力护盾")
		走到(673.667, -146.473, -49.2952)
		使用技能("寒冰护体")
		走到(654.054, -148.623, -51.7346)
		延时(1000)
		x,y,z = 当前坐标()
		if 坐标范围怪物数量(x,y,z,14)>0 then
			跳()
			延时(100)
			朝向坐标(696.832, -153.179, -47.7869)
			延时(100)
			使用技能("冰锥术(等级 1)")
			延时(100)
			朝向坐标(632.344, -154.049, -53.1241)
		end
		if HP() == 0 then
			return
		end
		走到(632.344, -154.049, -53.1241)--]]
		走到(705.01, -151.442, -47.7565)
		使用技能("法力护盾")
		走到(685.143, -150.67, -48.2964)
		走到(667.854, -140.247, -49.4563)
		走到(643.757, -145.964, -51.7918)
		延时(500)
		朝向坐标(632.933, -149.797, -52.7498)
		x,y,z = 当前坐标()
		if 坐标范围怪物数量(x,y,z,10)>0 then
			跳()
			延时(50)
			朝向坐标(663.156, -153.024, -50.9323)
			延时(100)
			使用技能("冰锥术(等级 1)")
			延时(100)
			朝向坐标(632.933, -149.797, -52.7498)
		end
		if HP() == 0 then
			return
		end
		--使用技能("法力护盾")
		走到(632.933, -149.797, -52.7498)
		if 范围选怪(599.4717407, -160.6991882, -55.18762207,10) ~= 0 then
			延时(1000)
			使用技能("法术反制")
		else
			延时(1000)
		end
		朝向坐标(626.925, -180.365, -53.672)
		延时(100)
		跳()
		延时(100)
		闪现走到(626.925, -180.365, -53.6720,0,5)
		走到(625.331, -186.874, -53.2914,1)
		延时(500)
		使用技能("法师护甲")
		走到(642.931, -233.216, -57.635,1,0,0.3)
		if HP() == 0 then
			return
		end
		使用技能("寒冰护体")
		延时(1500)
		while 坐标范围怪物数量(671.0771484,-218.7119598,-59.76838684,16) < 1 and HP() > 0 and 战斗中() do
			延时(200)
		end--[[
		使用技能("暴风雪(等级 1)")
		指向坐标(675.2527466,-230.242157,-57.84373474)
		延时(5800)--]]
		使用技能("暴风雪(等级 1)")
		指向坐标(671.0771484,-218.7119598,-58.06838684)
		延时(6200)
		--[[使用技能("暴风雪(等级 1)")
		指向坐标(652.180542,-211.1854858,-63.89769745)
		延时(7000)--]]
		if 坐标范围怪物数量(642.931, -233.216, -57.635,15)>0 then
			朝向坐标(639.833, -263.748, -52.9196)
			按键("w",1)
			使用技能("冰霜新星(等级 1)")
			延时(1400)
			使用技能("闪现术")
		else
			闪现走到(639.833, -263.748, -52.9196)
		end
		走到(646.136, -288.901, -52.3972)
		if 坐标范围怪物数量(642.123, -312.158, -52.0192,18,"",1)>0 then
			走到(642.123, -312.158, -52.0192)
			朝向坐标(655.639, -319.449, -52.0207)
			跳()
			延时(100)
			使用技能("冰霜新星(等级 1)")
		else
			走到(651.434, -308.999, -52.0207)
		end
		走到(655.639, -319.449, -52.0207)
		走到(662.964, -323.056, -52.0207)
		回血()
		走到(683.851, -326.078, -52.0484)
		使用技能("寒冰护体")
		走到(718.488, -332.089, -51.5611,0,0,6)
		闪现走到(755.467, -348.766, -50.6632,1)
		if HP() == 0 then
			return
		end
		if 坐标范围怪物数量(726.7788696,-337.9665833,-50.84033203,15) == 0 then
			使用技能("寒冰护体")
			延时(1400)
		end
		回蓝()
		if MP() < 3000 then
			使用物品("法力红宝石")
			使用物品("法力黄水晶")
		end
		while 坐标范围怪物数量(726.7788696,-337.9665833,-50.84033203,18) == 0 and HP() > 0 and 战斗中() do 
			延时(100)
		end
		使用技能("暴风雪(等级 1)")
		指向坐标(726.7788696,-337.9665833,-50.84033203)
		延时(3000)
		if HP() == 0 then
			return
		end
		for i=1,20 do 
			if 坐标范围怪物数量(755.467, -348.766, -50.6632,15) > 0 then
				break
			end
			延时(200)
		end
		走到(782.245, -368.505, -59.9981)
		走到(785.321, -374.054, -58.9556,1)
		if HP()<=1 then
			return
		end
		延时(1000)
		使用技能("暴风雪(等级 1)")
		指向坐标(793.2970581,-343.6373291,-50.3452)
		延时(6000)
		闪现走到(799.252, -405.405, -57.2116)
		走到(803.02, -425.538, -53.7001)
		--[[走到(798.337, -401.668, -58.5039)
		闪现走到(802.729, -428.332, -53.8511)--]]
		走到(820.738, -456.028, -56.3046)
		回血()
		闪现走到(809.678, -482.541, -54.5941)
		--使用技能("魔法抑制")
		朝向坐标(782.581, -518.679, -52.7364)
		延时(1500)
		走到(782.581, -518.679, -52.7364)
		走到(780.111, -524.363, -50.2292,0,1)
		走到(789.559, -526.622, -47.3718)
		走到(799.414, -520.409, -43.1261)
		走到(803.193, -514.391, -41.5433)
		走到(803.159, -506.268, -40.87)
		走到(795.907, -495.664, -39.9218)
		使用技能("寒冰护体")
		if zr==1 then
			走到(786.054, -491.233, -39.9504,1,0,0.2)
		elseif zz=="巨魔" then
			if xb=="女" then
				走到(787.267, -489.57, -39.9118,1,0,0.25)
			else
				走到(787.267, -489.45, -39.9118,1,0,0.2)
			end
		elseif zz=="亡灵" then
			if xb=="女" then
				走到(787.267, -490.3, -39.9218,1,0,0.3)
			else
				走到(787.267, -490.2, -39.9218,1,0,0.3)
			end
		else
			if xb=="女" then
				走到(787.267, -490.45, -39.9218,1,0,0.3)
			else
				走到(787.267, -490.38, -39.9218,1,0,0.3)
			end
			--走到(787.24, -490.491, -39.9118,1,0,0.15)
			--走到(787.501, -490.32, -39.9105,1,0,0.15)
		end
		--延时(500)
		朝向坐标(786.7422485, -524.6149292, -48.55823517)
		if mode==2 then
			运行宏("/run SetCVar('autoInteract',1)")
		end
		--按键("s")
		if HP() == 0 then
			return
		end
		if MP() < 4000 then
			使用物品("法力红宝石")
			使用物品("强效法力药水")
		end
		if xb == "女" then
			if zz == "巨魔" then
				按键("w",1)
				延时(300)
				按键("w",2)
				x,y,z = 当前坐标()
				if y<-489.7 then
					按键("s",1)
					while y<-489.7 do 
						x,y,z = 当前坐标()
					end
					按键("s",2)
				end
			elseif zz == "人类" then
				按键("w",1)
				延时(300)
				按键("w",2)
				x,y,z = 当前坐标()
				if y<-490.47 then
					按键("s",1)
					while y<-490.47 do 
						x,y,z = 当前坐标()
					end
					按键("s",2)
				end
			elseif zz == "亡灵" then
			else
				按键("w")
				按键("s")
			end
		else
			if zz == "人类" then
				按键("w",1)
				延时(300)
				按键("w",2)
				x,y,z = 当前坐标()
				if y<-490.4 then
					按键("s",1)
					while y<-490.4 do 
						x,y,z = 当前坐标()
					end
					按键("s",2)
				end
				
			end
		end
		while MLD_坐标范围精英数量(792.749, -500.267, -53.0573,10,3) < 1 and HP()>0 and 战斗中() do 
			延时(100)
		end
		if HP() == 0 then
			return
		end
		使用技能("法力护盾")
		延时(2900)
		---第一场雪
		if MP()>3000 then
			使用技能("暴风雪")
		else
			使用技能("暴风雪(等级 1)")
		end
		if zr==1 then
			指向坐标(779.5287476, -521.2930908, -49.66462555)
		else
			指向坐标(780.1160889, -521.0947266, -50.26462555)
		end
		延时(7000)
		if HP() == 0 then
			return
		end
		---第2场雪
		if MP()>1600 or 存在BUFF("节能施法") then
			使用技能("暴风雪")
		else
			使用技能("暴风雪(等级 1)")
		end
		if zz=="巨魔" then
			指向坐标(785.541, -523.332, -47.1243)
		else
			指向坐标(785.541, -523.332, -47.1243)
			--指向坐标(787.6278076, -524.3218384, -46.5840416)
		end
		kk=os.clock()
		for i=1,70 do
			延时(100)
			if not 读条中() or os.clock()-kk>6.2 or MLD_坐标范围精英数量(801.5997314,-514.8057861,-41.82994843,5,2)>0 then
				break
			end
		end
		if HP() == 0 then
			return
		end
		---第3场雪
		if MP()>1200 or 存在BUFF("节能施法") then
			使用技能("暴风雪")
		else
			使用技能("暴风雪(等级 1)")
		end
		指向坐标(792.45, -522.98, -46.133)
		kk=os.clock()
		for i=1,65 do
			延时(100)
			if not 读条中() or os.clock()-kk>6.2 then
				break
			end
		end
		if HP() == 0 then
			return
		end
		---第4场雪
		使用技能("暴风雪(等级 1)")
		指向坐标(798.83, -518.87, -43.01)
		kk=os.clock()
		for i=1,30 do
			延时(100)
			if not 读条中() or os.clock()-kk>2.9 then
				break
			end
		end
		if 坐标范围怪物数量(778.503, -516.983, -52.712,6,"毒劣魔")>12 then
			朝向坐标(778.503, -516.983, -52.712)
			按键("s",1)
			延时(30)
			按键("s",2)
		end
		if HP() == 0 then
			return
		end
		local xuyidong=0
		local dxg=0
		需要重置=1
		local ww=0
		for ii=1,3 do
			if ii==1 then 
				if 高处下雪2(1) then
				end
			else
				if MLD_坐标范围精英数量(784.344, -491.667, -40.0322,23,3)>0 then
					使用技能("暴风雪(等级 1)")
					指向坐标(800.38, -504.387, -40.6264)
				else
					if 高处下雪2(1) then
					end
				end
				--指向坐标(801.889, -507.455, -40.0836)
				--指向坐标(801.9205933, -507.7381897, -40.98816681)
			end
			if ii==1 then
				ww=5.2
				延时(300)
			else
				ww=6
				延时(1000)
				上树() --下面
				return
			end
			kk=os.clock()
			for i=1,77 do
				延时(100)
				if os.clock()-kk>ww then
					延时(500)
					break
				end
				if not 读条中() then
					break
				end
				if MLD_坐标范围精英数量(784.344, -492.667, -40.0322,8,3)>0 then
					上树()
					return
				end
			end
			if ii==1 then
				if 技能可用("召唤水元素") then
					if os.clock()-bingdongtime<30 and os.clock()-bingdongtime>25 then
					else
						运行宏("/cast 召唤水元素")
					end
					bingdongtime = os.clock()
					运行宏("/cast 冰冻术")
					运行宏("/cast 冰冻术")
					指向坐标(802.15, -508.24, -41.01)
					走到(784.3, -490.919, -40.0578,1)
					for kbi=1,10 do 
						运行宏("/cast 狂暴/n/cast 冰冷血脉/n/cast 烈焰风暴")
						blxm=os.clock()
						指向坐标(797.788, -515.646, -41)
						延时(500)
						if 读条中() then
							while 读条中() do 
								延时(100)
							end
							break
						end
						延时(150)
					end
					上树()
					return
				end
			end
			if MLD_坐标范围精英数量(784.344, -492.667, -40.0322,17,3)>0 then
				上树()
				return
			end
			if HP() == 0 then
				return
			end
		end
	end
end
function 台子上(t)
	local ks=0
	local pf,bfxlvl=0,0
	if t==nil then
		t=2
	end
	for fi=1,t do
		if HP() == 0 then
			return
		end
		if MLD_坐标范围精英数量(784.344, -491.667, -40.0322,12,3)>0 then
			return
		end
		local leftMon=MLD_坐标范围精英数量(795.2208862,-522.6564941,-44.78491211,40)
		if leftMon == 0 then
			return
		end
		if leftMon == 1 then
			延时(300)
			for ji=1,5 do 
				if MLD_坐标范围精英数量(784.344, -491.667, -40.0322,18)>0 then
					return
				end
				x,y,z = 目标坐标()
				if x~= 0 then
					朝向坐标(x,y,z) 
					使用技能("寒冰箭")
					延时(500)
					while 读条中() do 
						延时(100)
					end
				end
			end
		else
			ks=os.clock()
			for jn=1,7 do
				if HP() == 0 then
					return
				end
				if leftMon>15 then
					bfxlvl=1
				else
					bfxlvl=0
				end
				if 高处下雪2(bfxlvl) then --
					
					
				else
					if MP()>3000 or 存在BUFF("节能施法") then
						使用技能("暴风雪")
					else
						回蓝()
						使用技能("暴风雪(等级 1)")
					end
					if fi==1 then
						指向坐标(801.7662,-509.0140686,-39.085)
					elseif fi==2 then
						指向坐标(800.111,-504.2050598,-40.039816)
						--指向坐标(799.111,-502.2050598,-39.039816)
					end
				end
				ks=os.clock()
				延时(300)
				if 读条中() then
					break
				end
			end
			延时(800)
			pf=0
			for ii=1,64,1 do
				if HP() == 0 then
					return
				end 
				if 读条中() then 
					延时(100)
				else
					if fi==1 then
					end
					break
				end
				if MLD_坐标范围精英数量(784.344, -491.667, -40.0322,12,3)>0 then
					return
				end
			end
			if os.clock()-ks>4 then
				if MLD_坐标范围精英数量(784.344, -491.667, -40.0322,20,3)>0 then
					return
				end
			end
		end
		if MLD_坐标范围精英数量(795.2208862,-522.6564941,-44.78491211,40) == 0 then
			return
		end
	end
end
function 树上()
	if HP() == 0 then
		return
	end
	local xg=0
	local ks=0
	local w=77
	local pf=0
	for fi=1,2 do
		local mon=MLD_坐标范围精英数量(795.2208862,-522.6564941,-44.78491211,40)
		if mon == 1 then
			延时(300)
			for ji=1,5 do
				if HP() == 0 then
					return
				end
				x,y,z = 目标坐标()
				if x~= 0 then
					朝向坐标(x,y,z) 
					使用技能("寒冰箭")
					延时(500)
					while 读条中() do 
						延时(100)
					end
				end
				if MLD_坐标范围精英数量(776.344, -511.667, -52.7322,18)>0 then
					return
				end
			end
		else
			for jn=1,7 do
				if HP() == 0 then
					return
				end
				if fi==1 and 低处下雪2() then 
					w=50
				else
					if xg==0 and pf==1 then
						return
					end
					if mon >20 then
						使用技能("暴风雪(等级 1)")
					else
						if MP()>3000 then
							使用技能("暴风雪")
						else
							使用技能("暴风雪(等级 1)")
						end
					end
					if fi==1 then
						指向坐标(801.891, -512.511, -41.4754)
						w=66
					elseif fi==2 then
						if zr==1 or xg==1 then
							指向坐标(801.2003784,-516.2559204,-42.01465607)
							--指向坐标(800.4197388,-516.8893433,-41.3584671)
							--指向坐标(801.7015991,-512.1643677,-40.02751923)
						else
							指向坐标(801.4544067,-512.5981445,-41.68325806)
						end
						w=66
					end
				end
				延时(200)
				if 读条中() then
					break
				end
			end
			ks=os.clock()
			if 坐标范围怪物数量(781.205, -521.436, -50.842,6,"毒劣魔") > 1 then
				xg=1
			end
			pf=0
			延时(800)
			jldo=0
			for ii=1,w,1 do 
				if (os.clock()-ks)>5 then
					pf=1
					break
				end
				if not 读条中() then
					break
				else
					if jldo == 0 then
						if 技能可用("冰冷血脉") then
							jldo=1
						end
					end
					延时(100)
				end
				if MLD简单判断上(-52.75) then
					return
				end
				if HP()==0 then
					return
				end
			end
			if fi==1 then
				if not MLD简单判断上(-48.55) then
					xgnum=坐标范围怪物数量(774.94, -516.076, -52.7703,10,"毒劣魔")
					if xgnum <= 12 or 坐标范围怪物数量(797.957, -520.309, -43.337,8,"毒劣魔") > 1 then
						if os.clock()-blxm<20 or mon>12 then
							if os.clock()-blxm<20 or jldo==1 or MP() > 1600 and 存在BUFF("寒冰护体") then
								运行宏("/cast 狂暴/n/cast 冰冷血脉/n/cast 烈焰风暴")
								指向坐标(799.66, -517.95, -42.64)
								延时(300)
								if 读条中() then
									lytime = os.clock()
									while 读条中() do 
										延时(100)
										if os.clock() - lytime >= 2.8 then
											break
										end
									end
								end
								运行宏("/stopcasting/n/cast 急速冷却")
								使用技能("暴风雪(等级 1)")
								指向坐标(800.183, -516.105, -42.5377)
								延时(1300)
								return
							end
						end
					elseif xgnum > 12 then
						if os.clock()-blxm<20 or mon>12 then
							if os.clock()-blxm<20 or jldo==1 or MP() > 3000 and 存在BUFF("寒冰护体") then
								运行宏("/cast 狂暴/n/cast 法术反制/n/cast 冰冷血脉/n/cast 烈焰风暴(等级 5)")
								指向坐标(776.1856079, -514.4125366, -52.6928)
								延时(300)
								if 读条中() then
									lytime = os.clock()
									while 读条中() do 
										延时(100)
										if os.clock() - lytime >= 2.8 then
											break
										end
									end
								end
								运行宏("/stopcasting/n/cast 急速冷却")
								使用技能("暴风雪(等级 1)")
								指向坐标(800.183, -516.105, -42.5377)
								延时(1300)
								return
							end
						end
					end
				end
			end
			if pf==1 and MLD简单判断上(-43) and MLD_坐标范围精英数量(796.303, -497.661, -39.9518,10,3)==0 then
				return
			end
			if MLD简单判断上(-48) and MLD_坐标范围精英数量(796.303, -497.661, -39.9518,10,3)==0 then
				return
			end
			if MLD_坐标范围精英数量(780, -500, -51,18,3)>0 then
				return
			end
		end
		if MLD_坐标范围精英数量(795.2208862,-522.6564941,-44.78491211,40) == 0 then
			return
		end
	end
end
g_shiqu=0
function 简单杀怪()
	上树()
	树上()
	回血()
	回蓝()
	if MLD_坐标范围精英数量(795.2208862,-522.6564941,-44.78491211,40) == 0 then
		return 0
	end
	上台子()
	--[[local numMon = MLD_坐标范围精英数量(795.2208862,-522.6564941,-44.78491211,40) 
	if numMon>0 then
		x,y,z = 当前坐标()
		if z < -42 then
			--紧急绕圈()
		end
	end--]]
	if MP() < 350 then
		numMon = MLD_坐标范围精英数量(795.2208862,-522.6564941,-44.78491211,40) 
		if 坐标范围怪物数量(795.2208862,-522.6564941,-44.78491211,60,"毒劣魔") == 0 and numMon>1 and numMon<7 then
			提示("小鬼没了,出本先")
			路径寻路("玛拉顿出副本")
			玛拉顿出本()
			延时(1000)
			玛拉顿进本()
			延时(4000)
			走到(763.591, -606.585, -32.7622)
			走到(791.177, -590.576, -33.0124)
			走到(788.362, -581.574, -33.1095)
			闪现走到(780.381, -548.489, -32.6954)
			走到(793.957, -508.346, -53.0403)
			return 2
		end
	end
	if not 在坐标范围(795.2208862,-522.6564941,-44.78491211,40) then
		传送处理()
		return 0
	end
	--[[if 需要跑圈2() then
		跑圈(0,0,1)
		g_shiqu=1
		return 1
	else--]]
		台子上()
		if 需要跑圈2() then
			使用技能("冰霜新星(等级 1)")
			跑圈(0,0,1)
			g_shiqu=1
			return 1
		end
		return 0
	--end
end
function 简单杀怪2()
	上树2()
	if MLD_坐标范围精英数量(795.2208862,-522.6564941,-44.78491211,40) == 0 then
		return
	end
	树上()
	回血()
	回蓝()
	if MLD_坐标范围精英数量(795.2208862,-522.6564941,-44.78491211,40) == 0 then
		return
	end
	上台子2()
	if 需要跑圈2() then
		跑圈(0,0,1)
		return 1
	else
		台子上()
		if 需要跑圈2() then
			使用技能("冰霜新星(等级 1)")
			跑圈(0,0,1)
			return 1
		end
		return 0
	end
end
function 监狱冰环()
	按键("w",1)
	延时(100)
	使用技能("冰霜新星")
	while 存在DEBUFF("反手一击") do
		延时(100)
	end
	while 技能可用("冰霜新星") and HP()>0 do
		使用技能("冰霜新星")
	end
end
function 监狱1()
	if HP() <= 1 or 坐标范围怪物数量(84.612, 30.2998, -26.529,15,"迪菲亚",1) == 0 then
		return
	end
	使用技能("寒冰护体")
	回满()
	延时(8000)
	走到(84.7345, 4.82229, -26.2126)
	走到(84.612, 30.2998, -26.529)
	使用技能("魔爆术(等级 1)")
	走到(84.528, 18.2436, -26.5236)
	使用技能("魔爆术(等级 1)")
	走到(84.5057, 0.555073, -25.6062)
	使用技能("魔爆术(等级 1)")
	走到(84.6173, -27.8112, -26.5229)
	使用技能("魔爆术(等级 1)")
	走到(85.1322, -33.2817, -26.1299,1)
	if 战斗中() then
		朝向坐标(84.5057, 0.555073, -25.6062)
		延时(3500)
		监狱冰环()
		走到(84.8072, -11.3004, -26.5229,1)
		使用技能("寒冰护体")
		延时(1400)
		使用技能("暴风雪")
		指向坐标(84.6787, -25.0575, -26.5229)
		for i=1,8 do 
			延时(1000)
			if not 读条中() then
				break
			end
		end
		移动("前",500)
		使用技能("冰锥术")
		延时(1400)
		while true do 
			使用技能("魔爆术")
			延时(1400)
			if not 战斗中() then
				延时(500)
				if not 战斗中() then
					break
				end
			end
		end
		if HP() > 1 and jianyushiqu ~= 0 then
			摸尸体(8)
		end
		走到(84.5305, -8.79139, -26.5229,1)
		回满()
		使用技能("寒冰护体")
		if not 战斗中() then
			延时(8000)
		end
	end
	走到(84.7434, 0.609454, -25.6062,1)
end
function 监狱2()
	if HP() <= 1 or 坐标范围怪物数量(106.859, 25.9102, -26.5229,15,"迪菲亚",1) == 0 then
		return
	end
	路径走到("监狱1",84.7434, 0.609454, -25.6062)
	走到(107.139, 3.40267, -25.6474)
	走到(106.859, 25.9102, -26.5229)
	使用技能("魔爆术(等级 1)")
	走到(106.821, 1.26627, -25.6062)
	使用技能("魔爆术(等级 1)")
	走到(106.875, -12.3416, -26.5229)
	使用技能("魔爆术(等级 1)")
	走到(106.959, -33.123, -26.2516,1)
	if 战斗中() then
		使用技能("魔爆术(等级 1)")
		朝向坐标(106.875, -12.3416, -26.5229)
		延时(3500)
		监狱冰环()
		走到(106.989, -11.8903, -26.5229,1)
		使用技能("寒冰护体")
		延时(1400)
		使用技能("暴风雪")
		指向坐标(107, -25.3647, -26.5229)
		for i=1,8 do 
			延时(1000)
			if not 读条中() then
				break
			end
		end
		移动("前",500)
		使用技能("冰锥术")
		延时(1400)
		while true do 
			使用技能("魔爆术")
			延时(1400)
			if not 战斗中() then
				延时(500)
				if not 战斗中() then
					break
				end
			end
		end
		if HP() > 1 and jianyushiqu ~= 0 then
			摸尸体(8)
		end
		回满()
		使用技能("寒冰护体")
		if not 战斗中() then
			延时(13000)
		end
	end
	走到(106.939, 0.554085, -25.6062,1)
end
function 监狱3()
	if HP() <= 1 or 坐标范围怪物数量(128.879, 0.909209, -25.6062,15,"迪菲亚",1) == 0 then
		return
	end
	路径走到("监狱1",106.939, 0.554085, -25.6062,1)
	走到(128.879, 0.909209, -25.6062)
	使用技能("魔爆术(等级 1)")
	走到(149.284, 0.76498, -25.6062)
	使用技能("魔爆术(等级 1)")
	走到(173.759, -0.606961, -25.5967,1)
	if 战斗中() then
		朝向坐标(149.397, 0.789954, -25.6062)
		延时(3500)
		监狱冰环()
		走到(149.397, 0.789954, -25.6062,1)
		使用技能("寒冰护体")
		延时(1400)
		使用技能("暴风雪")
		指向坐标(165.9, -0.0293105, -25.6062)
		for i=1,8 do 
			延时(1000)
			if not 读条中() then
				break
			end
		end
		移动("前",500)
		使用技能("冰锥术")
		延时(1400)
		while true do 
			使用技能("魔爆术")
			延时(1400)
			if not 战斗中() then
				延时(500)
				if not 战斗中() then
					break
				end
			end
		end
		if HP() > 1 and jianyushiqu ~= 0 then
			摸尸体(8)
		end
		回满()
		使用技能("寒冰护体")
		延时(5000)
	end
	走到(134.468, 1.06529, -25.6062,1)
end
function 监狱4()
	if HP() <= 1 or 坐标范围怪物数量(105.265, 48.1467, -34.8562,15,"迪菲亚",1) == 0 then
		return
	end
	路径走到("监狱1",129.595, 8.17384, -25.6062)
	走到(126.028, 45.7247, -34.5522)
	走到(105.265, 48.1467, -34.8562)
	延时(200)
	使用技能("魔爆术(等级 1)")
	走到(129.011, 45.2266, -33.9396)
	使用技能("魔爆术(等级 1)")
	走到(154.028, 42.2815, -34.8562)
	使用技能("魔爆术(等级 1)")
	走到(163.725, 41.2174, -34.5618,1)
	if 战斗中() then
		朝向坐标(139.475, 44.1196, -34.8562)
		延时(3500)
		监狱冰环()
		走到(139.475, 44.1196, -34.8562,1)
		使用技能("寒冰护体")
		延时(1400)
		使用技能("暴风雪")
		指向坐标(156.078, 42.2212, -34.8562)
		for i=1,8 do 
			延时(1000)
			if not 读条中() then
				break
			end
		end
		移动("前",500)
		使用技能("冰锥术")
		延时(1400)
		while true do 
			使用技能("魔爆术")
			延时(1400)
			if not 战斗中() then
				延时(500)
				if not 战斗中() then
					break
				end
			end
		end
		if HP() > 1 and jianyushiqu ~= 0 then
			摸尸体(8)
		end
		回满()
		使用技能("寒冰护体")
		if  not 战斗中() then
			延时(9000)
		end
	end
	走到(130.051, 45.1416, -33.9396,1)
end
function 监狱5()
	if HP() <= 1 or 坐标范围怪物数量(158.592, 59.7704, -34.8562,15,"迪菲亚",1) == 0 then
		return
	end
	路径走到("监狱1",130.051, 45.1416, -33.9396,1)
	走到(137.852, 65.9875, -34.2812)
	走到(158.592, 59.7704, -34.8562)
	延时(200)
	使用技能("魔爆术(等级 1)")
	走到(134.745, 67.032, -33.9395)
	使用技能("魔爆术(等级 1)")
	走到(119.819, 71.471, -34.8562)
	使用技能("魔爆术(等级 1)")
	走到(103.965, 75.9636, -34.8562,1)
	使用技能("魔爆术(等级 1)")
	if 战斗中() then
		朝向坐标(125.106, 69.6003, -34.8562)
		延时(3500)
		监狱冰环()
		走到(125.106, 69.6003, -34.8562,1)
		使用技能("寒冰护体")
		延时(1400)
		使用技能("暴风雪")
		指向坐标(110.085, 74.2574, -34.8562)
		for i=1,8 do 
			延时(1000)
			if not 读条中() then
				break
			end
		end
		移动("前",500)
		使用技能("冰锥术")
		延时(1400)
		while true do 
			使用技能("魔爆术")
			延时(1400)
			if not 战斗中() then
				延时(500)
				if not 战斗中() then
					break
				end
			end
		end
		if HP() > 1 and jianyushiqu ~= 0 then
			摸尸体(8)
		end
		回满()
		使用技能("寒冰护体")
		if  not 战斗中() then
			延时(10000)
		end
	end
	走到(134.574, 66.7682, -33.9396,1)
end
function 监狱6()
	if HP() <= 1 or 坐标范围怪物数量(153.039, 106.487, -35.1895,15,"迪菲亚",1) == 0 then
		return
	end
	路径走到("监狱1",134.574, 66.7682, -33.9396,1)
	走到(144.838, 92.2843, -33.9404)
	使用技能("魔爆术(等级 1)")
	走到(153.039, 106.487, -35.1895)
	使用技能("魔爆术(等级 1)")
	走到(168.623, 99.4097, -33.9395)
	走到(173.714, 96.5855, -33.9395)
	使用技能("魔爆术(等级 1)")
	走到(184.944, 90.9597, -33.9395)
	使用技能("魔爆术(等级 1)")
	走到(193.01, 86.48, -33.7178,1)
	if 战斗中() then
		朝向坐标(171.928, 97.6964, -33.9396)
		延时(3500)
		监狱冰环()
		走到(171.928, 97.6964, -33.9396,1)
		使用技能("寒冰护体")
		延时(1400)
		使用技能("暴风雪")
		指向坐标(186.248, 90.0086, -33.9396)
		for i=1,8 do 
			延时(1000)
			if not 读条中() then
				break
			end
		end
		移动("前",500)
		使用技能("冰锥术")
		延时(1400)
		while true do 
			使用技能("魔爆术")
			延时(1400)
			if not 战斗中() then
				延时(500)
				if not 战斗中() then
					break
				end
			end
		end
		if HP() > 1 and jianyushiqu ~= 0 then
			摸尸体(8)
		end
		回满()
		使用技能("寒冰护体")
		if  not 战斗中() then
			延时(10000)
		end
	end
	走到(156.692, 106.17, -35.1895,1)
end
function 监狱7()
	if HP() <= 1 or 坐标范围怪物数量(120.346, 124.974, -33.9395,15,"迪菲亚",1) == 0 then
		return
	end
	路径走到("监狱1",156.692, 106.17, -35.1895,1)
	走到(137.724, 115.726, -33.9395)
	走到(120.346, 124.974, -33.9395)
	使用技能("魔爆术(等级 1)")
	走到(131.87, 119.144, -33.9395)
	使用技能("魔爆术(等级 1)")
	走到(141.917, 113.414, -35.1896)
	走到(159.605, 119.909, -34.5835)
	走到(164.812, 129.813, -33.9395)
	使用技能("魔爆术(等级 1)")
	走到(174.213, 147.515, -33.769,1)
	if 战斗中() then
		使用技能("魔爆术(等级 1)")
		朝向坐标(163.036, 126.194, -33.9396)
		延时(3500)
		监狱冰环()
		走到(163.036, 126.194, -33.9396,1)
		使用技能("寒冰护体")
		延时(1400)
		使用技能("暴风雪")
		指向坐标(170.403, 140.257, -33.9396)
		for i=1,8 do 
			延时(1000)
			if not 读条中() then
				break
			end
		end
		移动("前",500)
		使用技能("冰锥术")
		延时(1400)
		while true do 
			使用技能("魔爆术")
			延时(1400)
			if not 战斗中() then
				延时(500)
				if not 战斗中() then
					break
				end
			end
		end
		if HP() > 1 and jianyushiqu ~= 0 then
			摸尸体(8)
		end
		回满()
		使用技能("寒冰护体")
		走到(153.602, 109.537, -35.1895)
		走到(144.975, 92.4668, -33.9395)
		走到(134.418, 68.9717, -33.9395)
		使用技能("寒冰护体")
		走到(129.583, 39.1974, -33.9395)
		走到(126.881, 7.43829, -25.6062)
	else
		路径走到("监狱1",126.138, -9.74378, -25.6062)
	end
	走到(126.138, -9.74378, -25.6062,1)
end
function 监狱8()
	if HP() <= 1 then
		return
	end
	路径走到("监狱出本",131.895, -44.1439, -34.4343)
	走到(140.273, -45.4833, -34.8561)
	使用技能("魔爆术(等级 1)")
	走到(154.119, -46.8087, -34.8561)
	使用技能("魔爆术(等级 1)")
	走到(130.725, -43.9206, -33.9587)
	使用技能("魔爆术(等级 1)")
	走到(116.841, -42.2507, -34.8562)
	使用技能("魔爆术(等级 1)")
	走到(102.509, -40.5543, -34.8562)
	if 战斗中() then
		使用技能("魔爆术(等级 1)")
		走到(95.3771, -39.7101, -34.8562,1)
		朝向坐标(103.263, -40.6632, -34.8562)
		延时(3500)
		监狱冰环()
		走到(118.174, -42.4318, -34.8562,1)
		使用技能("寒冰护体")
		延时(1400)
		使用技能("暴风雪")
		指向坐标(102.027, -40.4103, -34.8562)
		for i=1,8 do 
			延时(1000)
			if not 读条中() then
				break
			end
		end
		移动("前",500)
		使用技能("冰锥术")
		延时(1400)
		while true do 
			使用技能("魔爆术")
			延时(1400)
			if not 战斗中() then
				延时(500)
				if not 战斗中() then
					break
				end
			end
		end
		if HP() > 1 and jianyushiqu ~= 0 then
			摸尸体(8)
		end
		回满()
		使用技能("寒冰护体")
		延时(18000)
	end
	走到(127.968, -43.628, -33.9395,1)
end
function 监狱9()
	if HP() <= 1 or 坐标范围怪物数量(99.3245, -58.3179, -34.8562,15,"迪菲亚",1) == 0 then
		return
	end
	路径走到("监狱出本",127.968, -43.628, -33.9395,1)
	走到(125.563, -65.8438, -33.9395)
	--走到(135.478, -69.0826, -34.8562)
	--使用技能("魔爆术(等级 1)")
	--走到(150.215, -73.3644, -34.8562)
	--使用技能("魔爆术(等级 1)")
	--走到(125.605, -65.9534, -33.9396)
	--使用技能("魔爆术(等级 1)")
	走到(111.811, -61.9458, -34.8562)
	使用技能("魔爆术(等级 1)")
	走到(99.3245, -58.3179, -34.8562)
	使用技能("魔爆术(等级 1)")
	走到(93.8797, -56.736, -34.8562,1)
	if 战斗中() then
		朝向坐标(114.939, -62.8201, -34.8562)
		延时(3500)
		监狱冰环()
		走到(114.939, -62.8201, -34.8562,1)
		使用技能("寒冰护体")
		延时(1400)
		使用技能("暴风雪")
		指向坐标(99.3988, -58.3148, -34.8562)
		for i=1,8 do 
			延时(1000)
			if not 读条中() then
				break
			end
		end
		移动("前",500)
		使用技能("冰锥术")
		延时(1400)
		while true do 
			使用技能("魔爆术")
			延时(1400)
			if not 战斗中() then
				延时(500)
				if not 战斗中() then
					break
				end
			end
		end
		if HP() > 1 and jianyushiqu ~= 0 then
			摸尸体(8)
		end
		回满()
		使用技能("寒冰护体")
		延时(10000)
	end
	走到(123.867, -65.4812, -33.9396,1)
	
end
function 监狱10()
	if HP() <= 1 or 坐标范围怪物数量(113.18, -90.3436, -33.9396,15,"迪菲亚",1) == 0 then
		return
	end
	路径走到("监狱出本",123.642, -65.1045, -33.9395,1)
	走到(113.18, -90.3436, -33.9396)
	使用技能("魔爆术(等级 1)")
	走到(106.076, -104.939, -35.1895)
	使用技能("魔爆术(等级 1)")
	走到(89.3566, -97.7002, -33.9395)
	走到(84.2291, -94.4888, -33.9395)
	使用技能("魔爆术(等级 1)")
	走到(72.2585, -88.701, -33.9395)
	使用技能("魔爆术(等级 1)")
	走到(65.3984, -84.9636, -33.9392,1)
	if 战斗中() then
		朝向坐标(86.171, -95.9472, -33.9392)
		延时(3500)
		监狱冰环()
		走到(86.171, -95.9472, -33.9392,1)
		使用技能("寒冰护体")
		延时(1400)
		使用技能("暴风雪")
		指向坐标(71.9537, -88.6474, -33.9392)
		for i=1,8 do 
			延时(1000)
			if not 读条中() then
				break
			end
		end
		移动("前",500)
		使用技能("冰锥术")
		延时(1400)
		while true do 
			使用技能("魔爆术")
			延时(1400)
			if not 战斗中() then
				延时(500)
				if not 战斗中() then
					break
				end
			end
		end
		if HP() > 1 and jianyushiqu ~= 0 then
			摸尸体(8)
		end
		回满()
		使用技能("寒冰护体")
		延时(10000)
	end
	走到(100.772, -104.184, -35.1895,1)
end
function 监狱11()
	if HP() <= 1 then
		return
	end
	路径走到("监狱出本",100.772, -104.184, -35.1895,1)
	走到(119.751, -114.057, -33.9395)
	走到(138.123, -123.795, -33.9395)
	使用技能("魔爆术(等级 1)")
	走到(127.819, -118.199, -33.9395)
	使用技能("魔爆术(等级 1)")
	走到(115.878, -111.988, -35.1896)
	走到(98.1132, -119.262, -34.0948)
	走到(93.5015, -127.939, -33.9395)
	使用技能("魔爆术(等级 1)")
	走到(87.7844, -138.596, -33.9395)
	使用技能("魔爆术(等级 1)")
	走到(84.0397, -146.106, -33.6963,1)
	if 战斗中() then
		朝向坐标(93.5015, -127.939, -33.9395)
		延时(4000)
		监狱冰环()
		走到(95.2573, -124.846, -33.9395,1)
		使用技能("寒冰护体")
		延时(1400)
		使用技能("暴风雪")
		指向坐标(88.1899, -137.962, -33.9395)
		for i=1,8 do 
			延时(1000)
			if not 读条中() then
				break
			end
		end
		移动("前",500)
		使用技能("冰锥术")
		延时(1400)
		while true do 
			使用技能("魔爆术")
			延时(1400)
			if not 战斗中() then
				延时(500)
				if not 战斗中() then
					break
				end
			end
		end
		if HP() > 1 and jianyushiqu ~= 0 then
			摸尸体(8)
		end
	end
	走到(103.605, -108.384, -35.1895,1)
end
function 暴风城补给()
	local map=地图名()
	if map ~= "暴风城" and map ~= "监狱" then
		使用技能("传送：暴风城")
		延时(15000)
		while 过图中() do 
			延时(1000)
		end
	end
	if 在坐标范围(-8998.29, 861.871, 29.6206,20) then
		走到(-9009.8, 876.095, 29.6206)
		走到(-9018.27, 886.745, 29.6206)
		移动("前",2000)
		走到(-9001.7, 867.996, 142.295)
		走到(-9004.03, 876.908, 137.905)
		走到(-9013.2, 875.381, 132.978)
		走到(-9002.08, 864.915, 129.709,1)
		上马()
		走到(-8995.51, 822.79, 104.75,1)
	end
	local num = 背包物品数量("传送符文")
	if 存在技能("召唤餐桌") then
		num2 = 背包物品数量("魔粉")
	else
		num2 = 100
	end
	if num < 2 then
		走到(-8991.63, 860.146, 126.529)
		走到(-8979.28, 868.747, 122.526)
		移动("前",800)
		闪现走到(-8951.11, 888.383, 108.103)
		走到(-8948.58, 890.881, 108.103)
		走到(-8950.27, 896.944, 109.177,1)
		打开NPC("欧文·沃弗恩")
		延时(1000)
		对话选项(1)
		if num < 2 then
			购买物品(7,20-num)
			延时(100)
		end
		if num2 < 20 then
			购买物品(9,20-num2)
		end
		延时(1000)
		走到(-8948.86, 889.48, 108.104)
		走到(-8956.81, 884.533, 105.703,1)
		上马()
		走到(-8995.51, 822.79, 104.75,1)
	end
	if 在坐标范围(-8995.51, 822.79, 104.75,70) then
		走到(-8995.51, 822.79, 104.75)
		走到(-8989.02, 797.572, 101.623)
		走到(-8967.44, 773.482, 95.1955)
		走到(-8935.31, 773.231, 88.7141)
		走到(-8908.44, 788.225, 87.6685)
		走到(-8880.34, 755.839, 96.2388)
		走到(-8845.68, 781.225, 95.8445)
	end
	if 地图名() == "暴风城" then
		路径走到("监狱修理",-8787.32, 827.403, 97.6469)
	end
end
function 单次监狱(cz)
	监狱进本(cz)
	if 在副本() and 地图名()=="监狱" then
		自由拾取()
		使用技能("奥术智慧")
		延时(1500)
		使用技能("冰甲术")
		延时(1500)
		if not 战斗中() then
			回满()
		end
		使用技能("寒冰护体")
		监狱1()
		监狱2()
		监狱3()
		监狱4()
		监狱5()
		监狱6()
		监狱7()
		监狱8()
		监狱9()
		监狱10()
		监狱11()
		if HP() > 1 then
			队伍拾取()
			监狱出本()
		end
	end
	if HP() <= 1 then
		释放灵魂()
		路径寻路("监狱复活")
		复活()
		延时(300)
		自动寻路(-8786.84, 828.974, 97.6513)
		复活()
		延时(300)
		走到(-8773.42, 839.396, 91.5817,1)
		朝向坐标(-8763.13, 847.128, 87.909)
		if HP() <= 1 then
			移动("前",5000)
			while 过图中() do 
				延时(1000)
			end
		end
		if 需要修理() then
			监狱出本()
		end
	end
end
function 影牙复活()
	if HP() <= 1 then
		if HP()==0 then
			释放灵魂()
		end
		路径寻路("影牙复活")
		复活()
	end
end
function 影牙进本()
	if not 在副本() then
		if not 在坐标范围(-234.61, 1563.83, 76.8921,20) then
			if 在路径范围("布瑞尔到影牙城堡") then
				路径走到("布瑞尔到影牙城堡",-235.08, 1560.41, 76.8924)
			elseif 在路径范围("瑟伯切尔到影牙") then
				路径走到("瑟伯切尔到影牙",-235.08, 1560.41, 76.8924)
			else
				提示("不在已知路径范围")
				return
			end
		end
		if 是否队长() or 队伍人数() < 2 then
			重置副本()
			if 是否队长() then
				运行宏("/p 进本")
				延时(2000)
			end
			if 已重置次数 ~= nil then
				已重置次数=已重置次数+1
				置重置次数(已重置次数)
			end
		end
		走到(-234.61, 1563.83, 76.8921,1)
		走到(-232.475, 1568.78, 76.8924,1)
		移动("前",5000)
		while 过图中() do 
			延时(1000)
		end
	end
end
function 影牙出本()
	while 在副本() and HP()>1 do
		if 是否队长() then
			运行宏("/p 出本")
			延时(2000)
		end
		走到(-228.399, 2111.5, 76.8904,1)
		朝向坐标(-231.8798065,2103.113525,76.89211273)
		移动("前",3000)
		while 过图中() do 
			延时(1000)
		end
	end
end
function 石爪峰修理()
	if HP() <= 1 or 在飞机上() then
		while 在飞机上() do 
			延时(1000)
		end
		return
	end
	val = 检查挂机方案()
	if val >= 404 or val == 11 or val == 22 then
		return
	end
	if 在坐标范围(2729.8, 1499.16, 236.829,40) then  --2677.57, 1504.67, 234.679
		if mldcc == 0 then
			路径走到("石爪峰修理",2680.65, 1486.26, 233.997)
			发送邮件()
		end
	end
	if 在坐标范围(2680.65, 1486.26, 233.997,80) then
		上马()
		路径走到("石爪峰修理",2677.57, 1504.67, 234.679)
		if 打开NPC("伊林安尼") then
			延时(1000)
			for i=1,3 do 
				延时(1000)
				出售垃圾()
			end
		end
	end
	if 在坐标范围(2689.87, 1517, 234.882,90) then
		路径走到("石爪峰修理",2682.17, 1467.43, 233.56)
		if 打开NPC("泰罗伦") then
			对话选项(1)
			延时(500)
			坐飞机到("凄凉之地")
			延时(1000)
			while 在飞机上() do 
				延时(1000)
			end
		end
	end
	if 在坐标范围(925.932, 903.258, 104.937,100) then
		路径走到("葬影村飞行点到烈日石居",925.932, 903.258, 104.937)
		if mldcc == 0 then
			发送邮件()
		end
		路径走到("葬影村飞行点到烈日石居",973.75, 1024.94, 104.899)
	end
	if 在坐标范围(987.198, 1034.31, 105.542,50) then
		走到(987.198, 1034.31, 105.542)
		走到(989.317, 1032.29, 106.547,1)
		for dni=1,5 do
			if 打开NPC("波兰德") then
				延时(1000)
				for i=1,3 do 
					延时(1000)
					出售垃圾()
				end
				break
			end
			延时(1000)
		end
		走到(969.897, 1043.03, 104.446,1)
		if 打开NPC("萨尔姆") then
			对话选项(1)
			延时(500)
			坐飞机到("葬影村")
			延时(1000)
		end
	end
	if 在飞机上() then
		while 在飞机上() do 
			延时(1000)
		end
	end
	if 在坐标范围(124.274, 1328.9, 190.471,100) then
		走到(124.274, 1328.9, 190.471)
		走到(89.8839, 1343.1, 175.432)
		走到(14.5523, 1391.62, 93.2659,1,0,20)
		使用技能("冰甲术")
		上马()
		路径寻路("石爪峰到玛拉顿")
	end
	if 地图名() == "凄凉之地" or 地图名()=="玛拉顿" then
		val = 检查挂机方案()
		if val >= 404 or val == 11 or val == 22 then
			return
		end
		if 阵营() == "联盟" then
			上马()
			路径寻路("凄凉之地到玛拉顿")
		else
			使用技能("冰甲术")
			上马()
			if 在坐标范围(-1766.01, 3263.64, 5.02557,100) and (地图名() == "凄凉之地" or 地图名()=="玛拉顿") then
				路径寻路("葬影村飞行点到玛拉顿")
			else
				if not 在坐标范围(-1197.9, 2881.79, 85.9948,100) then
					自动寻路(-1423.56, 2924.9, 136.33,10)
				end
				路径寻路("葬影村飞行点到玛拉顿")
			end
		end
	end
end
function 部落到死亡矿井()
	local map=地图名()
	if map == "奥格瑞玛" or map=="杜隆塔尔" then
		if 炉石可用() then
			炉石()
		end
	end
	map=地图名()
	if map == "奥格瑞玛" or map=="杜隆塔尔" then
		if not 在坐标范围(1359.73, -4637.89, 53.839,30) then
			自动寻路(1331.4, -4619.97, 23.6629)
		end
		路径走到("奥格飞艇下到飞荆棘谷点",1361.4, -4635.26, 53.8955)
		坐船()
	end
	执行脚本("部落买马.lua")
	map = 地图名()
	if map ~= "死亡矿井" and map ~= "西部荒野" and map~="荆棘谷" and map ~= "提瑞斯法林地" and map ~= "幽暗城" and map ~= "暮色森林" then
		炉石()
	end
	if 地图名() == "幽暗城" then
		x,y,z = 当前坐标()
		if z < 50 then
			路径走到("幽暗城法师传送到旅店电梯",1595.18, 176.086, -41.4176)
			坐船()
		end
		路径走到("布瑞尔旅店到幽暗电梯上",2044.74, 283.266, 58.8191)
		自动寻路(2063.6, 281.365, 60.0467)
	end
	if 小地图名()=="洛丹伦废墟" then
		路径走到("布瑞尔旅店到幽暗电梯上",2044.74, 283.266, 58.8191)
		自动寻路(2063.6, 281.365, 60.0467)
	end
	if 地图名() == "提瑞斯法林地" then
		路径走到("布瑞尔到荆棘谷飞艇",2057.79, 237.362, 99.7664)
		坐船()
	end
	if 在路径范围("荆棘谷到斯通纳德") then
		路径走到("荆棘谷到斯通纳德",-11081.9, -377.443, 44.5958)
	end
	if 地图名() == "暮色森林" then
		自动寻路(-10870, 697.882, 30.8914)
	end
	if 地图名() == "西部荒野" then
		自动寻路(-11074.4, 1527.02, 43.2465)
		下马()
		if zhenying == "部落" then
			潜行()
		end
	end
	if 在路径范围("西部荒野到死矿矿井") then
		while not 在坐标范围(-11207.9, 1674.84, 24.6172,20) do
			if zhenying == "部落" then
				潜行()
			end
			路径走到("西部荒野到死矿矿井",-11207.9, 1674.84, 24.6172)
			if HP() == 0 then
				释放灵魂()
			end
			if HP() == 1 then
				x,y,z = 尸体坐标()
				if not 在路径范围("西部荒野到死矿矿井") then
					自动寻路(-11074.4, 1527.02, 43.2465)
				end
				路径走到("西部荒野到死矿矿井",x,y,z)
				复活()
			end
		end
		朝向坐标(-11208, 1677.64, 24.4368)
		移动("前",5000)
		while 过图中() do 
			延时(1000)
		end
	end
end
function 血色到神庙()
	if 阵营() == "部落" then
		if 地图名() == "幽暗城" then
			x,y,z = 当前坐标()
			if z < 50 then
				路径走到("幽暗城法师传送到旅店电梯",1595.18, 176.086, -41.4176)
				坐船()
			end
			路径走到("布瑞尔旅店到幽暗电梯上",2024.18, 289.523, 50.534)
		end
		if 小地图名()=="洛丹伦废墟" then
			路径走到("布瑞尔旅店到幽暗电梯上",2024.18, 289.523, 50.534)
			自动寻路(2171.26, 237.787, 36.8481)
		end
		if 地图名() == "血色修道院" or 地图名() == "提瑞斯法林地" then
			x,y,z = 当前坐标()
			if x > 2300 or y<200 then
				local lmap=炉石位置()
				if lmap == "恐惧之末旅店" then
					使用物品("炉石")
					延时(15000)
					while 过图中() do 
						延时(1000)
					end
					延时(1000)
				else
					教堂出本()
					if 在坐标范围(2907.68, -816.294, 160.327,20) then
						while not 在坐标范围(2907.68, -816.294, 160.327,2) do
							走到(2911.85, -824.278, 160.327)
							走到(2909.81, -818.951, 160.327,1)
							if 打开身边目标() then
								延时(500)
								while 读条中() do 
									延时(100)
								end
							end
							走到(2907.68, -816.294, 160.327,1)
							if HP()==0 then
								释放灵魂()
								虚弱复活()
								路径走到("血色复活路径",2597.68, -571.337, 94.34)
							end
						end
					end
					while not 在坐标范围(2171.26, 237.787, 36.8481,10) do
						自动寻路(2171.26, 237.787, 36.8481)
						if HP() == 0 then
							释放灵魂()
						end
						if HP() == 1 then
							x,y,z = 尸体坐标()
							if x>2500 then
								虚弱复活()
								路径走到("血色复活路径",2597.68, -571.337, 94.34)
							else
								路径走到("血色复活路径",2597.68, -571.337, 94.34)
								路径走到("部落血色修理",x,y,z)
								复活()
							end
						end
					end
				end
			end
			if not 在坐标范围(2057.79, 237.362, 99.7664,100) then
				自动寻路(2171.26, 237.787, 36.8481)
			end
			路径走到("布瑞尔到荆棘谷飞艇",2057.79, 237.362, 99.7664)
			坐船()
		end
		if 地图名() ~= "阿塔哈卡神庙" and HP() > 1 then
			while 炉石位置() ~= "斯通纳德" do
				路径走到("荆棘谷到斯通纳德",-10486.1, -3258.97, 21.0299)
				if 打开NPC("旅店老板卡拉库尔") then
					对话选项(1)
					延时(1000)
					运行宏("/click StaticPopup1Button1")
					延时(1000)
				end
			end
			if 在坐标范围(-10484.8, -3257.87, 21.0301,40) then
				if zy == "法师" then
					if not 存在技能("传送：斯通纳德") then
						走到(-10459.7, -3262.21, 20.1792)
						走到(-10454.6, -3269.99, 20.8039)
						走到(-10456.8, -3279.35, 21.3567,1)
						打开NPC("布雷依克")
						走到(-10443.8, -3290.88, 20.1792)
						走到(-10451.6, -3306.54, 21.0088)
						走到(-10467.8, -3320.48, 20.9643,1)
						if 打开NPC("洛林·跃火") then
							对话选项(1)
							延时(1000)
							学习技能()
						end
						走到(-10451.6, -3306.54, 21.0088)
						走到(-10443.8, -3290.88, 20.1792)
						走到(-10445.1, -3274.93, 20.178,1)
					end
				end
			end
		end
		纵向角度(-0.01)
		if 地图名() == "悲伤沼泽" and HP() > 1 then
			使用技能("冰甲术")
			路径走到("斯通纳德修理",-10364, -3659.9, 23.4906)
		end
		上马()
		while not 在坐标范围(-10181.3, -3994.01, -109.368,10) do
			执行路径文件("守望堡到神庙",-10181.3, -3994.01, -109.368)
			if HP() > 1 then
				if 战斗中() then
					使用技能("寒冰屏障")
					延时(10000)
					while 战斗中() do 
						延时(1000)
					end
				end
				if HP() > 1 then
					break
				end
			end
			if HP() <= 1 then
				释放灵魂()
				执行路径文件("神庙复活",-10181.3, -3994.01, -109.368)
				复活()
			end
		end
	end
end
function 神庙进本()
	if not 在副本() then
		纵向角度(-0.01)
		if 阵营() == "联盟" then
			if 地图名() ~= "悲伤沼泽" and 地图名() ~= "阿塔哈卡神庙" then
				到守望堡()
				使用技能("冰甲术")
				延时(1500)
				上马()
			end
		else
			if 地图名() == "悲伤沼泽" then
				使用技能("冰甲术")
				路径走到("斯通纳德修理",-10364, -3659.9, 23.4906)
			end
		end
		while 在坐标范围(-10181.3, -3994.01, -109.368,30)==false and 在副本()==false do
			执行路径文件("守望堡到神庙",-10181.3, -3994.01, -109.368)
			if HP() == 0 then
				释放灵魂()
			end
			if HP()==1 then
				x,y,z = 尸体坐标()
				执行路径文件("神庙复活",x,y,z)
			end
		end
		if HP() > 1 then
			朝向坐标(-10168.72168,-3997.615234,-113.8582458)
			移动("前",5000)
			while 过图中() do 
				延时(1000)
			end
		end
	end
end
function 神庙出本()
	if 在副本() then
		路径走到("神庙门口到龙区",-313.358, 99.7301, -131.848)
		朝向坐标(-300.358, 99.7301, -131.848)
		移动("前",5000)
		while 过图中() do 
			延时(1000)
		end
		延时(1000)
	end
end
function 双门收尾(chu)
	while 战斗中() do 
		清除目标()
		使用技能("寒冰护体")
		延时(1500)
		if 坐标范围怪物数量(795.2208862,-522.6564941,-44.78491211,10) >0 then
			使用技能("暴风雪")
			指向坐标(795.2208862,-522.6564941,-44.78491211)
			延时(400)
			if 读条中() then 
				for i=1,8 do 
					延时(1000) 
					if 坐标范围怪物数量(795.2208862,-522.6564941,-44.78491211,10) ==0 then
						break
					end
				end
			end
		end
		if 坐标范围怪物数量(781.2410278,-520.9693604,-51.04761505,10) >0 then
			使用技能("暴风雪")
			指向坐标(781.2410278,-520.9693604,-50.04761505)
			延时(400)
			if 读条中() then 
				for i=1,8 do
					延时(1000) 
					if 坐标范围怪物数量(781.2410278,-520.9693604,-51.04761505,10) ==0 then
						break
					end
				end
			end
		end
		x,y,z = 当前坐标()
		if 坐标范围怪物数量(x,y,z,15) > 0 then
			使用技能("魔爆术")
			延时(1400)
		end
		if 战斗中() then
			if 小鬼剩余数量() >= 1 then
				清除目标()
				延时(3000)
				x,y,z = 目标坐标()
				if x~=0 then
					使用技能("暴风雪")
					指向坐标(x,y,z)
					延时(400)
					if 读条中() then 
						for i=1,8 do
							延时(1000) 
							if 小鬼剩余数量() ==0 then
								break
							end
						end
					end
				end
			end
		end
	end
	if HP() > 1 then
		if 在坐标范围(781.2410278,-520.9693604,-51.04761505,50) then
			if 队伍人数()>1 then
				运行宏("/p 打怪结束，请老板出副本等待重置")
			end
			if 小鬼剩余数量() == 0 then
				朝向坐标(781.2410278,-520.9693604,-51.04761505)
				移动("前",2700)
			end
		end
		扫地阶段3(chu)
	end
end
function MLD2(shiqu)
	if shiqu == nil then
		shiqu=1
	end
	if HP()==0 then
		释放灵魂()
	end
	邀请小号()
	MLD进本()
	if 地图名() == "玛拉顿" and 在副本() then
		if 需要修理() then
			回城售卖()
			MLD进本()
		end
		MLD跑路()
		邀请小号()
		瀑布拉怪()
		g_shiqu=0
		local fighttimes=0
		while 战斗中() and HP() > 0 do 
			sw=简单杀怪()
			if sw == 2 then
				break
			end
			fighttimes = fighttimes+1
			if fighttimes >10 then
				if MLD_坐标范围精英数量(795.2208862,-522.6564941,-44.78491211,40) == 0 then
					break
				end
			end
			if not 在坐标范围(781.498, -497.127, -42.7763,50) then
				break
			end
		end
		--[[if not 在坐标范围(781.498, -497.127, -42.7763,40) and HP() > 0 then
			传送处理()
		end--]]
		if not 在副本() then
			return
		end
		if shiqu == 1 then
			if HP() > 1 then
				if g_shiqu==1 then
					MLD收尾()
				else
					双门收尾()
				end
			else
				释放灵魂()
			end
		else
			if sw==1 or g_shiqu==1 then
				MLD收尾(1)
			else
				while 战斗中() do 
					上台子()
					清除目标()
					使用技能("寒冰护体")
					延时(1500)
					if 坐标范围怪物数量(795.2208862,-522.6564941,-44.78491211,10) >0 then
						使用技能("暴风雪")
						指向坐标(795.2208862,-522.6564941,-44.78491211)
						延时(400)
						if 读条中() then 
							for i=1,8 do 
								延时(1000) 
								if 坐标范围怪物数量(795.2208862,-522.6564941,-44.78491211,10) ==0 then
									break
								end
							end
						end
					end
					if 坐标范围怪物数量(781.2410278,-520.9693604,-51.04761505,10) >0 then
						使用技能("暴风雪")
						指向坐标(781.2410278,-520.9693604,-50.04761505)
						延时(400)
						if 读条中() then 
							for i=1,8 do
								延时(1000) 
								if 坐标范围怪物数量(781.2410278,-520.9693604,-51.04761505,10) ==0 then
									break
								end
							end
						end
					end
					x,y,z = 当前坐标()
					if 坐标范围怪物数量(x,y,z,8) > 0 then
						使用技能("魔爆术")
					end
					if 战斗中() then
						if 小鬼剩余数量() >= 1 then
							x,y,z = 目标坐标()
							if x~=0 then
								使用技能("暴风雪")
								指向坐标(x,y,z)
								延时(400)
								if 读条中() then 
									for i=1,8 do
										延时(1000) 
										if 小鬼剩余数量() ==0 then
											break
										end
									end
								end
							end
						end
					end
				end
				if HP() > 1 then
					if 队伍人数() > 1 then
						队伍拾取()
					end
					上台子()
					销毁物品("法力蓝宝石",1)
					销毁物品("法力红宝石",1)
					销毁物品("法力黄水晶",1)
					玛拉顿出本()
				end
			end
		end
	end
end
function 血色修理()
	if 需要修理() or 背包空格()<10 then
		local lmap=炉石位置()
		if lmap == "恐惧之末旅店" or lmap=="南海镇" then
			使用物品("炉石")
			延时(15000)
			while 过图中() do 
				延时(1000)
			end
			延时(1000)
		else
			教堂出本()
			走到(2911.85, -824.278, 160.327)
			走到(2909.81, -818.951, 160.327,1)
			if 打开身边目标() then
				延时(500)
				while 读条中() do 
					延时(100)
				end
			end
			走到(2907.68, -816.294, 160.327,1)
			if zhenying == "联盟" then
				while 炉石位置() ~= "南海镇" do
					路径走到("南海镇到血色",-855.53, -569.481, 11.0649)
					if HP() > 1 then
					打开NPC("旅店老板安德森")
					延时(1000)
					对话选项(1)
					延时(1000)
					运行宏("/click StaticPopup1Button1")
					延时(1000)
					else
						if HP() == 0 then
							释放灵魂()
						end
						x,y,z = 尸体坐标()
						自动寻路(x,y,z)
						复活()
					end
				end
			end
			
		end
		if zhenying == "联盟" then
			while not 在坐标范围(2907.68, -816.294, 160.327,30) do
				if 在坐标范围(-851.47, -545.129, 11.0545,120) then
					路径走到("南海镇到血色",-851.47, -545.129, 11.0545)
					发送邮件()
					自动寻路(-816.025, -573.763, 15.4053)
					打开NPC("罗伯特·埃比斯彻尔")
					延时(1000)
					出售垃圾()
					延时(1000)
					自动寻路(-796.697, -540.717, 16.4009)
				end
				map=地图名()
				if map=="希尔斯布莱德丘陵" or map=="银松森林" or map == "提瑞斯法林地" then
					if 炉石位置() == "南海镇" then
						路径走到("南海镇到血色",2907.68, -816.294, 160.327)
					end
				else
					路径走到("血色修理路径",949.777, -1434.65, 62.7751)
					打开NPC("莱纳德·波特")
					延时(1000)
					出售垃圾()
					延时(1000)
				end
				if 炉石位置() ~= "南海镇" then
					路径走到("血色修理路径",2907.68, -816.294, 160.327)
				end
				if HP() == 0 then
					释放灵魂()
				end
				if HP()==1 then
					x,y,z = 尸体坐标()
					自动寻路(x,y,z)
					复活()
				end
			end
		else
			路径走到("部落血色修理",2236.97, 254.255, 34.0693)
			发送邮件()
			路径走到("部落血色修理",2248.32, 307.393, 35.1899)
			打开NPC("伊莉莎·考伦")
			延时(500)
			for i=1,2 do 
				延时(1000)
				出售垃圾()
			end
			路径走到("部落血色修理",2907.68, -816.294, 160.327)
			
		end
		if 战斗中() then
			使用技能("寒冰护体")
			延时(1000)
			x,y,z = 目标坐标()
			朝向坐标(x,y,z)
			移动("后",100)
			while 战斗中() do 
				x,y,z = 目标坐标()
				朝向坐标(x,y,z)
				移动("后",200)
				延时(100)
				使用技能("寒冰箭")
				延时(300)
				while 读条中() do 
					延时(100)
				end
				延时(300)
			end
		end
		走到(2910.25, -816.517, 160.329,1,0,0.2)
		打开身边目标()
		延时(1000)
		走到(2908.21, -823.825, 160.329,1)
		if 打开身边目标()  then
			延时(500)
			while 读条中() do 
				延时(100)
			end
		end
		走到(2912.74, -825.01, 160.328,1)
	end
end
function 血色部落初始化()
	if 阵营()=="部落" then
		if 等级() >= 60 then
			血色修理()
		end
		while not 在副本() and not 在坐标范围(2912.74, -825.01, 160.328,6) do
			路径走到("部落血色修理",2907.68, -816.294, 160.327)
			走到(2910.25, -816.517, 160.329,1,0,0.2)
			打开身边目标()
			延时(1000)
			走到(2908.21, -823.825, 160.329,1)
			走到(2912.74, -825.01, 160.328,1)
			if HP() == 0 then
				释放灵魂()
				延时(1000)
			end
			if HP() == 1 then
				x,y,z = 尸体坐标()
				路径走到("血色复活路径",x,y,z,25)
				复活()
				延时(200)
				if not 在坐标范围(2912.74, -825.01, 160.328,6) then
					路径走到("部落血色修理",2907.68, -816.294, 160.327)
					走到(2910.25, -816.517, 160.329,1,0,0.2)
					打开身边目标()
					延时(1000)
					走到(2908.21, -823.825, 160.329,1)
					走到(2912.74, -825.01, 160.328,1)
				end
			end
		end
	else
		if 炉石位置() ~= "南海镇" then
			教堂出本()
			走到(2911.85, -824.278, 160.327)
			走到(2909.81, -818.951, 160.327,1)
			if 打开身边目标() then
				延时(500)
				while 读条中() do 
					延时(100)
				end
			end
			走到(2907.68, -816.294, 160.327,1)
			if zhenying == "联盟" then
				while 炉石位置() ~= "南海镇" do
					路径走到("南海镇到血色",-855.53, -569.481, 11.0649)
					if HP() > 1 then
					打开NPC("旅店老板安德森")
					延时(1000)
					对话选项(1)
					延时(1000)
					运行宏("/click StaticPopup1Button1")
					延时(1000)
					else
						if HP() == 0 then
							释放灵魂()
						end
						x,y,z = 尸体坐标()
						自动寻路(x,y,z)
						复活()
					end
				end
			end
		end
	end
end
function 血色教堂(shiqu)
	if shiqu==nil then
		shiqu=0
	end
	策略检查()
	邀请小号()
	延时(3000)
	if HP() <= 1 then
		延时(1000)
		释放灵魂()
		路径寻路("血色复活路径")
		复活()
		延时(1000)
		if HP() == 1 then
			教堂进本()
			使用技能("奥术智慧")
			延时(1500)
			使用技能("冰甲术")
			延时(1500)
			回满()
		end
	end
	血色修理()
	if shiqu==0 then
		while 队伍人数()<=1 do 
			提示("等待小号进组")
			延时(1000)
			邀请小号()
			策略检查()
		end
	end
	队伍拾取()
	if not 在副本() then
		if 需要重置 == 1 then
			重置副本()
			需要重置=0
			if 已重置次数 ~= nil then
				已重置次数=已重置次数+1
				置重置次数(已重置次数)
			end
		end
		血色修理()
		教堂进本()
		回满()
	end
	if 在副本() then
		血色进门处理()
		if shiqu ~= 0 then
			摸尸体(40)
		end
		while HP()>1 do
			血色拉怪1()
			if shiqu ~= 0 then
				摸尸体(40)
			end
			if HP() <= 1 then
				延时(1000)
				释放灵魂()
				路径寻路("血色复活路径")
				复活()
				延时(1000)
				if HP() == 1 then
					教堂进本()
					使用技能("奥术智慧")
					延时(1500)
					使用技能("冰甲术")
					延时(1500)
					回满()
				end
			else
				break
			end
		end
		血色拉怪2()
		if shiqu ~= 0 then
			摸尸体(40)
		end
		路径走到("血色出副本",898.391, 1402.14, 18.0232)
		闪现走到(873.871, 1397.59, 18.0062)
		路径寻路("血色出副本")
		--[[mincaiyao,maxcaiyao = 专业信息("草药学")
		if mincaiyao > 120 then
			教堂出本()
			while true do
				走到(2911.85, -824.278, 160.327)
				走到(2909.81, -818.951, 160.327,1,0,0.3)
				if 打开身边目标() then
					延时(500)
					while 读条中() do 
						延时(100)
					end
				end
				走到(2905.48, -808.791, 160.333,1)
				if 在坐标范围(2905.48, -808.791, 160.333,3) then
					break
				end
			end
			XS2进本()
			XS2()
			XS3进本()
			XS3()
			XS1进本()
			XS1()
			教堂进本()
		end--]]
		回复状态()
		血色修理()
		教堂出本()
		if HP() > 1 then
			等待重置时间()
		end
		需要重置=1
	end
end
function 到龙区()
	使用技能("奥术智慧")
	延时(1500)
	使用技能("冰甲术")
	延时(1500)
	x,y,z = 当前坐标()
	if z > -94 and x < -295 then
		return
	end
	路径走到("神庙门口到龙区",-294.944, 52.3876, -91.0234,1)
	回满()
	if 背包物品数量("法力红宝石") < 1 then
		使用技能("制造魔法红宝石")
		延时(3500)
	end
	if 背包物品数量("法力黄水晶") < 1 then
		使用技能("制造魔法黄水晶")
		延时(3500)
	end
	if 背包物品数量("法力翡翠") < 1 then
		使用技能("制造魔法翡翠")
		延时(3500)
	end
	if 队伍人数() > 1 then
		自由拾取()
	end
end
function 台阶1(tt)
	if HP() <= 1 then
		return
	end
	if MP() < 3000 then
		运行宏("/use 强效法力药水/n/use 法力红宝石/n/use 法力黄水晶")
	end
	走到(-297, 97.3042, -91.4669,1)
	for fi=1,30 do 
		if MLD_坐标范围精英数量(-297, 97.3042, -91.4669,30,1)>0 then
			break
		end
		延时(100)
	end
	走到(-296, 101.418, -90.6758)
	延时(100)
	寻路结束()
	x,y,z = 当前坐标()
	朝向坐标(x,y+20,z)
	按键("w",1)
	while z<-88.58 and HP() > 1 do 
		跳()
		延时(600)
		x,y,z = 当前坐标()
	end
	跳()
	延时(500)
	按键("w",2)
	使用技能("寒冰护体")
	走到(-305.896, 101.783, -88.5712,1)
	移动("右",300)
	while 坐标范围怪物数量(-287.643, 64.9052, -88.5715,10) == 0 and HP() > 1 do 
		延时(100)
	end
	local nhb=0
	if not 存在BUFF("寒冰护体") then
		nhb=1
	end
	if MP()<300 then
		使用技能("唤醒")
		延时(1000)
		for i=1,60 do 
			if not 读条中() or 坐标范围怪物数量(-305.896, 101.783, -88.5712,15)>0 then
				break
			end
			延时(100)
		end
		while 坐标范围怪物数量(-308.381, 101.782, -88.5713,35) == 0 and HP() > 1 do 
			延时(100)
			if not 战斗中() then
				break
			end
		end
	else
		if nhb==0 then
			if tt>=4 and MP()>2000 or 存在BUFF("节能施法") then
				使用技能("暴风雪")
			else
				使用技能("暴风雪(等级 1)")
			end
			指向坐标(-287.775116,70.75535583,-89.159729)
			xx=os.clock()
			延时(1500)
			for i=1,65 do 
				延时(100)
				if os.clock() - xx > 7.9 or not 读条中() then
					break
				end
			end
		end
		if MP() < 2000 then
			运行宏("/use 法力红宝石/n/use 法力黄水晶/n/use 法力翡翠/n/use 强效法力药水")
		end
		使用技能("寒冰护体")
		走到(-308.381, 101.782, -88.5713,1)
		if tt<4 or not 存在BUFF("寒冰护体") then
			while 坐标范围怪物数量(-308.381, 101.782, -88.5713,35) == 0 and HP() > 1 do 
				延时(100)
				if not 战斗中() then
					break
				end
			end
		end
	end
end
function 台阶下(tt)
	if HP() <= 1 or not 存在BUFF("寒冰护体") then
		return
	end
	if MP() < 2000 then
		运行宏("/use 强效法力药水/n/use 法力红宝石/n/use 法力黄水晶")
	end
	--走到(-303.816, 94.6742, -91.4685)
	走到(-301.486, 95.5677, -91.4685,1)
	if MP() >1200 or 存在BUFF("节能施法") then
		使用技能("暴风雪")
	else
		使用技能("暴风雪(等级 1)")
	end
	if tt < 7 or MLD_坐标范围精英数量(-293.857, 63.7779, -91.467,40,5) <= 5 then
		指向坐标(-287.775116,70.75535583,-89.159729)
	else
		指向坐标(-285.4387512,70.77433777,-88.56976318)
	end
	xx=os.clock()
	延时(1500)
	for i=1,65 do 
		延时(100)
		if os.clock() - xx > 7.8 or not 读条中() or MLD_坐标范围精英数量(-297.452, 88.2125, -91.4671,9,1)>0 then
			break
		end
	end
end
function 台阶2()
	if HP() <= 1 then
		return
	end
	走到(-303.548, 91.6683, -91.4675,1)
	x,y,z = 当前坐标()
	朝向坐标(x,y-10,z)
	移动("前",100)
	x,y,z = 当前坐标()
	while z<-88.57 and HP() > 1 do 
		跳()
		延时(300)
		按键("w",1)
		延时(300)
		按键("w",2)
		延时(100)
		x,y,z = 当前坐标()
	end
	走到(-308.172, 89.8372, -88.5723,1)
	跳()
	延时(500)
	走到(-301.826, 89.842, -88.5767,1)
	使用技能("寒冰护体")
	跳()
	while 坐标范围怪物数量(-307.72, 80.1347, -88.5715,11) == 0 and HP() > 1 do 
		延时(100)
		if not 战斗中() then
			break
		end
	end
end
function 神庙到拉怪点()
	if 在坐标范围(-294.944, 52.3876, -91.0234,10) then
		使用技能("寒冰护体")
		延时(1400)
		回满()
		走到(-297, 44.9589, -90.8398,1)
		走到(-300.325, 46.6583, -89.9823)
		延时(500)
		走到(-300.165, 52.6037, -88.6104,1,1)
		if 范围选怪(-292.7575989,68.87026215,-91.4670105,15) ~= 0 then
			使用技能("火球术(等级 1)")
			延时(500)
			while 读条中() do 
				延时(100)
			end
		else
			使用技能("暴风雪(等级 1)")
			指向坐标(-292.7575989,68.87026215,-91.4670105)
			延时(2000)
		end
		移动("左",1000)
		移动("前",1000)
		延时(4000)
		移动("右",1200)
		--[[走到(-296.775, 67.1101, -91.4662,0,0,4)--]]
		朝向坐标(-297.452, 93.2125, -91.4671)
		按键("w",1)
		使用技能("冰霜新星(等级 1)")
		延时(1500)
		--使用技能("闪现术")
		闪现走到(-297.452, 93.2125, -91.4671)
		走到(-354.618, 92.7463, -90.9192)
		使用技能("法力护盾")
		走到(-382.268, 88.0801, -90.8664)
		走到(-398.28, 79.1811, -90.9101)
		走到(-419.352, 83.2607, -91.4705)
		使用技能("冰霜新星(等级 1)")
		走到(-441.094, 96.5046, -92.9377,0,1)
		使用技能("冰霜新星(等级 1)")
		走到(-467.867, 102.811, -94.8743)
		使用技能("寒冰护体")
		走到(-486.388, 88.5335, -93.6055)
		闪现走到(-530.885, 65.4575, -90.8641,1,0.3)
		写入朝向(3.63297)
		按键("w")
		x,y,z = 当前坐标()
		while z<-88.09 and HP()>1 do 
			跳()
			延时(300)
			按键("w",1)
			延时(150)
			按键("w",2)
			延时(500)
			x,y,z = 当前坐标()
		end
		--走到(-538.678, 76.2335, -88.0223,1)
		--[[运行宏("/run SetCVar('autoInteract',1)")
		延时(500)
		朝向坐标(-538.916, 79.9516, -87.9875)
		按键("w")
		延时(200)--]]
--		右键寻路(-538.916, 79.9516, -87.9875)
		--[[走到(-538.916, 79.9516, -87.9875,1,0,0.4)
		延时(1500)
		按键("w")
		延时(200)
		朝向坐标(-547.051, 79.3153, -88.3627)
		按键("w")
		延时(200)
		右键寻路(-547.051, 79.3153, -88.3627)
		延时(1800)
		按键("w")
		延时(200)
		走到(-546.399, 75.439, -88.2723,1,0,0.2)
		走到(-581.996, 75.0513, -88.2439,1,0,0.2)
		
		朝向坐标(-582.668, 80.5644, -88.2596)
		按键("w")
		延时(200)
		右键寻路(-582.668, 80.5644, -88.2596)
		延时(1500)
		按键("w")
		延时(200)
		朝向坐标(-590.073, 79.0696, -88.26)
		按键("w")
		延时(200)
		右键寻路(-590.073, 79.0696, -88.26)
		延时(1500)
		按键("w")
		延时(200)
		朝向坐标(-589.536, 75.0484, -86.6129)
		按键("w")
		延时(200)
		右键寻路(-589.536, 75.0484, -86.6129)
		延时(1500)
		按键("w")
		延时(200)
		走到(-590.073, 75.2182, -88.245,1,0,0.25)
		运行宏("/run SetCVar('autoInteract',0)")
		朝向坐标(-589.346, 74.8506, -86.5308)
		x,y,z = 当前坐标()
		while z<-86.54 and HP() > 1 do 
			跳()
			延时(300)
			按键("w",1)
			延时(250)
			按键("w",2)
			延时(300)
			x,y,z = 当前坐标()
		end
		走到(-625.701, 75.0428, -86.5189,0,0,4)
		延时(1000)
		寻路结束()--]]
		走到(-538.678, 76.2335, -88.0223,1,0,0.4)
		走到(-538.786, 79.3754, -87.9949,1,0,0.4)
		延时(300)
		走到(-540.24, 80.1083, -87.9814,1,0,0.3)
		延时(300)
		走到(-546.255, 79.8815, -87.9673,1,0,0.5)
		延时(300)
		走到(-546.399, 75.439, -88.2723,1,0,0.5)
		延时(300)
		走到(-581.996, 75.0513, -88.2439,1,0,0.3)
		延时(300)
		走到(-581.991, 79.2314, -88.2598,1,0,0.3)
		延时(300)
		走到(-583.991, 79.9989, -88.2598,1,0,0.3)
		延时(300)
		走到(-589.741, 79.3849, -88.26,1,0,0.5)
		延时(300)
		走到(-590.073, 75.2182, -88.245,1,0,0.3)
		延时(300)
		朝向坐标(-589.346, 74.8506, -86.5308)
		x,y,z = 当前坐标()
		while z<-86.54 and HP() > 1 do 
			跳()
			延时(300)
			按键("w",1)
			延时(250)
			按键("w",2)
			延时(300)
			x,y,z = 当前坐标()
		end
		延时(300)
		走到(-625.701, 75.0428, -86.5189,0,0,3)
		延时(1000)
		寻路结束()
		使用技能("寒冰护体")
		t=0
		while 战斗中() do 
			延时(1000)
			t=t+1
			if t>50 then
				break
			end
		end
		使用技能("寒冰护体")
		延时(1500)
		回满()
		if 战斗中() or HP()<2000 then
			运行宏("/use 特效治疗药水/n/use 优质治疗药水")
		end 
		if 队伍人数() > 1 then
			自由拾取()
		end
	end
end
function 绿龙拉怪()
	if 在坐标范围(-661.951, -47.104, -90.8358,10) or 在坐标范围(-687.727, 41.792, -88.2318,10) then
		if 坐标范围怪物数量(-661.951, -47.104, -90.8358,20) < 2 and not 战斗中() then
			走到(-657.358, -6.12007, -90.8358)
			走到(-638.056, 76.4127, -90.8369)
			走到(-635.887,80.9769,-90.8369)
			走到(-625.264, 85.5704, -90.6354,1)
			
		end
	end
	if 在坐标范围(-625.701, 75.0428, -86.5189,20) then
		if 范围选怪(-613.4536133,93.31842041,-90.88220978,25) ~= 0 then
			使用技能("寒冰护体")
			延时(1500)
			while 坐标范围怪物数量(-641.719,103.702,-90.8314,10,"",1) == 0 and HP()>1 and not 战斗中() do 
				延时(500)
			end
			while HP()>1 do
				x,y,z = 目标坐标()
				朝向坐标(x,y,z)
				延时(200)
				使用技能("寒冰箭(等级 1)")
				延时(500)
				while 读条中() do 
					延时(100)
				end
				延时(100)
				走到(-625.902, 85.1411, -90.8817,1,0,0.3)
				使用技能("法术反制")
				if 战斗中() then
					break
				end
			end
			走到(-635.887,80.9769,-90.8369)
			走到(-638.056, 76.4127, -90.8369)
			闪现走到(-657.358, -6.12007, -90.8358)
			走到(-661.951, -47.104, -90.8358,1)
			朝向坐标(-657.358, -6.12007, -90.8358)
			使用技能("寒冰护体")
			延时(1500)
			if 战斗中() then
				while 坐标范围怪物数量(-661.951, -47.104, -90.8358,17,"",1) < 2 and HP() > 1 do 
					延时(200)
				end
				延时(1000)
				使用技能("冰锥术(等级 1)")
				走到(-667.422, -32.9104, -90.8358,0,0,5)
				使用技能("冰霜新星(等级 1)")
				走到(-677.287, -13.3199, -90.8358)
				闪现走到(-678.968, 26.3638, -88.2317)
				走到(-678.833, 42.4643, -88.2318,1,1,0.2)
				走到(-687.727, 41.792, -88.2318,1)
				使用技能("魔法抑制")
				while 战斗中() do 
					延时(500)
				end
				ks=os.clock()
				回满()
				if 队伍人数() > 1 then
					自由拾取()
				end
				while os.clock() - ks < 41 and HP() > 1 do 
					延时(1000)
				end
				使用技能("寒冰护体")
				hb=os.clock()
				延时(6500)
				if 队伍人数() > 1 then
					自由拾取()
				end
				走到(-678.508, 42.2227, -88.2324,1,0,0.4)
				走到(-678.746, 32.1268, -88.2319)
				走到(-679.257, -2.04734, -90.8351,1,1)
				使用技能("暴风雪(等级 1)")
				指向坐标(-660.5545654,-28.33242035,-90.83513641)
				延时(1500)
				走到(-678.832, 26.1094, -88.2316)
				走到(-678.721, 42.5037, -88.2317,0,1)
				使用技能("法力护盾")
				走到(-673.385, 51.7466, -90.8355)
				闪现走到(-633.474, 83.1817, -90.8541)
				bh=0
				if 坐标范围怪物数量(-633.474, 83.1817, -90.8541,12) > 3 then
					朝向坐标(-603.188, 88.5937, -90.8862)
					跳()
					延时(100)
					朝向坐标(-673.385, 51.7466, -90.8355)
					使用技能("冰锥术(等级 1)")
					朝向坐标(-603.188, 88.5937, -90.8862)
				end
				走到(-603.188, 88.5937, -90.8862)
				朝向坐标(-522.9188232,86.96120453,-91.25211334)
				while 在坐标范围(-522.9188232,86.96120453,-91.25211334,20)==false and HP()>1 do 
					延时(300)
					x,y,z = 当前坐标()
					if 坐标范围怪物数量(x,y,z,12) > 1 then
						if os.clock() - bh > 11 then
							使用技能("冰锥术(等级 1)")
							bh=os.clock()
							按键("Q",1)
							延时(600)
							按键("Q",2)
							朝向坐标(-522.9188232,86.96120453,-91.25211334)
						end
					end
					if os.clock()-hb>=30 and not 存在BUFF("寒冰护体") then
						使用技能("寒冰护体")
						hb=os.clock()
					end
				end
				使用技能("寒冰护体")
				走到(-496.571, 86.3409, -92.4635)
				闪现走到(-414.882, 89.3134, -91.3518)
				走到(-385.955, 90.3659, -90.875,1)
				使用技能("暴风雪(等级 1)")
				指向坐标(-419.928772,88.39931488,-91.4858551)
				延时(1500)
				for i=1,60 do 
					延时(100)
					if 坐标范围怪物数量(-385.955, 90.3659, -90.875,12)>0 then
						break
					end
				end
				闪现走到(-345.182, 92.7359, -90.9284,1)
				x,y,z = 当前坐标()
				朝向坐标(x, y-5, z)
				移动("前",500)
				x,y,z = 当前坐标()
				while z < -88.02 and HP()>1 do
					跳()
					延时(300)
					按键("w",1)
					延时(200)
					按键("w",2)
					延时(200)
					x,y,z = 当前坐标()
				end
				按键("w",1)
				跳()
				延时(200)
				按键("w",2)
				走到(-336.035, 89.8327, -88.0187,1)
				while 坐标范围怪物数量(-343.821, 93.2146, -90.9286,12) < 2 and HP()>1 do 
					延时(100)
				end
				延时(800)
				if HP() <= 1 then
					return
				end
				使用技能("寒冰屏障")
				延时(11000)
				使用技能("法师护甲")
				延时(1500)
				使用技能("寒冰护体")
				延时(1500)
				if not 存在BUFF("防护自然") then
					使用物品("自然防护药水")
				end
				if HP() < 1800 then
					运行宏("/use 特效治疗药水/n/use 优质治疗药水")
				end
				if MP()<3000 then
					使用技能("唤醒")
				else
					使用物品("法力黄水晶")
				end
				延时(15000)
				走到(-335.519, 96.0815, -90.9286)
				走到(-299.996, 96.3964, -91.4685)
				延时(400)
				寻路结束()
			end
		end	
	end
end
function 神庙收尾(shiqu)
	if shiqu == nil then
		shiqu=0
	end
	if HP() <= 1 then
		return
	end
	走到(-297.018, 91.9446, -91.467)
	if shiqu == 0 then
		走到(-290.595, 60.733, -91.4671,1,0,0.2)
	else
		走到(-284.987, 74.5892, -91.467)
		走到(-279.207, 71.0365, -90.676,1)
		合并拾取(7)
		合并拾取(7)
		走到(-282.171, 71.0119, -90.676,1)
		合并拾取(5)
		合并拾取(5)
		走到(-284.834, 71.9913, -90.676,1)
		合并拾取(5)
		合并拾取(5)
		走到(-288.722, 71.9022, -90.6774,1,0,0.4)
		合并拾取(5)
		合并拾取(5)
		走到(-288.713, 67.4792, -90.695,1,0,0.4)
		合并拾取(5)
		合并拾取(5)
		走到(-288.787, 63.3061, -90.7177,1,0,0.4)
		合并拾取(5)
		合并拾取(5)
		走到(-288.735, 60.6996, -90.7315,1,0,0.4)
		合并拾取(5)
		合并拾取(5)
		摸尸体(30)
		销毁低价物品()
		--清理低价物品(2000)
		if bopi==1 then
			走到(-288.237, 71.7221, -91.0422,1,0,0.3)
			走到(-280.237, 71.3221, -91.0422,1,0,0.3)
			剥皮(7)
			走到(-289.237, 71.7221, -91.0422,1,0,0.3)
			走到(-288.9, 65.3061, -91.2458,1,0,0.3)
			剥皮(8)
			剥皮(10)
		end
	end
	if 队伍人数() > 1 then
		自由拾取()
	end
	if HP()>1 and (smbuchu == nil or smbuchu==0) then
		路径走到("神庙门口到龙区",-313.358, 99.7301, -131.848)
		朝向坐标(-300.358, 99.7301, -131.848)
		移动("前",5000)
		while 过图中() do 
			延时(1000)
		end
		延时(1000)
	end
	if HP() > 1 then
		需要重置=1
	end
end
function 最后一个()
	if MLD_坐标范围精英数量(-293.857, 63.7779, -91.467,40,5) == 1 then
		走到(-296.078, 92.2833, -91.467,1)
		while 战斗中() do
			x,y,z = 目标坐标()
			if x~=0 then
				朝向坐标(x,y,z)
				for ii=1,10 do
					使用技能("寒冰箭")
					延时(300)
					if 读条中() then
						break
					end
				end
				while 读条中() do 
					延时(100)
				end
			else
				break
			end
		end
		return true
	end
	return false
end
function 到守望堡()
	if HP() <= 1 then
		return
	end
	local map=地图名()
	if 阵营() == "联盟" then
		if map ~= "悲伤沼泽" and map~="诅咒之地" and map~="阿塔哈卡神庙" then
			if map~="暮色森林" then
				使用物品("炉石")
				延时(15000)
				while 过图中() do 
					延时(1000)
				end
			end
			if 地图名() == "暮色森林" then
				路径走到("夜色镇到飞行点",-10515.5, -1260.05, 41.3642,1)
				打开NPC("菲利希亚·玛林")
				if 坐飞机到("诅咒之地") then
					while 在飞机上() do 
						延时(1000)
					end
					延时(1000)
					跳()
					延时(1000)
				else
					路径走到("夜色镇到守望堡飞行点",-11112.3, -3436.98, 79.0882,1)
					打开NPC("亚莉珊德拉·康斯坦丁")
				end
			end
		end
	end
end
function 暴风到神庙()
	local map = 地图名()
	local feiji=0
	if map=="暴风城" then
		自动寻路(-8837.28, 488.947, 109.612)
		打开NPC("杜加尔·朗德瑞克")
		延时(1500)
		if 坐飞机到("夜色镇") then
			feiji=1
			while 在飞机上() do 
				延时(1000)
			end
		end
	end
	map = 地图名()
	if map == "暴风城" or map == "艾尔文森林" then
		路径走到("暴风城飞行点到夜色镇",-10553.5, -1189.06, 27.9927)
	end
	if 地图名() == "暮色森林" then
		if feiji==0 then
			路径走到("夜色镇到神庙",-10515.5, -1260.05, 41.3642,1)
			打开NPC("菲利希亚·玛林")
			延时(500)
		end
		路径走到("夜色镇到神庙",-10434.8, -2409.93, 67.3647)
	end
	if 地图名() == "逆风小径" then
		路径走到("夜色镇到神庙",-10434.8, -2409.93, 67.3647)
	end
	if 地图名() == "悲伤沼泽" then
		while not 在坐标范围(-10385.4, -3679.25, 18.7704,20) do
			if zy=="潜行者" then
				if not 存在BUFF("潜行") then
					使用技能("潜行")
				end
			end
			路径走到("夜色镇到神庙",-10385.4, -3679.25, 18.7704)
			if HP()==0 then
				释放灵魂()
			end
			if HP()==1 then
				x,y,z = 尸体坐标()
				自动寻路(x,y,z)
				复活()
			end
		end
	end
	map = 地图名()
	if map=="悲伤沼泽" or map=="阿塔哈卡神庙" then
		if zy=="法师" then
			下马()
			使用技能("冰甲术")
		end
		纵向角度(-0.01)
		while not 在坐标范围(-10181.3, -3994.01, -109.368,10) and not 在副本() do
			执行路径文件("守望堡到神庙",-10181.3, -3994.01, -109.368)
			if HP() > 1 then
				if zy=="法师" and 等级() < 60 and 战斗中() then
					使用技能("寒冰屏障")
					延时(10000)
					while 战斗中() do 
						延时(1000)
					end
				end
				if HP() > 1 then
					break
				end
			end
			if HP() <= 1 then
				释放灵魂()
				执行路径文件("神庙复活",-10181.3, -3994.01, -109.368)
				复活()
			end
		end
	end
end
function 到神庙门口()
	if not 在副本() then
		纵向角度(-0.01)
		if 阵营() == "联盟" then
			--到守望堡()
			使用技能("冰甲术")
			延时(1500)
			上马()
		else
			if 小地图名() == "斯通纳德" then
				使用技能("冰甲术")
				路径走到("斯通纳德修理",-10463.3, -3263.75, 20.4762,1)
				发送邮件()
				路径走到("斯通纳德修理",-10409.8, -3266.52, 20.2264,1)
				if 打开NPC("卡尔拉什") then
					延时(1000)
					for i=1,3 do 
						延时(1000)
						出售垃圾()
					end
				end
				路径走到("斯通纳德修理",-10364, -3659.9, 23.4906)
			end
		end
		if not 在坐标范围(-10181.3, -3994.01, -109.368,20) then
			上马()
			map=地图名()
			if map == "诅咒之地" then
				执行路径文件("守望堡到神庙",-10181.3, -3994.01, -109.368)
			elseif map == "暮色森林" or map == "悲伤沼泽" or map=="逆风小径" then
				路径走到("夜色镇到神庙",-10385.4, -3679.25, 18.7704)
			end
			执行路径文件("守望堡到神庙",-10181.3, -3994.01, -109.368)
		end
		if 需要重置==1 then
			重置副本()
			需要重置=0
			if 已重置次数 ~= nil then
				已重置次数=已重置次数+1
				置重置次数(已重置次数)
			end
		end
		if HP() > 1 then
			while HP() > 1 and not 在副本() do
				朝向坐标(-10168.72168,-3997.615234,-113.8582458)
				移动("前",5000)
				while 过图中() do 
					延时(1000)
				end
				延时(1000)
				if not 在副本() then
					走到(-10181.3, -3994.01, -109.368,1)
					val = 检查挂机方案()
					if val == 11 or val == 22 then
						return
					end
					延时(30000)
					if 等级() < 60 and 队伍人数() > 1 and not 是否队长() then
						break
					end
				end
			end
		end
	end
end
function 神庙复活()
	local fb=0
	if HP() <= 1 then
		if HP() == 0 then
			if 在副本() then
				fb=1
			end
			释放灵魂()
		end
		if fb==0 then
			x,y,z = 尸体坐标()
			if x~=0 then
				if z < -112 then
					执行路径文件("神庙复活",-10181.3, -3994.01, -109.368)
				else
					执行路径文件("神庙复活",x,y,z)
				end
				复活()
				使用技能("冰甲术")
				延时(1500)
				使用技能("寒冰护体")
				延时(1500)
			end
		end
		执行路径文件("神庙复活",-10181.3, -3994.01, -109.368)
		if 需要重置==1 then
			重置副本()
			需要重置=0
			if 已重置次数 ~= nil then
				已重置次数=已重置次数+1
				置重置次数(已重置次数)
			end
		end
		朝向坐标(-10168.72168,-3997.615234,-113.8582458)
		移动("前",5000)
		while 过图中() do 
			延时(1000)
		end
		延时(1000)
	end
end
function 回城处理()
	if HP() <= 1 then
		return
	end
	if 需要修理() or 背包空格() <= maxfree then
		local lmap=炉石位置()
		if 阵营() == "联盟" or lmap=="夜色镇" then
			if lscheck == 1 then
				while lmap ~= "夜色镇" do 
					提示("炉石需要绑定夜色镇")
					延时(10000)
					lmap=炉石位置()
				end
				if lmap == "夜色镇" then
					local ci=0
					while 小地图名()~="血鸦旅店" and 地图名() ~= "暮色森林" do
						使用物品("炉石")
						延时(15000)
						while 过图中() do 
							延时(1000)
						end
						跳()
					end
				end
			end
			if 在坐标范围(-10547.4, -1157.14, 27.8935,200) then
				路径走到("夜色镇到卡拉赞",-10549.7, -1157.31, 27.7778)
				走到(-10544.7, -1148.9, 26.924)
				走到(-10519.2, -1142.39, 26.9257,1)
				打开NPC("艾瓦特·菲尔伍德")
				for i=1,4 do
					延时(1000)
					出售垃圾()
				end
				走到(-10549.9, -1149.15, 26.8436)
				走到(-10547.4, -1157.14, 27.8935,1)
				发送邮件()
				上马()
			end
		else
			if lscheck == 1 then
				while lmap ~= "斯通纳德" do 
					提示("炉石需要绑定斯通纳德")
					延时(10000)
					lmap=炉石位置()
					val = 检查挂机方案()
					if val == 11 or val == 22 then
						return
					end
				end
				if lmap == "斯通纳德" then
					local ci=0
					while 小地图名()~="斯通纳德" do
						使用物品("炉石")
						延时(15000)
						while 过图中() do 
							延时(1000)
						end
						跳()
					end
				end
			end
			if 地图名() == "悲伤沼泽" then
				路径走到("斯通纳德修理",-10463.3, -3263.75, 20.4762,1)
				发送邮件()
				路径走到("斯通纳德修理",-10409.8, -3266.52, 20.2264,1)
				if 打开NPC("卡尔拉什") then
					延时(1000)
					for i=1,3 do 
						延时(1000)
						出售垃圾()
					end
				end
				路径走到("斯通纳德修理",-10364, -3659.9, 23.4906)
			end
		end
	end
end
function 神庙_绿龙(shiqu)
	minp,maxp=专业信息("剥皮")
	if minp >= 250 and 背包物品数量("剥皮小刀")>0 then
		bopi=1
	else
		bopi=0
	end
	if shiqu==nil then
		shiqu=1
	end
	if HP()==0 then
		释放灵魂()
	end
	策略检查()
	邀请小号()
	神庙复活()
	回城处理()
	到神庙门口()
	if HP()>0 and 在副本() then
		回城处理()
	end
	if 在副本() then
		blvl = 等级()
		if 队伍人数() > 1 then
			自由拾取()
		end
		到龙区()
		if 在坐标范围(-661.951, -47.104, -90.8358,10) or 在坐标范围(-687.727, 41.792, -88.2318,10) then
			if 坐标范围怪物数量(-661.951, -47.104, -90.8358,20) < 2 and not 战斗中() then
				走到(-657.358, -6.12007, -90.8358)
				走到(-638.056, 76.4127, -90.8369)
				走到(-635.887,80.9769,-90.8369)
				走到(-625.264, 85.5704, -90.6354,1)
			end
		end
		if 在坐标范围(-661.951, -47.104, -90.8358,10) or 在坐标范围(-687.727, 41.792, -88.2318,10) or 坐标范围怪物数量(-292.7575989,68.87026215,-91.4670105,25,"",1) > 0 then
			神庙到拉怪点()
			绿龙拉怪()
			local ci=1
			local fh=0
			if fh==0 and not 存在BUFF("防护自然") then
				使用物品("自然防护药水")
				if 存在BUFF("防护自然") then
					fh=1
				end
			end
			while (战斗中() or MLD_坐标范围精英数量(-293.857, 63.7779, -91.467,60,5)>0) and HP() > 1 do 
				if HP() < 1500 then
					运行宏("/use 特效治疗药水/n/use 优质治疗药水")
				end
				台阶1(ci)
				if not 战斗中() and MLD_坐标范围精英数量(-293.857, 63.7779, -91.467,60,5)==0 then
					break
				end
				if 最后一个() then
					break
				end
				台阶下(ci)
				if fh==0 and not 存在BUFF("防护自然") then
					使用物品("自然防护药水")
					if 存在BUFF("防护自然") then
						fh=1
					end
				end
				if 最后一个() then
					break
				end
				if not 战斗中() and MLD_坐标范围精英数量(-293.857, 63.7779, -91.467,60,5)==0 then
					break
				end
				ci=ci+1
				if ci==5 then
					需要重置=1
				end
				台阶2()
				if fh==0 and not 存在BUFF("防护自然") then
					使用物品("自然防护药水")
					if 存在BUFF("防护自然") then
						fh=1
					end
				end
				if 最后一个() then
					break
				end
			end
		end
		if 在坐标范围(-293.857, 63.7779, -91.467,60) then
			神庙收尾(shiqu)
			if 背包物品数量("优质治疗药水") >10 then
				销毁物品("优质治疗药水",1)
			end
			if 背包物品数量("强效法力药水") >10 then
				销毁物品("强效法力药水",1)
			end
		end
		if 队伍人数() > 1 then
			队伍拾取()
			延时(3000)
		end
		if 等级() > blvl then
			法师天赋()
		end
	end
end

function 厄运回城()
	local lmap=炉石位置()
	if lmap ~= "羽月要塞" and lmap ~= "莫沙彻营地" then
		提示("炉石位置不在菲拉斯，请手动去绑定后启动")
		while lmap ~= "羽月要塞" and lmap ~= "莫沙彻营地" do 
			延时(10000)
			lmap=炉石位置()
			按键("space")
		end
		提示("炉石已绑定："..lmap)
	end
	while 小地图名() ~= lmap do
		提示("炉石回城")
		使用物品("炉石")
		延时(12000)
		for i=1,60,1 do 
			if 地图名() == "菲拉斯" then
				break
			end
			延时(1000)
		end
		while 过图中() do 
			延时(1000)
		end
		if 地图名() ~= "菲拉斯" then
			提示("炉石可能未冷却或绑错了地方")
			按键("space")
		end
		延时(1000)
	end
end
function 到厄运东()
	if 在副本() then
		return
	end
	if zhenying == "联盟" then
		if 在坐标范围(-4396.64, 3270.88, 12.1583,50) then
			路径走到("羽月要塞到厄运东",-4396.64, 3270.88, 12.1583)
			发送邮件()
		end
		if 在坐标范围(-4396.64, 3270.88, 12.1583,50) then
			路径走到("羽月要塞到厄运东",-4366.76, 3301.21, 13.5581)
			if 打开NPC("杜希雅·霜月") then
				延时(1000)
				for i=1,3 do 
					延时(1000)
					出售垃圾()
				end
			end
		end
		if not 在副本() then
			while not 在坐标范围(-3739.52, 934.515, 161.015,20) do
				if zy == "法师" then
					使用技能("冰甲术")
				end
				if HP() == 1 then
					x,y,z = 尸体坐标()
					路径走到("厄运东复活",x,y,z)
					复活()
					if zy == "潜行者" then
						潜行()
					elseif zy == "法师" then
						使用技能("冰甲术")
					end
				end
				纵向角度(0.65)
				路径走到("羽月要塞到厄运东",-3749.19, 934.158, 161.02)
				纵向角度(0.1)
				if HP() == 0 then
					延时(500)
					释放灵魂()
				end
			end
		end
	else
		if 在坐标范围(-4457.89, 243.72, 39.1078, 80) then
			路径走到("莫沙彻营地到厄运东",-4404.79, 238.79, 26.6965,1)
			延时(3000)
			发送邮件()
		end
		if 在坐标范围(-4407.79, 240.179, 27.4547,160) then
			路径走到("莫沙彻营地到厄运东",-4343.75, 251.108, 26.3177)
			if 打开NPC("沃尔布") then
				延时(500)
				for i=1,3 do 
					延时(1000)
					出售垃圾()
				end
			end
		end
		if not 在副本() then
			while not 在坐标范围(-3739.52, 934.515, 161.015,20) do
				使用技能("冰甲术")
				上马()
				路径走到("莫沙彻营地到厄运东",-3739.52, 934.515, 161.015)
				if HP() == 0 then
					延时(500)
					释放灵魂()
					x,y,z = 尸体坐标()
					路径走到("厄运东复活",x,y,z,30)
				end
			end
		end
	end
	while HP() <= 1 do
		延时(500)
		释放灵魂()
		x,y,z = 尸体坐标()
		路径走到("厄运东复活",x,y,z)
		复活()
		if HP()>1 then
			使用技能("冰甲术")
			延时(1500)
			使用技能("寒冰护体")
			上马()
			路径寻路("厄运东复活")
		else
			if zhenying == "联盟" then
				路径走到("羽月要塞到厄运东",x,y,z)
				复活()
				if HP()>1 then
					使用技能("冰甲术")
					延时(1500)
					使用技能("寒冰护体")
					上马()
					路径走到("羽月要塞到厄运东",-3739.52, 934.515, 161.015)
				end
			else
				路径走到("莫沙彻营地到厄运东",x,y,z)
				复活()
				if HP()>1 then
					使用技能("冰甲术")
					延时(1500)
					使用技能("寒冰护体")
					上马()
					路径走到("莫沙彻营地到厄运东",-3739.52, 934.515, 161.015)
				end
			end
		end
	end
	if 在坐标范围(-3739.52, 934.515, 161.015,20) then
		if 需要重置==1 then
			重置副本()
			需要重置=0
			if 已重置次数 ~= nil then
				已重置次数=已重置次数+1
				置重置次数(已重置次数)
			end
			延时(1000)
		end
		while not 在副本() do
			走到(-3739.52, 934.515, 161.015,1)
			朝向坐标(-3700.52, 934.515, 161.015)
			移动("前",5000)
			延时(1000)
			while 过图中() do 
				延时(1000)
			end
		end
	end
end
function 清包()
	销毁物品("荆棘|强效治|银叶|针织|莓汁|熏肉|宝箱|金棘|魔皇|黑蘑|枯叶|金参|阳草")
	销毁物品("地根|紫莲|南草|胡须|神花|智力卷|配方：|结构图|设计图|图样：|跌打|斯之泪")
	销毁物品("法力药水",1)
end
function 小花1()
	if HP() <= 1 then
		return
	end
	if 在坐标范围(46.7969, -155.154, -2.71439,40) then
		穿装备()
		延时(1000)
		穿装备()
		延时(1000)
		回满()
		保存装备信息()
		使用技能("奥术智慧")
		延时(1500)
		使用技能("冰甲术")
		延时(1400)
		回满()
		走到(53.4145, -166.191, -2.71437,1)
		while 坐标范围怪物数量(63.9791, -199.518, -4.12565,30,"扭木",1) > 0 do 
			延时(1000)
		end
		使用技能("寒冰护体")
		走到(85.837, -211.55, -4.02486,1)
		朝向坐标(130.737, -226.735, -56.8377)
		按键("w",1)
		延时(1000)
		使用技能("闪现术")
		走到(130.737, -226.735, -56.8377,1)
		回满()
	end
	if 在坐标范围(130.737, -226.735, -56.8377,15) then
		走到(130.737, -226.735, -56.8377,1)
		回满()
		if 范围选怪(126.017, -198.143, -55.6493,15) ~= 0 then
			使用技能("寒冰护体")
			延时(1500)
			朝向坐标(126.017, -198.143, -55.6493)
			延时(300)
			使用技能("火球术(等级 1)")
			延时(500)
			while 读条中() do 
				延时(100)
			end
			走到(130.737, -222.735, -56.8377,1)
			延时(6800)
			if 战斗中() then
				使用技能("冰霜新星(等级 1)")
				x,y,z = 当前坐标()
				移动("后",800)
				延时(700)
				使用技能("烈焰风暴")
				指向坐标(x,y,z)
				延时(500)
				while 读条中() do 
					延时(100)
				end
				使用技能("冰锥术")
				延时(1400)
				while 战斗中() do 
					使用技能("魔爆术")
					延时(1400)
				end
				摸尸体(15)
				摸尸体(15)
				摸尸体(15)
				清包()
				使用技能("寒冰护体")
				回满()
				清除目标()
			end
		end
	end
end
function 小花2()
	if HP() <= 1 then
		return
	end
	清除目标()
	回满()
	if 在坐标范围(130.737, -222.735, -56.8377,15) then
		if 等级() < 57 then
			朝向坐标(125.737, -250.735, -56.8377)
			if 坐标范围怪物数量(125.737, -250.735, -56.8377,35,"扭木",1) >0 then
				while true do 
					if 坐标范围怪物数量(125.737, -250.735, -56.8377,15,"扭木",1) >0 then
						break
					end
					延时(300)
				end
				延时(6000)
			end
		end
		走到(128.718, -221.392, -56.8372)
		走到(94.7488, -250.517, -56.026,1,0,3)
		延时(1400)
		if 存在DEBUFF("窒息孢子") then
			使用技能("寒冰屏障")
			延时(10000)
			回满()
		else
			延时(2000)
			while 战斗中() do 
				使用技能("魔爆术")
				延时(1400)
				使用技能("魔爆术")
				延时(1400)
				使用技能("冰霜新星(等级 1)")
				走到(91.7876, -240.96, -56.313,1)
				延时(1000)
				使用技能("寒冰护体")
				延时(1500)
				使用技能("烈焰风暴")
				指向坐标(94.7488, -250.517, -56.026)
				延时(1000)
				while 读条中() do 
					延时(100)
				end
				使用技能("冰锥术")
				延时(1400)
				while 战斗中() do 
					使用技能("魔爆术")
					延时(1400)
				end
				
				摸尸体(15)
				摸尸体(15)
				清包()
				使用技能("寒冰护体")
				回满()
				清除目标()
			end
		end
		while 战斗中() and 有目标() do 
			使用技能("魔爆术")
			延时(1500)
			使用技能("冰霜新星(等级 1)")
			走到(91.7876, -240.96, -56.313,1)
			延时(1000)
			使用技能("烈焰风暴")
			指向坐标(94.7488, -250.517, -56.026)
			延时(1000)
			while 读条中() do 
				延时(100)
			end
			使用技能("冰锥术")
			延时(1400)
			while 战斗中() do 
				使用技能("魔爆术")
				延时(1400)
			end
				摸尸体(15)
				摸尸体(15)
				摸尸体(15)
				清包()
				使用技能("寒冰护体")
				回满()
				清除目标()
		end
		while 战斗中() do 
			延时(1000)
		end
		回满()
	end
	if 在坐标范围(94.7488, -250.517, -56.026,15) then
		走到(94.7488, -250.517, -56.026,1,0,2)
		使用技能("寒冰护体")
		回满()
		while 技能可用("寒冰护体")== false do
			延时(1000)
		end
		if 范围选怪(71.35626221,-246.7521362,-55.49485016,20)~=0 then
			朝向坐标(71.35626221,-246.7521362,-55.49485016)
			使用技能("寒冰箭(等级 1)")
			延时(500)
			while 读条中() do 
				延时(100)
			end
			延时(7000)
			if 战斗中() then
				使用技能("冰霜新星(等级 1)")
				走到(92.2937, -240.52, -56.3117,1)
				延时(1000)
				使用技能("寒冰护体")
				延时(1500)
				使用技能("烈焰风暴")
				指向坐标(90.74637604,-248.3886566,-56.04547882)
				延时(1000)
				while 读条中() do 
					延时(100)
				end
				使用技能("冰锥术")
				延时(1400)
				while 战斗中() do 
					使用技能("魔爆术")
					延时(1400)
				end
				摸尸体(15)
				摸尸体(15)
				摸尸体(15)
				使用技能("寒冰护体")
				清包()
				清除目标()
			end
		end
		if 存在技能("寻找草药") then
			if 坐标范围有采集物(72.2972, -236.206, -56.3119,5) then
				走到(72.2972, -236.206, -56.3119,1)
				范围采集(5)
				走到(95.477, -248.745, -56.1002,1)
			end
			if 坐标范围有采集物(104.999, -329.715, -55.294,3) then
				if 坐标范围怪物数量(108.526, -269.24, -55.7968,25,"扭木",1) >0 then
					while true do 
						if 坐标范围怪物数量(108.526, -269.24, -55.7968,15,"扭木",1) >0 then
							break
						end
						延时(300)
					end
					延时(3000)
				end
				走到(88.477, -255.608, -55.7887,1)
				闪现走到(116.98, -310.482, -56.1831,1)
				走到(104.999, -329.715, -55.294,1)
				范围采集(3)
				走到(116.98, -310.482, -56.1831,1)
				if 坐标范围怪物数量(108.526, -269.24, -55.7968,25,"扭木",1) >0 then
					while true do 
						if 坐标范围怪物数量(108.526, -269.24, -55.7968,15,"扭木",1) >0 then
							break
						end
						延时(300)
					end
				end
				闪现走到(88.477, -255.608, -55.7887,1)
				走到(84.9142, -244.122, -56.1606,1)
			end
		end
		回满()
	end
end
function 小花3()
	if HP() <= 1 then
		return
	end
	if 在坐标范围(92.2937, -240.52, -56.3117,15) then
		使用技能("寒冰护体")
		延时(1500)
		回满()
		走到(62.2323, -227.814, -56.587)
		走到(43.9405, -225.283, -55.5938,1)
	end
	if 在坐标范围(43.9405, -225.283, -55.5938,15) then
		if 范围选怪(20.37551498,-222.2843323,-52.73828888,10)~=0 then
			使用技能("寒冰护体")
			延时(1000)
			while 技能可用("寒冰护体")== false do
				延时(1000)
			end
			朝向坐标(20.37551498,-222.2843323,-52.73828888)
			使用技能("寒冰箭(等级 1)")
			延时(500)
			while 读条中() do 
				延时(100)
			end
			延时(7900)
			if 战斗中() then
				使用技能("冰霜新星(等级 1)")
				走到(50.2316, -226.1, -55.4972,1,0,3)
				延时(1000)
				使用技能("寒冰护体")
				延时(1500)
				使用技能("烈焰风暴")
				指向坐标(43.9405, -225.283, -55.5938)
				延时(1000)
				while 读条中() do 
					延时(100)
				end
				使用技能("冰锥术")
				延时(1400)
				while 战斗中() do 
					使用技能("魔爆术")
					延时(1400)
				end
				摸尸体(15)
				摸尸体(15)
				摸尸体(15)
				使用技能("寒冰护体")
				清包()
				回满()
				清除目标()
			end
		end
	end
end
function 小花4()
	if HP() <= 1 then
		return
	end
	回满()
	if 在坐标范围(50.2316, -226.1, -55.4972,15) then
		走到(32.7212, -226.949, -54.2539,1)
		使用技能("寒冰护体")
		while true do 
			if 坐标范围怪物数量(-4.474224091,-216.9805298,-53.69833374,15,"扭木",1) >1 then
				break
			end
			延时(300)
		end
		延时(10000)
		使用技能("法力护盾")
		延时(1500)
		闪现走到(-32.3579, -222.303, -56.9862,1)
	end
	if 在坐标范围(-32.3579, -222.303, -56.9862,15) then
		if 范围选怪(-49.16758728,-222.4135742,-57.21459198,10)~=0 then
			while 技能可用("寒冰护体")== false and not 战斗中() do
				延时(1000)
			end
			朝向坐标(-49.16758728,-222.4135742,-57.21459198)
			移动("前",1000)
			延时(100)
			使用技能("寒冰箭(等级 1)")
			延时(500)
			while 读条中() do 
				延时(100)
			end
			延时(4500)
			if 战斗中() then
				使用技能("冰霜新星(等级 1)")
				移动("后",800)
				延时(800)
				使用技能("寒冰护体")
				延时(1500)
				使用技能("烈焰风暴")
				指向坐标(-36.739048, -222.5222015, -56.9719788)
				延时(1000)
				while 读条中() do 
					延时(100)
				end
				使用技能("冰锥术")
				延时(1400)
				while 战斗中() do 
					使用技能("魔爆术")
					延时(1400)
				end
				摸尸体(15)
				摸尸体(15)
				摸尸体(15)
				走到(-38.8809, -221.138, -57.3431,1)
				使用技能("寒冰护体")
				清包()
				回满()
				清除目标()
			end
		end
	end
end
function 小花5()
	if HP() <= 1 then
		return
	end
	回满()
	if 在坐标范围(-35.9841, -214.548, -56.7407,15) then
		走到(-38.8809, -221.138, -57.3431,1)
		while true do 
			if 坐标范围怪物数量(-89.88150787,-231.9217834,-56.24483109,15,"扭木",1) >1 then
				break
			end
			延时(300)
		end
		延时(10000)
		走到(-45.8998, -225.874, -57.4909)
		闪现走到(-75.2806, -275.777, -57.4704,1)
		回满()
	end
	if 在坐标范围(-75.2806, -275.777, -57.4704,15) then
		走到(-83.0797, -276.62, -58.1945,1)
		while true do 
			if 坐标范围怪物数量(-116.1230774,-255.356781,-55.44676971,15,"扭木",1) >1 then
				break
			end
			延时(300)
		end
		使用技能("寒冰护体")
		延时(12000)
		if 范围选怪(-107.3327332,-294.858551,-57.68330383,10)~=0 then
			while 技能可用("寒冰护体")== false do
				延时(1000)
			end
			朝向坐标(-107.3327332,-294.858551,-57.68330383)
			使用技能("寒冰箭(等级 1)")
			延时(500)
			while 读条中() do 
				延时(100)
			end
			延时(8000)
			if 战斗中() then
				使用技能("冰霜新星(等级 1)")
				走到(-78.3849, -273.056, -58.048,1,0,3)
				延时(1000)
				使用技能("寒冰护体")
				延时(1500)
				使用技能("烈焰风暴")
				指向坐标(-83.0797, -276.62, -58.1945)
				延时(1000)
				while 读条中() do 
					延时(100)
				end
				使用技能("冰锥术")
				延时(1400)
				while 战斗中() do 
					使用技能("魔爆术")
					延时(1400)
				end
				摸尸体(15)
				摸尸体(15)
				摸尸体(15)
				清包()
				使用技能("寒冰护体")
				回满()
				清除目标()
			end
		end
	end
end
function 小花6()
	if HP() <= 1 then
		return
	end
	回满()
	if 在坐标范围(-78.3849, -273.056, -58.048,15) then
		while true do 
			if 坐标范围怪物数量(-116.1230774,-255.356781,-55.44676971,15,"扭木",1) >1 then
				break
			end
			延时(300)
		end
		延时(14000)
		使用技能("寒冰护体")
		走到(-96.5001, -283.162, -58.2968)
		闪现走到(-157.403, -277.817, -51.8117,1)
		走到(-157.464, -222.118, -55.1753)
		走到(-155.362, -222.359, -55.3247,1)
	end
	if 在坐标范围(-155.362, -222.359, -55.3247,15) then
		走到(-155.362, -222.359, -55.3247,1)
		延时(1400)
		if 范围选怪(-148.1406097,-202.6403198,-53.02642441,10)~=0 then
			while 技能可用("寒冰护体")== false do
				延时(1000)
			end
			朝向坐标(-148.1406097,-202.6403198,-53.02642441)
			使用技能("寒冰箭(等级 1)")
			延时(500)
			while 读条中() do 
				延时(100)
			end
			延时(6000)
			if 战斗中() then
				使用技能("冰霜新星(等级 1)")
				走到(-156.187, -226.216, -54.9534,1)
				延时(1000)
				使用技能("寒冰护体")
				延时(1500)
				使用技能("烈焰风暴")
				指向坐标(-155.362, -222.359, -55.3247)
				延时(1000)
				while 读条中() do 
					延时(100)
				end
				使用技能("冰锥术")
				延时(1400)
				while 战斗中() do 
					使用技能("魔爆术")
					延时(1400)
				end
				摸尸体(15)
				摸尸体(15)
				摸尸体(15)
				清包()
				使用技能("寒冰护体")
				回满()
				清除目标()
			end
		end
	end
end
function 小花7()
	if HP() <= 1 then
		return
	end
	if 在坐标范围(-155.362, -222.359, -55.3247,15) then
		走到(-157.463, -263.139, -50.676,1)
		走到(-143.595, -289.864, -54.3789,1)
	end
	if 在坐标范围(-143.595, -289.864, -54.3789,15) then
		while true do 
			if 坐标范围怪物数量(-116.1230774,-255.356781,-55.44676971,15,"扭木",1) >1 then
				break
			end
			延时(300)
		end
		延时(11000)
		走到(-122.386, -292.784, -56.7385)
		朝向坐标(-88.7011, -369.468, -56.8529)
		使用技能("寒冰护体")
		延时(3000)
		使用技能("闪现术")
		走到(-88.7011, -369.468, -56.8529,1)
		走到(-33.3372, -370.515, -56.8559,1)
	end
	if 在坐标范围(-36.2346, -359.15, -54.4771,15) then
		if 等级() < 58 then
			while 技能可用("寒冰护体")== false and not 战斗中() do
				延时(1000)
			end
		end
		走到(-36.2346, -359.15, -54.4771,1)
		if 范围选怪(-54.61833191,-346.5125122,-54.29438782,10)~=0 then
			朝向坐标(-54.61833191,-346.5125122,-54.29438782)
			使用技能("寒冰箭(等级 1)")
			延时(500)
			while 读条中() do 
				延时(100)
			end
			延时(6500)
			if 战斗中() then
				使用技能("冰霜新星(等级 1)")
				走到(-33.3589, -363.178, -55.256,1)
				延时(1000)
				使用技能("寒冰护体")
				延时(1500)
				使用技能("烈焰风暴")
				指向坐标(-36.2346, -359.15, -54.4771)
				延时(1000)
				while 读条中() do 
					延时(100)
				end
				使用技能("冰锥术")
				延时(1400)
				while 战斗中() do 
					使用技能("魔爆术")
					延时(1400)
				end
				摸尸体(15)
				摸尸体(15)
				摸尸体(15)
				清包()
				使用技能("寒冰护体")
				回满()
				清除目标()
			end
		end
	end
end
function 小花8()
	if HP() <= 1 then
		return
	end
	需要重置=1
	if 在坐标范围(-33.3589, -363.178, -55.256,15) then
		走到(-12.1536, -370.514, -56.6815,1)
		走到(-3.05531, -356.703, -54.8634,1)
	end
	if 在坐标范围(-3.05531, -356.703, -54.8634,15) then
		if 等级() < 60 then
			while true do 
				if 坐标范围怪物数量(-9.475131035,-331.6434937,-51.4149704,30,"扭木",1) ==0 then
					break
				end
				延时(300)
			end
		end
		使用技能("寒冰护体")
		走到(1.8937, -334.989, -52.3294)
		走到(14.2795, -337.573, -52.6405,1)
	end
	if 在坐标范围(14.2795, -337.573, -52.6405,15) then
		走到(14.2795, -337.573, -52.6405,1)
		延时(1400)
		if 范围选怪(16.59217453,-319.7244873,-51.09815979,10)~=0 then
			while 技能可用("寒冰护体")== false do
				延时(1000)
			end
			朝向坐标(16.59217453,-319.7244873,-51.09815979)
			移动("前",800)
			x,y,z = 当前坐标()
			延时(100)
			使用技能("寒冰箭(等级 1)")
			延时(500)
			while 读条中() do 
				延时(100)
			end
			延时(5500)
			if 战斗中() then
				使用技能("冰霜新星(等级 1)")
				走到(14.2795, -337.573, -52.6405,1)
				延时(1200)
				使用技能("寒冰护体")
				延时(1500)
				使用技能("烈焰风暴")
				指向坐标(x,y,z)
				延时(1000)
				while 读条中() do 
					延时(100)
				end
				使用技能("冰锥术")
				移动("前",800)
				延时(600)
				while 战斗中() do 
					使用技能("魔爆术")
					延时(1400)
				end
				摸尸体(15)
				摸尸体(15)
				摸尸体(15)
				清包()
				清除目标()
				销毁物品("苏打|晶水|法甜|力红|力黄")
			end
		end
	end
end
function 小花出本()
	if HP() <= 1 then
		return
	end
	需要重置=1
	if 背包空格() < 10 or 需要修理() then
		厄运回城()
	else
		脱装备()
		走到(18.9565, -336.982, -52.452,1)
		打开身边目标()
		延时(500)
		while 读条中() do 
			延时(100)
		end
		延时(1500)
		走到(16.43648148,-268.0618591,-52.59,1)
		while HP() > 0 do 
			延时(1000)
		end
		延时(2000)
		运行宏("/run RepopMe()")
		延时(3000)
		while 过图中() do 
			延时(1000)
		end
		延时(2000)
	end
end
function 小花修理()
	if HP() <= 1 then
		return
	end
	if 需要修理() then
		厄运回城()
	end
end
function 小花复活()
	if HP() <= 1 then
		延时(500)
		释放灵魂()
		x,y,z = 尸体坐标()
		路径走到("厄运东复活",x,y,z)
		复活()
		延时(300)
		if HP()>1 then
		else
			路径寻路("厄运东复活")
		end
		if 需要重置==1 then
			重置副本()
			需要重置=0
			if 已重置次数 ~= nil then
				已重置次数=已重置次数+1
				置重置次数(已重置次数)
			end
		end
		延时(1000)
		x,y,z = 当前坐标()
		if 在坐标范围(-3740.95, 934.519, 161.015,30) then
			while not 在副本() do 
				走到(-3740.95, 934.519, 161.015,1)
				朝向坐标(-3700.95, 934.519, 161.015)
				自动跑()
				延时(5000)
				while 过图中() do 
					延时(1000)
				end
				延时(1000)
				if HP() == 1 then
					x,y,z = 尸体坐标()
					if 阵营()=="联盟" then
						路径走到("羽月要塞到厄运东",x,y,z,25)
						复活()
						使用技能("冰甲术")
						上马()
						路径走到("羽月要塞到厄运东",-3740.95, 934.519, 161.015)
					else
						路径走到("莫沙彻营地到厄运东",x,y,z,25)
						复活()
						使用技能("冰甲术")
						上马()
						路径走到("莫沙彻营地到厄运东",-3740.95, 934.519, 161.015)
					end
				end
			end
			穿装备()
		end
	end
end
function 厄运东小花()
	小花复活()
	小花修理()
	到厄运东()
	策略检查()
	if 在副本() then
		小花1()
		小花2()
		小花3()
		小花4()
		小花5()
		小花6()
		小花7()
		小花8()
		小花出本()
	end
end
function 小花采集1()
	if HP() <= 1 then
		return
	end
	if 在坐标范围(46.7969, -155.154, -2.71439,40) then
		使用技能("奥术智慧")
		延时(1500)
		使用技能("冰甲术")
		延时(1400)
		回满()
		走到(53.4145, -166.191, -2.71437,1)
		while 坐标范围怪物数量(63.9791, -199.518, -4.12565,30,"扭木",1) > 0 do 
			延时(1000)
		end
		使用技能("寒冰护体")
		走到(85.837, -211.55, -4.02486,1)
		if zy == "法师" then
			朝向坐标(130.737, -226.735, -56.8377)
		else
			朝向坐标(96.673, -238.487, -56.3888)
		end
		按键("w",1)
		延时(1000)
		if zy == "法师" then
			使用技能("闪现术")
		else
			延时(1000)
		end
		延时(500)
		按键("w",2)
		if zy == "法师" then
			回满()
		end
		走到(93.6997, -231.547, -56.4788,1)
	end
end
function 小花采集2()
	if HP() <= 1 then
		return
	end
	清除目标()
	if zy == "法师" then
		回满()
	end
	if 在坐标范围(93.6997, -231.547, -56.4788,20) then
		if 坐标范围有采集物(96.673, -238.487, -56.3888,5) then
			走到(96.673, -238.487, -56.3888,1,0,4)
			延时(100)
			范围采集(5)
		end
		走到(90.5424, -236.27, -56.4317,1)
		走到(89.3341, -248.319, -56.0018,1)
		延时(2000)
		if 坐标范围有采集物(105.138, -329.307, -55.3123,5) then
			while HP()>1 do 
				if 坐标范围怪物数量(98.3135, -278.881, -55.9784,30,"扭木",1) >0 then
					break
				end
				延时(500)
			end
			while 坐标范围怪物数量(98.3135, -278.881, -55.9784,30,"扭木",1) >0 and HP()>1 do 
				延时(300)
			end
			延时(1000)
			走到(91.6824, -260.311, -56.1412)
			if zy=="法师" then
				闪现走到(114.438, -305.553, -56.6728,1)
			else
				潜行()
				走到(114.438, -305.553, -56.6728,1)
			end
			走到(105.138, -329.307, -55.3123,1,0,3)
			范围采集(5)
			走到(114.438, -305.553, -56.6728,1)
			while HP()>1 do 
				if 坐标范围怪物数量(98.3135, -278.881, -55.9784,30,"扭木",1) >0 then
					break
				end
				延时(500)
			end
			while 坐标范围怪物数量(98.3135, -278.881, -55.9784,30,"扭木",1) >0 and HP()>1 do 
				延时(300)
			end
			走到(109.305, -291.812, -56.7297)
			if zy=="法师" then
				闪现走到(90.21, -253.982, -55.8474,1)
			else
				潜行()
				走到(90.21, -253.982, -55.8474,1)
			end
			走到(87.4127, -239.743, -56.4255,1)
		end
		走到(84.3527, -235.967, -56.5626,1)
		走到(74.1917, -230.753, -56.7819,1)
		if 坐标范围有采集物(74.1917, -230.753, -56.7819,5) then
			范围采集(5)
		end
		走到(58.344, -221.012, -56.8243,1)
		走到(43.9405, -225.283, -55.5938,1)
		潜行()
	end
	if 在坐标范围(43.9405, -225.283, -55.5938,15) then
		if zy == "法师" then
			if 范围选怪(20.37551498,-222.2843323,-52.73828888,10)~=0 then
				if not 存在BUFF("寒冰护体") then
					使用技能("寒冰护体")
					延时(20000)
				end
				朝向坐标(20.37551498,-222.2843323,-52.73828888)
				使用技能("寒冰箭(等级 1)")
				延时(500)
				while 读条中() do 
					延时(100)
				end
				延时(7900)
				if 战斗中() then
					使用技能("冰霜新星(等级 1)")
					走到(50.2316, -226.1, -55.4972,1,0,3)
					延时(1000)
					使用技能("寒冰护体")
					延时(1500)
					使用技能("烈焰风暴")
					指向坐标(43.9405, -225.283, -55.5938)
					延时(1000)
					while 读条中() do 
						延时(100)
					end
					使用技能("冰锥术")
					延时(1400)
					while 战斗中() do 
						使用技能("魔爆术")
						延时(1400)
					end
					摸尸体(15)
					摸尸体(15)
					摸尸体(15)
					使用技能("寒冰护体")
					清包()
					清除目标()
				end
			end
			if 坐标范围有采集物(16.2265, -224.433, -51.9667,5) then
				走到(16.2265, -224.433, -51.9667,1,0,3)
				范围采集(5)
			end
		elseif zy == "潜行者" then
			--[[if 坐标范围有采集物(32.9121,-197.76,-52.4576,2) then
				走到(28.292, -197.001, -51.5127,1,0,0.15)
				朝向坐标(51.3358, -199.286, -55.8605)
				移动("后",50)
				while 坐标范围怪物数量(28.0352, -197.81, -51.7795,16.5,"死亡鞭笞者",1) >0 and 可循环() do 
					延时(200)
				end
				使用技能("扰乱")
				指向坐标(32.9121,-197.76,-52.4576)
				while 可循环() do
					打开身边目标()
					延时(1000)
					if 读条中() then
						延时(300)
						while 读条中() do 
							延时(200)
						end
						if not 战斗中() then
							延时(1500)
							移动("后",800)
						else
							使用技能("消失")
							延时(1000)
							
						end
						if 战斗中() then
							使用技能("消失")
							延时(1000)
						end
						潜行()
						break
					else
						指向坐标(32.9121,-197.76,-52.4576)
						移动("前",100)
					end
				end
				走到(43.9405, -225.283, -55.5938,1,0,3)
			end--]]
			
		end
		潜行()
		走到(26.2744, -236.216, -52.6619,1)
	end
	if 在坐标范围(26.2744, -236.216, -52.6619,15) then
		走到(35.4015, -244.974, -52.943,1)
		走到(53.097, -282.732, -54.2775,1)
	end
	if 在坐标范围(53.097, -282.732, -54.2775,15) then
		while HP() > 1 do 
			if 坐标范围怪物数量(35.0327, -286.687, -52.6019,25,"扭木",1)>0 then
				break
			else
				延时(500)
			end
		end
		while 坐标范围怪物数量(35.0327, -286.687, -52.6019,25,"扭木",1)>0 and HP() > 1 do 
			延时(500)
		end
		走到(48.5457, -284.459, -53.547)
		走到(27.3856, -341.964, -53.0309,1)
		if 坐标范围有采集物(19.2594, -336.689, -52.4196,5) then
			走到(19.4742, -339.239, -52.6531,1)
			范围采集(5)
		end
		走到(13.7417, -355.735, -55.5111)
		走到(-9.02237, -364.128, -55.9381)
		潜行()
		走到(-31.9447, -359.205, -54.3895,1)
	end
	if 在坐标范围(-31.9447, -359.205, -54.3895,15) then
		while 战斗中() do
			if zy == "法师" then
				使用技能("寒冰护体")
			end
			x,y,z = 当前坐标()
			if 坐标范围怪物数量(x,y,z ,7,"抽笞者")>0 then
				if zy == "法师" then
					使用技能("烈焰风暴")
					延时(200)
					指向坐标(-31.9447, -359.205, -54.3895)
					延时(300)
					while 读条中() do 
						延时(200)
					end
					while 坐标范围怪物数量(x,y,z ,10,"抽笞者")>0 do 
						使用技能("魔爆术")
						延时(1400)
					end
				elseif zy == "潜行者" then
					使用技能("消失")
					延时(1500)
					if 战斗中() then
						使用技能("伺机待发")
						延时(100)
						使用技能("消失")
						延时(2000)
					end
				end
			end
		end
		走到(-30.9456, -351.782, -52.8714,1)
		潜行()
		while HP()>1 do
			local t=0
			while HP() > 1 do 
				if 坐标范围怪物数量(-17.8974, -335.852, -51.886,15,"扭木",1)>0 then
					while 坐标范围怪物数量(-17.8974, -335.852, -51.886,15,"扭木",1)>0 and HP() > 1 do 
						延时(500)
					end
					break
				else
					延时(500)
				end
			end
			while 坐标范围怪物数量(-17.8974, -335.852, -51.886,15,"扭木",1)>0 and HP() > 1 do 
				延时(500)
			end
			t1=os.clock()
			while 坐标范围怪物数量(-39.2363, -321.891, -51.405,27,"扭木",1)>0 and HP() > 1 do 
				延时(500)
			end
			if os.clock()-t1 < 4 then
				break
			end
		end
		延时(500)
		走到(-29.0338, -345.565, -53.2565,1)
		走到(-30.6438, -338.247, -52.3793)
		--[[if 坐标范围有采集物(-29.3618, -335.521, -51.8964,5) then
			走到(-29.3618, -335.521, -51.8964,1,0,3)
			范围采集(5)
			走到(-30.6438, -338.247, -52.3793)
			走到(-29.0338, -345.565, -53.2565,1)
			走到(-30.9778, -355.255, -53.5274,1)
			while HP()>1 do
				local t=0
				while HP() > 1 do 
					if 坐标范围怪物数量(-17.8974, -335.852, -51.886,15,"扭木",1)>0 then
						while 坐标范围怪物数量(-17.8974, -335.852, -51.886,15,"扭木",1)>0 and HP() > 1 do 
							延时(500)
						end
						break
					else
						延时(500)
					end
				end
				while 坐标范围怪物数量(-17.8974, -335.852, -51.886,15,"扭木",1)>0 and HP() > 1 do 
					延时(500)
				end
				t1=os.clock()
				while 坐标范围怪物数量(-39.2363, -321.891, -51.405,27,"扭木",1)>0 and HP() > 1 do 
					延时(500)
				end
				if os.clock()-t1 < 4 then
					break
				end
			end
			走到(-29.0338, -345.565, -53.2565,1)
			走到(-30.6438, -338.247, -52.3793)
		end--]]
		if zy == "法师" then
			闪现走到(-53.5684, -303.359, -55.3714,1)
		else
			潜行()
			走到(-43.3493, -312.836, -53.3116,1)
		end
		while 存在DEBUFF("纠缠根须") or 战斗中() do 
			延时(500)
			x,y,z = 当前坐标()
			if 坐标范围怪物数量(x,y,z ,7,"抽笞者")>0 then
				if zy == "法师" then
					使用技能("寒冰护体")
					延时(1400)
					使用技能("烈焰风暴")
					延时(200)
					指向坐标(-53.5684, -303.359, -55.3714)
					延时(300)
					while 读条中() do 
						延时(200)
					end
					while 坐标范围怪物数量(x,y,z ,10,"抽笞者")>0 do 
						使用技能("魔爆术")
						延时(1400)
					end
				elseif zy == "潜行者" then
					走到(-59.1578, -301.066, -56.1423,1)
					使用技能("消失")
					延时(1500)
					if 战斗中() then
						使用技能("伺机待发")
						延时(100)
						使用技能("消失")
						延时(2000)
					end
					走到(-80.5377, -275.189, -58.1373,1)
					走到(-59.1578, -301.066, -56.1423)
					走到(-53.5684, -303.359, -55.3714,1)
				end
			end
		end
		潜行()
	end
	if 在坐标范围(-53.5684, -303.359, -55.3714,10) or 在坐标范围(-43.3493, -312.836, -53.3116,10) then
		if 坐标范围有采集物(-36.7223, -319.04, -51.8185,5) then
			while HP() > 1 do 
				if 坐标范围怪物数量(-38.6646, -322.956, -51.2096,9,"扭木",1)>0 then
					break
				else
					延时(500)
				end
				if 存在DEBUFF("窒息孢子") then
					if zy == "法师" then
						使用技能("寒冰屏障")
						延时(10000)
					else
						走到(-59.1578, -301.066, -56.1423,1)
						while 存在DEBUFF("窒息孢子") do 
							延时(500)
						end
						走到(-53.5684, -303.359, -55.3714,1)
					end
				end
			end
			while 坐标范围怪物数量(-38.6646, -322.956, -51.2096,15,"扭木",1)>0 and HP() > 1 do 
				延时(500)
				if 存在DEBUFF("窒息孢子") then
					if zy == "法师" then
						使用技能("寒冰屏障")
						延时(10000)
					else
						走到(-59.1578, -301.066, -56.1423,1)
						while 存在DEBUFF("窒息孢子") do 
							延时(500)
						end
						走到(-53.5684, -303.359, -55.3714,1)
					end
				end
			end
			延时(2000)
			走到(-40.5501, -318.856, -52.0376,1)
			范围采集(5)
			if zy == "法师" then
				走到(-53.5684, -303.359, -55.3714,1)
				走到(-59.1578, -301.066, -56.1423,1)
			else
				潜行()
				走到(-43.3493, -312.836, -53.3116,1)
			end
		end
		if zy == "潜行者" then
			走到(-39.5596, -296.879, -55.1481)
			走到(-44.584, -287.094, -56.8314)
		end
		走到(-80.5377, -275.189, -58.1373,1)
		while 战斗中() do
			if zy == "法师" then
				使用技能("寒冰护体")
				延时(1400)
			end
			x,y,z = 当前坐标()
			if 坐标范围怪物数量(x,y,z ,7,"抽笞者")>0 then
				if zy == "法师" then
					使用技能("烈焰风暴")
					延时(200)
					指向坐标(-80.5377, -275.189, -58.1373)
					延时(300)
					while 读条中() do 
						延时(200)
					end
					while 坐标范围怪物数量(x,y,z ,10,"抽笞者")>0 do 
						使用技能("魔爆术")
						延时(1400)
					end
				elseif zy == "潜行者" then
					使用技能("消失")
					延时(3000)
				end
			end
		end
	end
	if 在坐标范围(-80.5377, -275.189, -58.1373,20) then
		if 坐标范围有采集物(-76.7183, -246.526, -56.8887,5) then
			取消BUFF("潜行")
			while HP() > 1 do 
				if 坐标范围怪物数量(-76.0416, -241.189, -56.8467,20,"扭木",1)>0 then
					break
				else
					延时(500)
				end
			end
			while 坐标范围怪物数量(-76.0416, -241.189, -56.8467,20,"扭木",1)>0 and HP() > 1 do 
				延时(500)
			end
			走到(-76.7183, -246.526, -56.8887,1,0,4)
			范围采集(5)
			走到(-83.0797, -276.62, -58.1945,1)
		end
		if zy == "法师" then
			走到(-83.0797, -276.62, -58.1945,1)
			while 战斗中() do 
				延时(1000)
			end
			回满()
			使用技能("寒冰护体")
			延时(12000)
			while HP()>1 do 
				if 坐标范围怪物数量(-116.1230774,-255.356781,-55.44676971,15,"扭木",1) >1 then
					break
				end
				延时(300)
			end
			延时(12000)
			if 范围选怪(-107.3327332,-294.858551,-57.68330383,10)~=0 then
				朝向坐标(-107.3327332,-294.858551,-57.68330383)
				使用技能("寒冰箭(等级 1)")
				延时(500)
				while 读条中() do 
					延时(100)
				end
				延时(8000)
				if 战斗中() then
					使用技能("冰霜新星(等级 1)")
					走到(-78.3849, -273.056, -58.048,1,0,3)
					延时(1000)
					使用技能("寒冰护体")
					延时(1500)
					使用技能("烈焰风暴")
					指向坐标(-83.0797, -276.62, -58.1945)
					延时(1000)
					while 读条中() do 
						延时(100)
					end
					使用技能("冰锥术")
					延时(1400)
					while 战斗中() do 
						使用技能("魔爆术")
						延时(1400)
					end
					摸尸体(15)
					摸尸体(15)
					摸尸体(15)
					清包()
					使用技能("寒冰护体")
					清除目标()
				end
			end
		elseif zy == "潜行者" then
			潜行()
			走到(-98.531, -268.153, -58.117)
			走到(-103.794, -271.016, -57.8277,1)
			while HP()>1 do 
				if 坐标范围怪物数量(-116.1230774,-255.356781,-55.44676971,15,"扭木",1) >1 then
					while 坐标范围怪物数量(-116.1230774,-255.356781,-55.44676971,15,"扭木",1) >1 and 可循环() do 
						延时(500)
					end
					break
				end
				延时(300)
			end
			延时(2000)
			走到(-138.282, -278.209, -53.8038,1)
		end
	end
	if 在坐标范围(-78.3849, -273.056, -58.048,22) then
		while HP()>1 do 
			if 坐标范围怪物数量(-116.1230774,-255.356781,-55.44676971,15,"扭木",1) >1 then
				break
			end
			延时(300)
		end
		延时(12000)
		使用技能("寒冰护体")
		走到(-96.5001, -283.162, -58.2968)
		闪现走到(-144.112, -285.896, -54.0014,1)
	end
	if 在坐标范围(-144.112, -285.896, -54.0014,30) then
		if 坐标范围有采集物(-130.791, -266.748, -53.6674,5) then
			while HP() > 1 do 
				if 坐标范围怪物数量(-130.791, -266.748, -53.6674,15,"扭木",1)>0 then
					break
				else
					延时(500)
				end
			end
			while 坐标范围怪物数量(-130.791, -266.748, -53.6674,20,"扭木",1)>0 and HP() > 1 do 
				延时(500)
			end
			走到(-130.791, -266.748, -53.6674,1,0,3)
			范围采集(5)
			走到(-144.112, -285.896, -54.0014,1)
		end
		if zy == "法师" then
			while HP() > 1 do 
				if 坐标范围怪物数量(-130.791, -266.748, -53.6674,15,"扭木",1)>0 then
					break
				else
					延时(500)
				end
			end
			while 坐标范围怪物数量(-130.791, -266.748, -53.6674,20,"扭木",1)>0 and HP() > 1 do 
				延时(500)
			end
			走到(-131.303, -294.535, -55.805)
			走到(-123.368, -294.753, -56.6576,1)
			走到(-123.637, -308.358, -57.1542,1)
		elseif zy == "潜行者" then
			潜行()
			走到(-123.827, -294.541, -56.6576,1)
			走到(-123.129, -308.04, -57.1573)
			走到(-117.907, -316.633, -57.0866,1)
		end
		if 坐标范围有采集物(-121.613, -309.891, -57.1476,2) then
			if zy == "潜行者" then
				走到(-122.255, -314.681, -57.1006,1,0,0.2)
				if 战斗中() then
					if 存在DEBUFF("窒息孢子") then
						走到(-132.426, -309.961, -56.7314)
						走到(-123.368, -294.753, -56.6576,1)
						走到(-144.112, -285.896, -54.0014,1)
						while 存在DEBUFF("窒息孢子") do 
							延时(500)
						end
						走到(-135.66, -294.264, -55.3745)
						走到(-132.426, -309.961, -56.7314)
						走到(-124.199, -314.202, -57.1034,1)
					elseif 存在DEBUFF("纠缠根须") then
						while 存在DEBUFF("纠缠根须") do 
							延时(500)
						end
					end
					while 战斗中() do 
						延时(500)
					end
					潜行()
				end
				while 坐标范围怪物数量(-124.199, -314.202, -57.1034,14,"抽笞者",1)>0 do 
					if 坐标范围怪物数量(-124.199, -314.202, -57.1034,14,"抽笞者",1) > 2 then
						break
					end
					延时(300)
				end
				if 坐标范围怪物数量(-124.199, -314.202, -57.1034,14,"抽笞者",1) < 2 then
					使用技能("扰乱")
					指向坐标(-110.07, -296.679, -57.3787)
					延时(300)
				end
			end
			if 坐标范围怪物数量(-124.199, -314.202, -57.1034,14,"抽笞者",1) ==0 then
				范围采集(6)
				if zy == "法师" then
					while 可循环() do 
						if 坐标范围怪物数量(-130.791, -266.748, -53.6674,15,"扭木",1)>0 then
							break
						else
							延时(500)
						end
					end
				elseif zy == "潜行者" then
					潜行()
				end
			end
		end
		走到(-116.098, -320.388, -57.0561)
		走到(-101.234, -347.395, -56.9022,1,1)
		走到(-113.498, -370.461, -56.9022,1)
		走到(-120.577, -370.503, -56.3528,1,1)
		if zy == "潜行者" then
			if 战斗中() then
				使用技能("消失")
				延时(2000)
			end
		end
		潜行()
	end
	if 在坐标范围(-120.577, -370.503, -56.3528,35) then
		if 坐标范围有采集物(-110.159, -419.747, -58.6035,5) then
			走到(-121.864, -370.313, -56.2797,1)
			if 坐标范围怪物数量(-142.291, -371.011, -57.0163,20,"荒野|暗影",1) == 0 then
				走到(-135.577, -370.503, -56.3528,1,1)
				移动("前",1000)
			end
			while 可循环() do 
				if 坐标范围怪物数量(-142.291, -371.011, -57.0163,20,"荒野|暗影",1) > 0 then
					while 坐标范围怪物数量(-142.291, -371.011, -57.0163,20,"荒野|暗影",1) > 0 do 
						延时(500)
					end
					break
				end
				延时(500)
			end
			走到(-135.111, -366.691, -56.3351)
			走到(-139.864, -370.527, -57.0164)
			走到(-148.239, -387.618, -57.5755,1)
			while 坐标范围怪物数量(-139.652, -402.777, -57.575,15,"荒野|暗影",1) > 0 do 
				延时(500)
			end
			走到(-142.914, -403.601, -57.5754,1)
			while 坐标范围怪物数量(-121.198, -406.839, -57.0261,10,"荒野|暗影",1) > 0 do 
				延时(500)
			end
			走到(-121.198, -406.839, -57.0261,1)
			if 坐标范围怪物数量(-110.159, -419.747, -58.6035,10,"荒野|暗影",1) > 0 then
				走到(-138.637, -406.338, -57.5751)
				走到(-134.128, -410.38, -57.0199)
				延时(300)
				走到(-134.128, -408.456, -57.0199,1,0,0.3)
			else
				走到(-117.391, -406.574, -57.551)
				走到(-111.653, -421.566, -58.6041,1)
				范围采集(5)
				走到(-114.705, -423.652, -58.6052,1,0,0.2)
			end
		end
	end
end
function 厄运东采集()
	到厄运东()
	小花复活()
	if 在副本() then
		小花采集1()
		小花采集2()
	end
end

function 奥格到斯通纳德()
	local map=地图名()
	if map == "奥格瑞玛" or map=="杜隆塔尔" then
		if not 在坐标范围(1359.73, -4637.89, 53.839,30) then
			自动寻路(1331.4, -4619.97, 23.6629)
		end
		路径走到("奥格飞艇下到飞荆棘谷点",1361.4, -4635.26, 53.8955)
		坐船()
	end
	if 地图名() ~= "阿塔哈卡神庙" and HP() > 1 then
		if 小地图名() == "格罗姆高营地" then
			路径走到("荆棘谷到斯通纳德",-12416, 144.864, 3.30047)
			打开NPC("塞斯塔")
			延时(500)
			打开NPC("塞斯塔")
			延时(1500)
			if 坐飞机到("斯通纳德") then
				while 在飞机上() do 
					延时(1000)
				end
			else
				路径走到("荆棘谷到斯通纳德",-10456.7, -3280.4, 21.3412)
				打开NPC("布雷依克")
				延时(500)
			end
		end
		while 炉石位置() ~= "斯通纳德" do
			路径走到("荆棘谷到斯通纳德",-10486.1, -3258.97, 21.0299)
			if 打开NPC("旅店老板卡拉库尔") then
				对话选项(1)
				延时(1000)
				运行宏("/click StaticPopup1Button1")
				延时(1000)
			end
		end
		if 在坐标范围(-10484.8, -3257.87, 21.0301,40) then
			if zy == "法师" then
				if not 存在技能("传送：斯通纳德") then
					走到(-10459.7, -3262.21, 20.1792)
					走到(-10454.6, -3269.99, 20.8039)
					走到(-10456.8, -3279.35, 21.3567,1)
					打开NPC("布雷依克")
					走到(-10443.8, -3290.88, 20.1792)
					走到(-10451.6, -3306.54, 21.0088)
					走到(-10467.8, -3320.48, 20.9643,1)
					if 打开NPC("洛林·跃火") then
						对话选项(1)
						延时(1000)
						学习技能()
					end
					走到(-10451.6, -3306.54, 21.0088)
					走到(-10443.8, -3290.88, 20.1792)
					走到(-10445.1, -3274.93, 20.178,1)
				end
			end
		end
	end
end
function 玛拉顿到神庙()
	if zy=="法师" and 背包物品数量("传送符文")>0 then
		map = 地图名()
		if map == "凄凉之地" or map == "玛拉顿" then
			if zhenying == "联盟" then
				使用技能("传送：暴风城")
			else
				if 炉石位置() == "斯通纳德" then
					local t=0
					while 炉石可用() == false do 
						延时(1000)
						t=t+1
						if t > 60 then
							跳()
							延时(1000)
							t=0
						end
					end
					使用物品("炉石")
				else
					使用技能("传送：奥格瑞玛")
				end
			end
			延时(5000)
			while 读条中() do 
				延时(1000)
			end
			延时(5000)
			while 过图中() do 
				延时(1000)
			end
			延时(1000)
		end
		map=地图名()
		if zhenying == "联盟" then
			if map == "暴风城" or map == "艾尔文森林" or map=="暮色森林" or map=="逆风小径" or map=="悲伤沼泽" or map == "阿塔哈卡神庙" then
				if 小地图名() == "巫师圣殿" then
					走到(-9017.31, 885.528, 29.6207,1)
					朝向坐标(-9018.93, 887.626, 29.6207)
					移动("前",2500)
					路径走到("暴风城法师塔下到门口",-8979.27, 871.838, 121.892)
					走到(-8949.44, 888.771, 108.102)
					延时(300)
					走到(-8950.17, 897.858, 109.177,1)
					打开NPC("欧文·沃弗恩")
					延时(1000)
					对话选项(1)
					延时(1000)
					num=背包物品数量("传送符文")
					if num < 10 then
						延时(1000)
						购买物品(7,20-num)
						延时(1000)
					end
					走到(-8949.47, 889.04, 108.103)
					走到(-8966.65, 875.67, 106.153,1)
				end
				暴风到神庙()
			end
		else
			if map=="奥格瑞玛" then
				if 在坐标范围(1469.96, -4222.51, 58.9938,10) then
					走到(1477.38, -4221.53, 58.9938,1)
					走到(1489.46, -4224.26, 61.3785,1,1)
					上马()
					走到(1533.16, -4211.99, 41.7896,1)
				end
				num=背包物品数量("传送符文")
				if num < 6 then
					自动寻路(1634.97, -4265.83, 49.0335)
					走到(1684.65, -4277.89, 32.0049)
					走到(1716.2, -4303.71, 30.3827)
					走到(1730.22, -4327.14, 28.7524,1)
					走到(1743.38, -4318.63, 33.3815,1)
					打开NPC("霍苏斯")
					延时(1000)
					购买物品(7,20-num)
					延时(1000)
					走到(1730.22, -4327.14, 28.7524,1)
				end
			end
			if 地图名() ~= "悲伤沼泽" then
				奥格到斯通纳德()
			end
		end
	end
end
function 奥格到雷霆崖()
	map=地图名()
	if map == "奥格瑞玛" or map == "杜隆塔尔" then
		法师传送到("雷霆崖")
	end
	map=地图名()
	if map == "奥格瑞玛" or map == "杜隆塔尔" then
		路径走到("奥格飞行点下到法师传送",1656.82, -4357.65, 25.3364)
		奥格补充材料()
		if 法师传送到("雷霆崖") then
		else
			路径走到("奥格飞行点下到法师传送",1674.78, -4322.38, 61.2465)
			if 在坐标范围(1674.78, -4322.38, 61.2465,10) then
				走到(1676.46, -4315.67, 61.5217,1)
				if 打开NPC("多拉斯") then
					延时(500)
				else
					打开NPC("多拉斯")
					延时(500)
				end
				if 坐飞机到("雷霆崖") then
				elseif 坐飞机到("陶拉祖营地") then
				elseif 坐飞机到("十字路口") then
				end
			end
		end
	end
	while 在飞机上() do 
		延时(1000)
	end
	map=地图名()
	if map == "奥格瑞玛" or map == "杜隆塔尔" then
		自动寻路(321.562, -3622.53, 27.2759)
	end
	if 地图名() == "贫瘠之地" then
		x,y,z = 当前坐标()
		if x > - 2000 then
			自动寻路(-438.84, -2597.81, 95.7877)
			打开NPC("迪弗拉克")
			延时(500)
		end
		路径走到("十字路口到陶拉祖营地",-2381.95, -1881.55, 95.8503)
		打开NPC("欧姆萨·雷角")
		延时(500)
		路径走到("陶拉祖营地到雷霆崖电梯",-1315.87, 182.264, 68.5519)
	end
	map = 地图名()
	if map == "莫高雷" or map == "雷霆崖" then
		x,y,z = 当前坐标()
		if z < 80 then
			路径走到("陶拉祖营地到雷霆崖电梯",-1315.87, 182.264, 68.5519)
			坐船()
		end
		if zy == "法师" and not 存在技能("传送：雷霆崖") then
			路径走到("雷霆崖传送点到电梯",-966.942, 283.09, 110.744)
			打开NPC("比尔吉特·克兰斯顿")
			延时(1000)
			对话选项(1)
			延时(1000)
			学习技能()
		end
		x,y,z = 当前坐标()
		if z < 145 then
			if 在路径范围("雷霆崖传送点到电梯") then
				路径走到("雷霆崖传送点到电梯",-1209.47, 130.584, 134.497)
			end
			路径走到("雷霆崖到飞机点",-1251.01, 66.7901, 127.379)
		end
	end
end
function 神庙到玛拉顿()
	if zy=="法师" then
		if zhenying == "联盟" then
			if 地图名() == "阿塔哈卡神庙" then
				lsmap=炉石位置()
				if lsmap == "石爪峰" or lsmap=="尼耶尔前哨站" then
					while 炉石可用() == false do 
						延时(2000)
					end
					使用物品("炉石")
					延时(15000)
					while 过图中() do 
						延时(1000)
					end
					延时(1000)
				end
			end
		else
			if 地图名() == "阿塔哈卡神庙" then
				num = 背包物品数量("传送符文")
				if num>0 then
					if num>6 and 存在技能("传送：雷霆崖") then
						法师传送到("雷霆崖")
					else
						法师传送到("奥格瑞玛")
					end
				end
			end
			if 地图名()=="奥格瑞玛" then
				if 在坐标范围(1469.96, -4222.51, 58.9938,10) then
					走到(1477.38, -4221.53, 58.9938,1)
					走到(1489.46, -4224.26, 61.3785,1,1)
					上马()
					走到(1533.16, -4211.99, 41.7896,1)
				end
				num=背包物品数量("传送符文")
				if num < 6 then
					自动寻路(1634.97, -4265.83, 49.0335)
					走到(1684.65, -4277.89, 32.0049)
					走到(1716.2, -4303.71, 30.3827)
					走到(1730.22, -4327.14, 28.7524,1)
					走到(1743.38, -4318.63, 33.3815,1)
					打开NPC("霍苏斯")
					延时(1000)
					购买物品(7,20-num)
					延时(1000)
					走到(1730.22, -4327.14, 28.7524,1)
					延时(1000)
				end
				if not 在坐标范围(1533.16, -4211.99, 41.7896,20) then
					if 法师传送到("雷霆崖") then
						
					elseif 法师传送到("奥格瑞玛") then
						
					end
				end
				if 在坐标范围(1469.96, -4222.51, 58.9938,10) then
					走到(1477.38, -4221.53, 58.9938,1)
					走到(1489.46, -4224.26, 61.3785,1,1)
					上马()
					走到(1533.16, -4211.99, 41.7896,1)
				end
				if 地图名() == "奥格瑞玛" then
					路径走到("奥格瑞玛法师传送到飞行点",1673.84, -4324.13, 61.2462)
					走到(1676.77, -4314.99, 61.537,1)
					下马()
					打开NPC("多拉斯")
					延时(500)
					打开NPC("多拉斯")
					延时(1500)
					if 坐飞机到("雷霆崖") then
						while 在飞机上() do 
							延时(1000)
						end
					elseif 坐飞机到("陶拉祖营地") then
						while 在飞机上() do 
							延时(1000)
						end
					elseif 坐飞机到("十字路口") then
						while 在飞机上() do 
							延时(1000)
						end
					else
						走到(1673.84, -4324.13, 61.2462,1)
						路径走到("奥格瑞玛法师传送到飞行点",1533.16, -4211.99, 41.7896)
					end
				end
			end
			奥格到雷霆崖()
			雷霆崖补充材料(1)
			if 地图名() == "雷霆崖" then
				路径走到("雷霆崖到飞机点",-1197.18, 27.5771, 176.948)
				打开NPC("塔尔")
				延时(500)
				打开NPC("塔尔")
				延时(1000)
				if 坐飞机到("葬影村") then
					while 在飞机上() do 
						延时(1000)
					end
				end
			end
		end
	end
end
function 紧急绕圈()
	if HP() == 0 then
		return
	end
	走到(788.332, -495.328, -53.199)
	闪现走到(813.444, -482.421, -54.9683)
	走到(847.318, -438.741, -56.2882)
	走到(873.853, -397.997, -51.8397)
	走到(875.319, -382.125, -52.0495)
	走到(868.068, -364.999, -52.0495)
	走到(819.97, -349.095, -51.5785)
	闪现走到(781.124, -336.584, -50.0664)
	走到(764.394, -330.956, -51.2556)
	走到(758.519, -332.412, -51.2854)
	走到(754.505, -349.557, -50.6628,1)
	if HP() == 0 then
		return
	end
	local n=0
	while MLD_坐标范围精英数量(764.394, -330.956, -51.2556,18,3)==0 and HP()>0 do 
		延时(200)
		n=n+1
		if n>50 then 
			break
		end
	end
	使用技能("暴风雪(等级 1)")
	指向坐标(773.264, -336.486, -50.1461)
	for i=1,77 do 
		延时(100)
		if MLD_坐标范围精英数量(754.505, -349.557, -50.6628,10,3) > 0 then
			break
		end
	end
	走到(775.53, -363.384, -61.3784)
	走到(784.654, -373.965, -58.9068)
	闪现走到(799.933, -404.434, -57.6986)
	走到(802.486, -423.907, -53.581)
	走到(820.673, -457.035, -56.2943)
	走到(809.721, -482.575, -54.5973)
	走到(779.461, -520.494, -51.5151)
	走到(781.963, -524.368, -49.7942)
	走到(790.212, -526.28, -47.3518)
	走到(798.693, -521.036, -43.3642)
	走到(803.26, -514.649, -41.5514)
	走到(803.641, -506.569, -40.9157)
	闪现走到(790.643, -487.724, -39.8816,1)
	if HP() == 0 then
		return
	end
	zz = 种族()
	if zz=="巨魔" then
		if xb=="女" then
			走到(787.267, -489.4, -39.9118,1,0,0.2)
		else
			走到(787.267, -489.4, -39.9118,1,0,0.2)
		end
	elseif zz=="亡灵" then
		if xb=="女" then
			走到(787.267, -490.32, -39.9218,1,0,0.4)
		else
			走到(787.267, -490.1, -39.9218,1,0,0.35)
		end
	else
		if xb=="女" then
			走到(787.267, -490.5, -39.9218,1,0,0.25)
		else
			走到(787.267, -490.26, -39.9218,1,0,0.35)
		end
		--走到(787.24, -490.491, -39.9118,1,0,0.15)
		--走到(787.501, -490.32, -39.9105,1,0,0.15)
	end
	if MP() < 4000 then
		使用物品("法力红宝石")
		使用物品("强效法力药水")
	end
	if HP() == 0 then
		return
	end
	延时(3000)
	使用技能("暴风雪(等级 1)")
	if zr==1 then
		指向坐标(779.5287476, -521.2930908, -49.66462555)
	else
		指向坐标(780.1160889, -521.0947266, -50.26462555)
	end
	延时(7700)
	if HP() == 0 then
		return
	end
	if MP()>1200 or 存在BUFF("节能施法") then
		使用技能("暴风雪")
	else
		使用技能("暴风雪(等级 1)")
	end
	if zz=="巨魔" then
		指向坐标(787.9094238, -523.5299438, -45.09235382)
	else
		指向坐标(790.5057983, -524.0270996, -47.43112564)
	end
	kk=os.clock()
	for i=1,76 do
		延时(100)
		if not 读条中() or os.clock()-kk>6.8 or MLD_坐标范围精英数量(801.5997314,-514.8057861,-41.82994843,5,2)>0 then
			break
		end
	end
	if HP() == 0 then
		return
	end
	local xuyidong=0
	local dxg=0
	if 坐标范围怪物数量(781.205, -521.436, -50.842,6,"毒劣魔") > 0 then
		dxg=1
	end
	local ww=0
	for ii=1,2 do
		if ii==1 then
			if dxg==1 then
				if 高处下雪2() then
				end
			else
				if 高处下雪2(1) then
					
				end
			end
		else
			走到(784.3, -490.919, -40.0578,1)
			if MLD_坐标范围精英数量(784.344, -491.667, -40.0322,23,3)>0 then
				if MP()>1200 or 存在BUFF("节能施法") then
					使用技能("暴风雪")
				else
					使用技能("暴风雪(等级 1)")
				end
				指向坐标(800.38, -504.387, -40.6264)
			else
				if 高处下雪2() then
				end
			end
		end
		if ii==1 then
			ww=6
			延时(1000)
		else
			ww=6
			延时(2000)
		end
		kk=os.clock()
		for i=1,77 do
			延时(100)
			if os.clock()-kk>ww then
				延时(500)
				return
			end
			if not 读条中() then
				break
			end
			if MLD_坐标范围精英数量(784.344, -492.667, -40.0322,10,3)>0 then
				朝向坐标(781.498, -497.127, -42.7763) --下面
				按键("w",1)
				使用技能("寒冰护体")
				走到(781.498, -497.127, -42.7763,1) --下面
				return
			end
		end
		if MLD_坐标范围精英数量(784.344, -492.667, -40.0322,13,3)>0 then
			朝向坐标(781.498, -497.127, -42.7763) --下面
			按键("w",1)
			使用技能("寒冰护体")
			走到(781.498, -497.127, -42.7763,1) --下面
			return
		end
		if HP() == 0 then
			return
		end
	end
end
function 监狱30技能()
	if zy=="法师" and not 存在技能("传送：暴风城") and (地图名() == "暴风城" or 地图名() == "艾尔文森林") then
		自动寻路(-9002.05, 844.87, 106.037)
		路径寻路("暴风城法师塔下到门口")
		移动("前",2000)
		走到(-8991.76, 848.053, 29.6207,1)
		打开NPC("拉瑞麦尼·普尔度")
		延时(1000)
		对话选项(1)
		延时(1000)
		学习技能()
		延时(1000)
		走到(-8990.52, 861.724, 29.6207,1)
		执行脚本("暴风城传送出门.lua")
		走到(-8949.44, 888.771, 108.102)
		延时(300)
		走到(-8950.17, 897.858, 109.177,1)
		打开NPC("欧文·沃弗恩")
		延时(1000)
		对话选项(1)
		延时(1000)
		num=背包物品数量("传送符文")
		if num < 5 then
			延时(1000)
			购买物品(7,20-num)
		end
	end
end
if lastt == nil then
	lastt=0
end
function MLD3()
	if HP()==0 then
		释放灵魂()
	end
	策略检查()
	邀请小号()
	需要重置=0
	MLD进本(1)
	策略检查()
	if 地图名() == "玛拉顿" and 在副本() then
		if 需要修理() then
			回城售卖()
			需要重置=0
			MLD进本(1)
			策略检查()
		end
		MLD跑路()
		邀请小号()
		local wi=0
		while os.clock() - lastt < 2400 and lastt>0 do 
			延时(60000)
			跳()
			延时(60000)
		end
		lastt=os.clock()
		瀑布拉怪()
		g_shiqu=0
		while 战斗中() and HP() > 0 do 
			sw=简单杀怪()
			if sw == 2 then
				break
			end
			if MLD_坐标范围精英数量(795.2208862,-522.6564941,-44.78491211,40) == 0 then
				break
			end
			if not 在坐标范围(781.498, -497.127, -42.7763,50) then
				break
			end
		end
		--[[if not 在坐标范围(781.498, -497.127, -42.7763,40) and HP() > 0 then
			传送处理()
		end--]]
		需要重置=0
		if HP() > 1 then
			if g_shiqu==1 then
				MLD收尾(0,1)
			else
				双门收尾(1)
			end
		else
			释放灵魂()
		end
	end
end
function 采集复活()
	if HP() == 0 then
		释放灵魂()
	end
	if HP() == 1 then
		x,y,z = 尸体坐标()
		自动寻路(x,y,z,25)
		复活()
		延时(200)
		if zy=="潜行者" then
			使用技能("潜行")
		end
	end
end
function 提瑞斯法林地到奥格()
	if 地图名() == "血色修道院" or 地图名() == "提瑞斯法林地" then
		if zy == "法师" then
			if 法师传送到("奥格瑞玛") then
				return
			end
		end
		if 地图名() == "血色修道院" then
			炉石()
		end
	end
	if 地图名() == "幽暗城" then
		x,y,z = 当前坐标()
		if z < 50 then
			路径走到("幽暗城法师传送到旅店电梯",1595.18, 176.086, -41.4176)
			坐船()
		end
		路径走到("布瑞尔旅店到幽暗电梯上",2024.18, 289.523, 50.534)
	end
	if 小地图名()=="洛丹伦废墟" then
		路径走到("布瑞尔旅店到幽暗电梯上",2024.18, 289.523, 50.534)
	end
	if 地图名() == "提瑞斯法林地" then
		x,y,z = 当前坐标()
		if z < 90 then
			自动寻路(2065.16, 280.628, 60.0469)
		end
		路径走到("幽暗城上层到AG飞艇",2067.11, 288.706, 97.0314)
		朝向坐标(2067.31, 290.38, 97.0314)
		坐船()
	end
	if 地图名() == "杜隆塔尔" then
		if 在坐标范围(1325.02, -4652.72, 53.7963,20) then
			走到(1322.28, -4641.26, 54.2454,1)
			走到(1316.42, -4608.24, 24.4115,1)
		end
		自动寻路(1656.82, -4357.65, 25.3364)
	end
end
function 奥格补充材料()
	if 地图名() == "奥格瑞玛" then
		if 在坐标范围(1469.96, -4222.51, 58.9938,10) then
			走到(1477.38, -4221.53, 58.9938,1)
			走到(1489.46, -4224.26, 61.3785,1,1)
			上马()
			走到(1533.16, -4211.99, 41.7896,1)
		end
		if zy=="法师" then
			local num = 背包物品数量("传送符文")
			if 存在技能("召唤餐桌") then
				num2 = 背包物品数量("魔粉")
			else
				num2 = 100
			end
			if num < 6 or num2 < 20 then
				自动寻路(1634.97, -4265.83, 49.0335)
				走到(1684.65, -4277.89, 32.0049)
				走到(1716.2, -4303.71, 30.3827)
				走到(1730.22, -4327.14, 28.7524,1)
				走到(1743.38, -4318.63, 33.3815,1)
				打开NPC("霍苏斯")
				延时(1000)
				if num < 6 then
					购买物品(7,20-num)
				end
				if num2 < 20 then
					购买物品(9,20-num2)
				end
				延时(1000)
				走到(1730.22, -4327.14, 28.7524,1)
				延时(1000)
				自动寻路(1656.82, -4357.65, 25.3364)
			end
		end
		x,y,z = 当前坐标()
		if z <30 then
			自动寻路(1656.82, -4357.65, 25.3364)
			if zy == "潜行者" then
				num = 背包物品数量("闪光粉")
				if num < 20 then
					路径走到("奥格瑞玛毒药商",1810.02, -4272.24, 7.05208)
					打开NPC("雷库尔")
					延时(1000)
					if 背包物品数量("潜行者工具")==0 then
						购买物品(1,1)
					end
					local ci,i=0,0
					ci=math.modf((40-num)/20)
					for i=1,ci do
						购买物品(5,20)
						延时(1000)
					end
					if (40-num)%20 > 0 then
						购买物品(5,(40-num)%20)
						延时(1000)
					end
					路径走到("奥格瑞玛毒药商",1656.82, -4357.65, 25.3364)
				end
			end
		end
	end
end
function 布瑞尔到陶拉祖营地()
	提瑞斯法林地到奥格()
	if 地图名() == "雷霆崖" then
		路径走到("雷霆崖到飞机点",-1197.18, 27.5771, 176.948)
		打开NPC("塔尔")
		打开NPC("塔尔")
		if zy == "潜行者" and 背包物品数量("闪光粉") < 20 then
			坐飞机到("奥格瑞玛")
		else
			if 坐飞机到("陶拉祖营地") then
			elseif 坐飞机到("十字路口") then
			elseif 坐飞机到("奥格瑞玛") then
			end
		end
	end
	while 在飞机上() do 
		延时(1000)
	end
	if 地图名() == "奥格瑞玛" then
		奥格补充材料()
		路径走到("奥格飞行点下到法师传送",1674.78, -4322.38, 61.2465)
		if 在坐标范围(1674.78, -4322.38, 61.2465,10) then
			走到(1676.46, -4315.67, 61.5217,1)
			if 打开NPC("多拉斯") then
				延时(500)
			else
				打开NPC("多拉斯")
				延时(500)
			end
			if 坐飞机到("陶拉祖营地") then
			elseif 坐飞机到("十字路口") then
			end
		end
	end
	if 在飞机上() then
		while 在飞机上() do 
			延时(1000)
		end
	end
	if 地图名() == "奥格瑞玛" then
		走到(1673.84, -4324.13, 61.2462,1)
		路径走到("奥格瑞玛法师传送到飞行点",1533.16, -4211.99, 41.7896)
	end
	map=地图名()
	if map == "奥格瑞玛" or map == "杜隆塔尔" then
		自动寻路(321.562, -3622.53, 27.2759)
	end
	if 地图名() == "贫瘠之地" then
		x,y,z = 当前坐标()
		if x > -2000 and not 在坐标范围(-438.84, -2597.81, 95.7877,20) then
			自动寻路(-438.84, -2597.81, 95.7877)
			打开NPC("迪弗拉克")
			延时(500)
		end
		x,y,z = 当前坐标()
		if x > -2300 then
			路径走到("十字路口到陶拉祖营地",-2381.95, -1881.55, 95.8503)
			打开NPC("欧姆萨·雷角")
			延时(500)
		end
		if 在坐标范围(-2516.14, -1961.31, 91.7839,30) then
			走到(-2511.89, -1946.26, 91.7839)
			走到(-2533.44, -1924.41, 92.0282,1)
		end
	end
end
function 前哨站到羽月要塞()
	if zhenying == "联盟" then
		纵向角度(0.65)
		路径走到("尼耶尔前哨站到羽月要塞",-4371.53, 3339.09, 12.2681)
		打开NPC("菲尔迪恩·月羽")
		延时(500)
		走到(-4376.79, 3291.43, 13.5556,1)
	end
end
function 石爪峰到羽月要塞()
	local feile=0
	while 在飞机上() do 
		延时(1000)
	end
	if 在坐标范围(2729.8, 1499.16, 236.829,40) then
		路径走到("石爪峰修理",2680.65, 1486.26, 233.997)
		发送邮件()
	end
	if 在坐标范围(2680.65, 1486.26, 233.997,40) then
		上马()
		路径走到("石爪峰修理",2689.87, 1517, 234.882)
		if 打开NPC("伊林安尼") then
			延时(1000)
			for i=1,3 do 
				延时(1000)
				出售垃圾()
			end
		end
	end
	if 在坐标范围(2689.87, 1517, 234.882,150) then
		路径走到("石爪峰修理",2682.17, 1467.43, 233.56)
		if 打开NPC("泰罗伦") then
			对话选项(1)
			延时(500)
			if 坐飞机到("羽月要塞") then
			elseif 坐飞机到("凄凉之地") then
				feile=1
			end
			延时(1000)
		end
	end
	while 在飞机上() do 
		延时(1000)
	end
	map = 地图名()
	if 在坐标范围(139.24, 1325.82, 193.5,200) or feile == 1 and (map == "凄凉之地" or map == "菲拉斯") then
		前哨站到羽月要塞()
	end
end
function 可循环()
	if HP() > 1 and not 战斗中() then
		return true
	end
	return false
end
function MLD采集(mangmucao)
	if mangmucao == nil then
		mangmucao=0
	end
	minck,maxck = 专业信息("采矿")
	local caikuang=0
	if minck >= 175 then
		caikuang=1
	end
	if 在坐标范围(755.078, -617.696, -32.9222,30) then
		if zy == "法师" then
			使用技能("冰甲术")
		end
		走到(766.518, -604.72, -32.7245)
		if zy == "法师" then
			使用技能("奥术智慧")
		else
			潜行()
		end
		走到(789.369, -591.532, -33.1097,1)
		走到(789.415, -582.522, -33.1225,1)
		if zy == "法师" then
			闪现走到(780.331, -546.915, -32.7615,1)
			走到(782.301, -543.447, -33.3067,1)
			if 战斗中() then
				使用技能("寒冰护体")
				延时(1400)
				while 战斗中() do 
					x,y,z = 当前坐标()
					if 坐标范围怪物数量(x,y,z,6,"魔") > 0 then
						使用技能("魔爆术")
						延时(1400)
					else
						x,y,z = 目标坐标()
						if x~=0 then
							朝向坐标(x,y,z)
							按键("w")
							延时(100)
							使用技能("寒冰箭")
							延时(500)
							while 读条中() do 
								延时(100)
							end
							if 技能可用("火焰冲击") then
								使用技能("火焰冲击")
								延时(500)
							end
						end
					end
				end
			end
		else
			while 坐标范围怪物数量(781.741, -567.627, -32.8314,20,"魔",1) > 0 and 可循环() do 
				延时(1000)
			end
			走到(780.331, -546.915, -32.7615,1)
			走到(782.301, -543.447, -33.3067,1)
			if 战斗中() then
				if zy == "潜行者" then
					使用技能("消失")
					延时(800)
				end
				while 战斗中() do 
					技能输出()
				end
			end
		end
		走到(784.589, -541.794, -33.4387,1)
		if 坐标范围有采集物(784.589, -541.794, -33.4387,5) then
			范围采集(5)
		else
			延时(2000)
		end
	end
	if 在坐标范围(784.589, -541.794, -33.4387,10) then
		if zz ~= "侏儒" and 坐标范围有采集物(716.474,-509.132,-36.4142,5) then
			if zy ~= "法师" then
				潜行()
			end
			while 坐标范围怪物数量(781.741, -567.627, -32.8314,25,"魔",1) > 0 and 可循环() do 
				延时(1000)
			end
			走到(766.554, -575.745, -33.1882,1)
			走到(753.489, -563.577, -33.1271)
			走到(740.26, -560.729, -33.174,1)
			走到(729.218, -543.387, -33.5356,1)
			走到(722.571, -515.269, -41.3911,1)
			走到(720.513, -511.519, -41.2353,1)
			if zy ~= "法师" then
				取消BUFF("潜行")
			end
			朝向坐标(719.911, -509.801, -39.665)
			移动("前",1000)
			延时(200)
			while HP()>1 do
				写入朝向(2.1)
				跳()
				延时(200)
				按键("w",1)
				延时(300)
				按键("w",2)
				延时(800)
				x,y,z =当前坐标()
				if z > -40 then
					break
				end
			end
			范围采集(7)
			走到(720.321, -512.423, -41.2514,1)
			if zy ~= "法师" then
				潜行()
			end
			走到(722.97, -517.245, -41.2537)
			走到(724.2, -528.491, -39.5945)
			走到(729.949, -545.922, -33.2473)
			走到(737.112, -555.618, -33.1069)
			走到(740.609, -560.345, -33.1499)
			走到(750.331, -562.998, -33.1501)
			走到(756.909, -567.406, -33.1949)
			走到(766.554, -575.745, -33.1882,1)
			while 坐标范围怪物数量(765.725, -560.617, -32.8232,25,"魔",1) > 0 and 可循环() do 
				延时(1000)
			end
			走到(784.903, -541.976, -33.2787,1)
		end
		while 坐标范围怪物数量(786.338, -527.552, -47.5066,25,"深腐",1) > 0 and 可循环() do 
			延时(1000)
		end
		走到(788.746, -515.408, -52.8226,1)
		
	end
	if 在坐标范围(788.746, -515.408, -52.8226,11) then
		if zy == "法师" then
			闪现走到(825.117, -470.256, -55.8983,1)
		else
			if 存在BUFF("潜行") then
				取消BUFF("潜行")
			end
			走到(825.117, -470.256, -55.8983)
		end
		走到(816.75, -458.317, -56.0638,1)
		延时(2000)
	end
	if 在坐标范围(816.75, -458.317, -56.0638,11) then
		if 坐标范围有采集物(793.402, -401.91, -54.1777,5) then
			走到(820.414, -455.494, -56.3045,1)
			走到(816.148, -449.569, -56.2765,1)
			if zy == "法师" then
				while 坐标范围怪物数量(806.019, -435.469, -54.5759,20,"深腐",1) > 0 and 可循环() do 
					延时(500)
				end
			else
				潜行()
			end
			走到(806.062, -427.317, -53.61)
			走到(802.336, -422.367, -53.5248)
			走到(803.111, -416.83, -54.0027)
			走到(806.913, -412.272, -55.3378,1)
			while 坐标范围怪物数量(798.469, -408.811, -55.7559,15,"深腐",1) > 0 and 可循环() do 
				延时(500)
			end
			走到(798.469, -408.811, -55.7559)
			走到(792.226, -402.22, -54.0675,1,1,3)
			范围采集(5)
			if zy == "法师" then
				while 坐标范围怪物数量(806.019, -435.469, -54.5759,20,"深腐",1) > 0 and 可循环() do 
					延时(500)
				end
			end
			while 坐标范围怪物数量(798.469, -408.811, -55.7559,10,"深腐",1) > 0 and 可循环() do  
				延时(500)
			end
			if zy == "法师" then
				while 坐标范围怪物数量(806.019, -435.469, -54.5759,20,"深腐",1) > 0 and 可循环() do 
					延时(500)
				end
			else
				潜行()
			end
			走到(805.112, -412.793, -55.1846)
			走到(801.985, -420.904, -53.5251)
			走到(806.768, -428.506, -53.7803,1)
			走到(826.545, -437.244, -56.2329)
			走到(833.088, -437.767, -55.9992)
			走到(846.74, -427.494, -54.6882)
		elseif 坐标范围有采集物(830.062, -369.684, -58.67, 5) then
			走到(820.414, -455.494, -56.3045,1)
			走到(816.148, -449.569, -56.2765,1)
			if zy == "法师" then
				while 坐标范围怪物数量(806.019, -435.469, -54.5759,20,"深腐",1) > 0 and 可循环() do 
					延时(500)
				end
			end
			走到(806.062, -427.317, -53.61)
			走到(802.336, -422.367, -53.5248,1)
			if zy ~= "法师" then
				潜行()
			end
			走到(803.111, -416.83, -54.0027)
			走到(806.913, -412.272, -55.3378)
			走到(818.429, -400.362, -57.9003)
			走到(829.964, -381.237, -58.9667)
			if zy == "潜行者" then
				if 战斗中() then
					使用技能("消失")
				end
			end
			走到(828.97, -368.882, -58.8284,1)
			范围采集(5)
			走到(828.976, -374.542, -58.5473)
			走到(826.89, -389.616, -59.2232)
			走到(815.534, -404.979, -57.2431,1)
			if zy == "法师" then
				while 坐标范围怪物数量(806.019, -435.469, -54.5759,20,"深腐",1) > 0 and 可循环() do  
					延时(500)
				end
			end
			while 坐标范围怪物数量(798.469, -408.811, -55.7559,10,"深腐",1) > 0 and 可循环() do 
				延时(500)
			end
			if zy == "法师" then
				while 坐标范围怪物数量(806.019, -435.469, -54.5759,20,"深腐",1) > 0 and 可循环() do 
					延时(500)
				end
			else
				潜行()
			end
			走到(805.112, -412.793, -55.1846)
			走到(801.985, -420.904, -53.5251)
			走到(806.768, -428.506, -53.7803,1)
			走到(826.545, -437.244, -56.2329)
			走到(833.088, -437.767, -55.9992)
			if zy == "潜行者" then
				if 战斗中() then
					使用技能("消失")
				end
			end
			走到(846.74, -427.494, -54.6882)
		else
			走到(820.312, -454.717, -56.309,1)
			if zy == "法师" then
				while 坐标范围怪物数量(815.07, -439.716, -55.8576,30,"深腐",1) > 1 and 可循环() do 
					延时(500)
				end
			else
				潜行()
			end
			走到(820.429, -435.818, -56.0652)
			走到(826.545, -437.244, -56.2329)
			走到(833.088, -437.767, -55.9992)
			走到(846.74, -427.494, -54.6882)
			if zy == "潜行者" then
				if 战斗中() then
					使用技能("消失")
				end
			end
		end
		走到(856.23, -419.123, -52.4551)
		走到(868.754, -403.681, -52.1554,1)
		走到(872.529, -399.419, -51.7323,1)
		走到(873.902, -386.365, -52.0489,1)
		if zy ~= "法师" then
			取消BUFF("潜行")
		end
		走到(873.03, -377.627, -52.0489)
		走到(866.813, -364.868, -52.0495,1)
		走到(858.247, -362.269, -51.6738,1)
	end
	if 在坐标范围(858.247, -362.269, -51.6738,11) then
		while 坐标范围怪物数量(854.942, -347.524, -52.0496,20,"深腐践踏者|巡影者",1) > 0 and 可循环() do  
			延时(500)
		end
		while 坐标范围怪物数量(829.757, -340.312, -51.7176,20,"深腐践踏者|巡影者",1) > 0 and 可循环() do 
			延时(500)
		end
		while 坐标范围怪物数量(854.942, -347.524, -52.0496,20,"深腐践踏者|巡影者",1) > 0 and 可循环() do 
			延时(500)
		end
		走到(844.775, -325.659, -51.5763,1)
	end
	if 在坐标范围(844.775, -325.659, -51.5763,15) then
		if 坐标范围有采集物(854.413, -323.21, -51.5783,5) then
			走到(854.413, -323.21, -51.5783,1,0,2)
			延时(300)
			范围采集(5)
		end
		走到(832.417, -327.379, -51.5763,1)
		走到(823.547, -334.43, -51.5787)
		走到(820.35, -339.689, -51.6281,1)
		while 坐标范围怪物数量(820.35, -339.689, -51.6281,15,"深腐践踏者|巡影者",1) > 0 and 可循环() do 
			延时(500)
		end
		走到(812.271, -356.282, -51.4767,1)
		延时(1000)
	end
	if 在坐标范围(812.271, -356.282, -51.4767,15) then
		if 坐标范围有采集物(830.062, -369.684, -58.67, 5) then
			走到(828.657, -362.868, -59.1891)
			走到(830.062, -369.684, -58.67,1)
			延时(300)
			范围采集(5)
			走到(828.976, -374.542, -58.5473)
			走到(826.89, -389.616, -59.2232)
			走到(815.534, -404.979, -57.2431,1)
			while 坐标范围怪物数量(806.019, -435.469, -54.5759,20,"深腐",1) > 0 and 可循环() do 
				延时(500)
			end
			while 坐标范围怪物数量(798.469, -408.811, -55.7559,10,"深腐",1) > 0 and 可循环() do 
				延时(500)
			end
			while 坐标范围怪物数量(806.019, -435.469, -54.5759,20,"深腐",1) > 0 and 可循环() do 
				延时(500)
			end
			走到(805.112, -412.793, -55.1846)
			走到(801.985, -420.904, -53.5251)
			走到(818.841, -453.747, -56.2926,1)
			走到(827.636, -465.348, -56.1761,1)
			if 战斗中() then
				使用技能("寒冰护体")
				走到(822.626, -465.696, -56.0967)
				使用技能("冰霜新星(等级 1)")
				走到(810.456, -487.393, -54.5689,1)
				技能输出()
				走到(827.636, -465.348, -56.1761,1)
			end
			走到(837.367, -457.392, -56.1481)
			走到(844.07, -452.241, -56.1693)
			if zy == "法师" then
				闪现走到(841.695, -431.151, -56.2361)
			else
				if not 存在BUFF("潜行") then
					使用技能("潜行")
				end
			end
			走到(856.23, -419.123, -52.4551)
			走到(868.754, -403.681, -52.1554,1)
			if zy ~= "法师" then
				取消BUFF("潜行")
			end
			走到(872.529, -399.419, -51.7323,1)
			走到(873.902, -386.365, -52.0489,1)
			走到(873.03, -377.627, -52.0489)
			走到(866.813, -364.868, -52.0495,1)
			走到(858.247, -362.269, -51.6738,1)
			if 在坐标范围(858.247, -362.269, -51.6738,11) then
				while 坐标范围怪物数量(854.942, -347.524, -52.0496,20,"深腐践踏者|巡影者",1) > 0 and 可循环() do 
					延时(500)
				end
				while 坐标范围怪物数量(829.757, -340.312, -51.7176,20,"深腐践踏者|巡影者",1) > 0 and 可循环() do 
					延时(500)
				end
				while 坐标范围怪物数量(854.942, -347.524, -52.0496,20,"深腐践踏者|巡影者",1) > 0 and 可循环() do 
					延时(500)
				end
				走到(844.775, -325.659, -51.5763,1)
			end
			if 在坐标范围(844.775, -325.659, -51.5763,15) then
				if 坐标范围有采集物(854.413, -323.21, -51.5783,5) then
					走到(854.413, -323.21, -51.5783,1,0,4)
					延时(300)
					范围采集(5)
				end
				走到(832.417, -327.379, -51.5763,1)
				走到(823.547, -334.43, -51.5787,1)
				while 坐标范围怪物数量(812.271, -356.282, -51.4767,15,"深腐践踏者|巡影者",1) > 0 and 可循环() do 
					延时(500)
				end
				走到(812.271, -356.282, -51.4767,1)
			end
		end
		走到(801.435, -351.188, -51.5859,1)
		走到(784.072, -339.628, -50.2891)
		走到(768.442, -333.383, -50.7019,1)
		走到(766.944, -333.339, -50.9001,1)
		if 坐标范围有采集物(753.596, -322.001, -51.5766,5) then
			while 坐标范围怪物数量(753.596, -322.001, -51.5766,15,"深腐践踏者|巡影者",1) > 0 and 可循环() do 
				延时(500)
			end
			走到(753.232, -320.83, -51.5766,1)
			延时(300)
			范围采集(5)
		end
		if zy == "法师" then
			使用技能("寒冰护体")
		else
			使用技能("潜行")
		end
		延时(500)
		while 坐标范围怪物数量(745.523, -332.114, -50.6224,15,"深腐践踏者|巡影者",1) > 0 and 可循环() do 
			延时(500)
		end
		走到(745.523, -332.114, -50.6224)
		if zy == "法师" then
			闪现走到(718.186, -322.614, -51.1647)
		else
			朝向坐标(718.186, -322.614, -51.1647)
			移动("左",1000)
			走到(718.186, -322.614, -51.1647)
		end
		走到(715.086, -318.519, -51.0657,1)
	end
	if 在坐标范围(715.086, -318.519, -51.0657,20) then
		if 战斗中() then
			if zy == "潜行者" then
				使用技能("消失")
				延时(1000)
			end
			if 战斗中() then
				走到(698.698, -311.533, -52.0184,1)
				走到(695.642, -310.959, -50.3797,1,1,2)
				while 战斗中() do 
					延时(1000)
					if zy == "潜行者" then
						使用技能("消失")
						延时(1000)
					end
				end
				延时(2000)
				while 战斗中() do 
					延时(1000)
					if zy == "潜行者" then
						使用技能("消失")
						延时(1000)
					end
				end
				if HP() == 0 then
					return
				end
				走到(709.587, -315.689, -51.3306,1,1)
			end
		end
		走到(709.587, -315.689, -51.3306,1)
		if zy ~= "法师" then
			取消BUFF("潜行")
		end
		while 坐标范围怪物数量(711.379, -330.612, -51.8762,20,"深腐|巡影者",1) > 0 and 可循环() do 
			延时(500)
		end
		走到(714.739, -353.401, -52.0181,1)
		while 坐标范围怪物数量(705.555, -353.181, -52.0181,10,"深腐",1) > 0 and 可循环() do 
			延时(500)
		end
		走到(708.747, -360.521, -52.0184)
		走到(693.032, -360.525, -52.1574)
		走到(677.462, -372.018, -52.1416)
		走到(676.63, -382.787, -52.0204,1)
		if 坐标范围有采集物(677.736,-382.136,-52.0194,5) then
			范围采集(5)
		end
	end
	if 在坐标范围(676.63, -382.787, -52.0204,10) then
		走到(669.176, -379.106, -52.0193,1)
	end
	if 在坐标范围(669.176, -379.106, -52.0193,15) then
		while 坐标范围怪物数量(670.287, -369.581, -52.0491,20,"深腐",1) > 0 and 可循环() do 
			延时(500)
		end
		if 坐标范围有采集物(618.648, -376.273, -52.0207,5) then
			走到(655.804, -364.231, -52.0206,1)
			走到(637.132, -360.572, -52.0206,1)
			走到(625.788, -361.634, -52.0206,1)
			走到(623.892, -359.682, -52.0206,1)
			
			while 坐标范围怪物数量(613.528, -365.32, -52.0207,10,"深腐|巡影者",1) > 0 and 可循环() do 
				延时(500)
			end
			走到(621.189, -360.401, -52.0206,1)
			走到(615.374, -370.963, -52.0206,1)
			走到(618.648, -376.273, -52.0207,1)
			范围采集(5)
			while 坐标范围怪物数量(613.528, -365.32, -52.0207,10,"深腐|巡影者",1) > 0 and 可循环() do 
				延时(500)
			end
			走到(615.374, -370.963, -52.0206,1)
			走到(621.189, -360.401, -52.0206,1)
			走到(623.892, -359.682, -52.0206,1)
			走到(627.652, -362.22, -52.0194,1)
			走到(637.132, -360.572, -52.0206,1)
			走到(655.804, -364.231, -52.0206,1)
			走到(669.176, -379.106, -52.0193,1)
			while 坐标范围怪物数量(670.287, -369.581, -52.0491,20,"深腐",1) > 0 and 可循环() do 
				延时(500)
			end
		end
		走到(665.911, -354.404, -52.5135,1)
	end
	if 在坐标范围(665.911, -354.404, -52.5135,15) then
		while 坐标范围怪物数量(663.175, -338.842, -52.2874,15,"巡影者",1) > 0 and 可循环() do 
			延时(500)
		end
		if zy ~= "法师" then
			使用技能("疾跑")
		end
		走到(663.175, -338.842, -52.2874)
		走到(658.465, -315.761, -52.0206)
		走到(649.888, -305.978, -52.14)
		走到(645.189, -287.304, -52.5059)
		走到(647.403, -272.041, -52.9477)
		走到(654.85, -256.272, -53.2285)
		if 战斗中() then
			朝向坐标(664.597, -251.07, -61.6945)
			跳()
			延时(1000)
			寻路结束()
			while 战斗中() do 
				延时(1000)
				if zy == "潜行者" then
					使用技能("消失")
					延时(1000)
				end
			end
			x,y,z = 当前坐标()
			while z > -64 and HP()>1 do 
				跳()
				延时(200)
				按键("w",1)
				延时(500)
				按键("w",2)
				x,y,z = 当前坐标()
			end
			走到(668.877, -248.379, -64.3912)
			走到(665.717, -236.665, -64.3912)
		else
			走到(661.962, -238.641, -64.3911)
		end
	end
	if 在坐标范围(661.962, -238.641, -64.3911,15) then
		走到(670.908, -233.525, -64.3911)
		走到(669.397, -219.138, -64.3911)
		走到(657.927, -214.852, -64.3911)
		走到(657.841, -208.951, -64.3911)
		走到(661.487, -205.77, -63.3011)
		走到(672.627, -211.717, -59.9309,1)
	end
	if 在坐标范围(672.627, -211.717, -59.9309,10) then
		走到(689.075, -255.119, -53.0644)
		走到(691.916, -253.462, -53.0528)
		走到(693.88, -228.835, -47.3005)
		走到(693.98, -183.798, -48.1297)
		走到(672.233, -166.692, -48.9243)
		走到(660.016, -165.237, -51.2095)
		闪现走到(647.996, -142.76, -51.2938,1)
		if 坐标范围有采集物(674.88, -140.9, -48.7,20) then
			走到(674.88, -140.9, -48.7,1)
			延时(300)
			范围采集(5)
		end
		走到(630.764, -151.071, -53.1435,1)
		走到(618.096, -147.695, -54.3212,1)
		if 坐标范围有采集物(600.963, -166.816, -55.1833,10) then
			走到(610.328, -160.145, -55.0941)
			走到(600.963, -166.816, -55.1833,1)
			延时(300)
			范围采集(5)
			走到(610.328, -160.145, -55.0941,1)
		end
		走到(618.096, -147.695, -54.3212,1)
	end
	if 在坐标范围(618.096, -147.695, -54.3212,15) then
		走到(611.708, -135.682, -54.8031)
		走到(614.247, -123.873, -55.0252)
		走到(618.573, -115.278, -57.4998)
		走到(642.506, -104.166, -56.3862,1)
		if 坐标范围有采集物(640.252, -102.002, -56.2036,5) then
			走到(639.935, -103.379, -56.3138,1)
			范围采集(5)
		end
		走到(642.506, -104.166, -56.3862,1)
		while 坐标范围怪物数量(666.968, -91.0012, -57.4999,40,"洞窟|收割者",1) > 0 and 可循环() do 
			延时(500)
		end
		走到(641.275, -100.371, -55.8939)
		走到(641.687, -93.7338, -57.5)
		走到(654.27, -90.7706, -57.5)
		走到(686.272, -96.8278, -57.4999,1)
		if zy == "法师" then
			闪现走到(705.556, -104.307, -56.3081,1,6)
		else
			潜行()
			走到(703.88, -91.185, -57.4247)
			走到(705.556, -104.307, -56.3081)
		end
		走到(718.725, -104.067, -56.3251,1)
	end
	if 在坐标范围(718.725, -104.067, -56.3251,15) then
		if 坐标范围有采集物(727.768, -112.767, -56.2011,5) then
			走到(726.201, -109.917, -56.3335)
			走到(727.848, -113.423, -56.1895,1)
			范围采集(5)
		end
		走到(724.925, -97.1292, -56.4746)
		走到(739.731, -99.5387, -56.3669,1)
		if zy == "法师" then
			while 坐标范围怪物数量(753.555, -102.656, -57.4755,10,"洞窟|收割者",1) > 0 and 可循环() do 
				延时(500)
			end
		else
			潜行()
		end
		走到(749.867, -108.354, -57.181)
		走到(762.943, -124.782, -57.4817)
		走到(761.572, -137.832, -56.4071,1)
		
		if zy == "法师" then
			while 技能可用("闪现术") == false and 可循环() do  
				延时(500)
			end
			闪现到(779.805, -164.446, -56.1302,1)
		else
			潜行()
			走到(769.223, -148.529, -56.3621)
			走到(779.805, -164.446, -56.1302,1)
			取消BUFF("潜行")
		end
		走到(780.76, -173.281, -56.3867,1)
	end
	if 在坐标范围(780.76, -173.281, -56.3867,15) then
		走到(797.203, -183.729, -75.1044,1)
	end
	if 在坐标范围(797.203, -183.729, -75.1044,15) then
		走到(814.348, -170.827, -77.267,1)
	end
	if 在坐标范围(814.348, -170.827, -77.267,15) then
		if 坐标范围有采集物(811.895, -153.696, -74.9548,5) then
			走到(811.895, -153.696, -74.9548,1)
			范围采集(5)
			走到(814.348, -170.827, -77.267,1)
		end
		if zy~="法师" then
			取消BUFF("潜行")
		end
		走到(825.644, -154.661, -88.28)
		走到(833, -134.761, -88.4165)
		走到(836.12, -111.157, -88.7383)
		走到(849.458, -93.8757, -87.8911)
		走到(834.694, -72.9495, -87.4502)
		走到(827.284, -65.5529, -87.2456)
		走到(831.837, -44.4597, -86.7853,1)
	end
	if 在坐标范围(831.837, -44.4597, -86.7853,15) then
		if 坐标范围有采集物(856.706, -37.0266, -86.402,5) then
			while 坐标范围怪物数量(841.535, -39.9073, -87.1156,30,"布拉斯",1) > 0 and 可循环() do  
				延时(500)
			end
			走到(859.79, -36.177, -86.0136,1)
			范围采集(5)
			while 坐标范围怪物数量(841.535, -39.9073, -87.1156,30,"布拉斯",1) > 0 and 可循环() do 
				延时(500)
			end
			走到(831.837, -44.4597, -86.7853,1)
		end
		潜行()
		while 坐标范围怪物数量(824.446, -30.1665, -88.2694,10,"洞窟",1) > 0 and 可循环() do 
			延时(500)
		end
		走到(803.831, 3.48233, -88.3047,1)
		走到(811.368, 31.0346, -88.1043,1)
		取消BUFF("潜行")
	end
	if 在坐标范围(811.368, 31.0346, -88.1043,15) then
		if 坐标范围有采集物(802.402, 85.6517, -86.3652,5) then
			走到(786.189, 60.983, -87.3545)
			走到(785.975, 83.8888, -86.9579)
			走到(796.309, 94.9262, -86.167)
			走到(797.889, 94.9096, -86.1268,1)
			潜行()
			走到(803.107, 90.5274, -86.0954,1)
			while 可循环() do 
				打开身边目标()
				延时(500)
				if 读条中() then
					范围采集(5)
					break
				else
					移动("前",110)
				end
			end
			if 战斗中() then
				if zy == "潜行者" then
					使用技能("消失")
				end
			end
			走到(795.304, 95.4453, -86.1863)
			走到(790.947, 90.1213, -86.4918,1)
			走到(785.975, 83.8888, -86.9579,1)
		end
		if zy == "法师" then
			闪现到(754.56, 52.3539, -88.1491,1)
		else
			走到(754.56, 52.3539, -88.1491,1)
		end
		if 战斗中() then
			走到(737.946, 41.8311, -88.1581,1,0,0.3)
			for io=1,3 do 
				朝向坐标(733.792, 39.4159, -86.1563)
				跳()
				按键("w",1)
				延时(200)
				按键("w",2)
				延时(800)
			end
			while 战斗中() do 
				延时(500)
			end
			朝向坐标(719.076, 35.7817, -88.1491)
			for io=1,3 do 
				朝向坐标(719.076, 35.7817, -88.1491)
				跳()
				按键("w",1)
				延时(200)
				按键("w",2)
				延时(800)
			end
			走到(719.076, 35.7817, -88.1491,1)
		end
		if zy == "潜行者" then
			使用技能("疾跑")
		end
		走到(695.955, 50.9388, -88.6649)
		走到(636.822, 54.9559, -87.8797)
		走到(599.368, 32.9814, -96.3128)
		闪现走到(546.896, 30.2637, -96.3128)
		走到(526.536, 32.5456, -96.3128)
		走到(507.062, 47.6213, -96.3128)
		闪现走到(474.015, 116.583, -94.0348)
		闪现走到(507.326, 150.367, -94.049)
		走到(497.799, 170.699, -94.0488)
		走到(474.205, 205.797, -94.0488,1)
	end
	local 最远点=0
	if 在坐标范围(474.205, 205.797, -94.0488,15) then
		if 坐标范围有采集物(525.289,230.219,-94.0493,5) then
			走到(476.606, 217.944, -94.0482)
			走到(525.902, 232.72, -94.0482,1)
			范围采集(5)
			闪现走到(476.606, 217.944, -94.0482)
		end
		走到(461.474, 249.122, -94.0484)
		走到(440.611, 251.624, -94.1949)
		走到(426.978, 249.268, -93.2729)
		走到(399.838, 255.719, -94.099,1)
	end
	if 在坐标范围(399.838, 255.719, -94.099,15) then
		if 坐标范围有采集物(347.821,249.205,-94.2677,5) then
			走到(382.599, 247.012, -94.0484,1)
			if zy == "法师" then
				闪现到(346.818, 243.69, -94.23,1)
			else
				while not 存在BUFF("潜行") and 可循环() do 
					使用技能("潜行")
					延时(500)
					走到(346.818, 243.69, -94.23)
				end
			end
			走到(347.821,249.205,-94.2677,1,0,3)
			范围采集(5)
			if mangmucao ~= 0 then
				走到(356.739, 242.355, -94.5966,1)
				走到(365.668, 243.519, -94.1902)
				走到(376.585, 244.163, -94.0493,1,1)
				走到(399.838, 255.719, -94.099,1)
			else
				走到(385.399, 206.406, -112.883)
				走到(390.524, 158.95, -131.735)
				走到(376.945, 153.738, -131.738,1)
				走到(367.65, 151.841, -131.739,1)
			end
		end
	end
	if 在坐标范围(399.838, 255.719, -94.099,15) then
		if mangmucao == 0 then
			走到(385.399, 206.406, -112.883)
			走到(390.524, 158.95, -131.735)
			走到(376.945, 153.738, -131.738,1)
			走到(367.65, 151.841, -131.739,1)
		end
	end
	if 在坐标范围(367.65, 151.841, -131.739,15) then
		while 坐标范围怪物数量(348.671, 146, -131.762,15,"多头怪",1) >0 and 可循环() do 
			延时(500)
		end
		走到(355.612, 152.48, -131.738)
		走到(317.526, 162.735, -131.717,1)
		if 坐标范围有采集物(317.526, 162.735, -131.717,5) then
			范围采集(5)
		end
		走到(316.634, 150.146, -131.491,1)
		while 坐标范围怪物数量(319.12, 117.22, -131.747,20,"多头怪",1) >0 and 可循环() do 
			延时(500)
		end
		走到(313.158, 137.447, -131.736)
		走到(328.112, 112.885, -131.76,1)
		while 坐标范围怪物数量(312.938, 95.4345, -131.757,25,"多头怪",1) >0 and 可循环() do 
			延时(500)
		end
		走到(321.707, 104.725, -131.759)
		闪现走到(284.827, 68.7263, -131.011,1)
		走到(273.621, 66.7405, -131.011,1)
	end
	if 在坐标范围(273.621, 66.7405, -131.011,15) then
		潜行()
		if 坐标范围怪物数量(272.911, 50.7298, -131.011,20,"多头怪",1) >0 or 坐标范围有采集物(258.941,54.6936,-131.01,5) then
			走到(263.7, 72.6204, -131.01,1)
			走到(251.812, 70.113, -131.01,1)
			if 坐标范围有采集物(258.941,54.6936,-131.01,5) then
				while 坐标范围怪物数量(258.941,54.6936,-131.01,30,"多头怪",1) >0 and 可循环() do 
					延时(500)
					if 坐标范围怪物数量(258.941,54.6936,-131.01,10,"多头怪",1) >0 then
						延时(8000)
						break
					end
				end
				走到(256.285, 53.6719, -131.012,1)
				范围采集(5)
			end
			走到(244.908, 56.4703, -131.01)
			走到(252.184, 45.3724, -131.01)
		end
		潜行()
		走到(263.791, 38.4699, -131.011)
		走到(269.156, 29.2622, -131.011,1)
		走到(270.412, 17.6158, -131.01,1)
		while 坐标范围怪物数量(275.004, 8.36778, -131.01,20,"多头怪",1) >0 and 可循环() do 
			延时(500)
		end
		
		走到(283.348, -36.9524, -131.01,1)
		延时(1000)
	end
	if 在坐标范围(283.348, -36.9524, -131.01,15) then
		if 坐标范围有采集物(308.233, -88.2325, -131.012,5) then
			走到(281.752, -42.0785, -131.01,1)
			while 坐标范围怪物数量(295.555, -62.299, -131.01,30,"多头怪",1) >0 and 可循环() do 
				延时(500)
			end
			走到(281.411, -44.8708, -131.01,1)
			走到(295.624, -62.044, -131.01,1)
			if zy == "潜行者" then
				潜行()
			elseif zy == "法师" then
				闪现走到(298.479, -90.6767, -131.01,1)
			end
			走到(298.479, -90.6767, -131.01,1)
			走到(309.487, -98.1469, -131.01,1)
			if zy == "潜行者" then
				if 战斗中() then
					使用技能("消失")
					延时(1600)
				end
			end
			while 坐标范围怪物数量(309.487, -98.1469, -131.01,20,"多头怪",1) >0 and 可循环() do 
				延时(500)
			end
			走到(308.233, -88.2325, -131.012,1,0,4)
			范围采集(5)
			走到(309.487, -98.1469, -131.01,1)
			while 坐标范围怪物数量(309.487, -98.1469, -131.01,20,"多头怪",1) >0 and 可循环() do 
				延时(500)
			end
			走到(298.479, -90.6767, -131.01,1)
			while 坐标范围怪物数量(292.131, -69.1013, -131.01,20,"多头怪",1) >0 and 可循环() do 
				延时(500)
			end
			
			走到(295.297, -75.6355, -131.01)
			走到(286.443, -64.917, -131.01)
			走到(274.624, -66.0732, -131.01,1)
		end
		while 坐标范围怪物数量(259.315, -51.0112, -131.01,30,"多头怪",1) >0 and 可循环() do 
			延时(500)
		end
		走到(265.345, -55.7191, -131.01)
		走到(258.439, -55.1484, -131.01)
		走到(220.247, -54.2413, -130.986,1)
		走到(217.064, -64.8082, -129.86,1)
		if zy == "潜行者" then
			if 战斗中() then
				使用技能("消失")
			end
		end
	end
	if 在坐标范围(217.064, -64.8082, -129.86,15) then
		if 坐标范围有采集物(227.885,-42.8283,-131.01,5) then
			if 坐标范围怪物数量(227.847, -42.8777, -131.01,30,"多头怪",1) >0 then
				走到(217.064, -64.8082, -129.86,1)
				while 坐标范围怪物数量(227.847, -42.8777, -131.01,30,"多头怪",1) >0 and 可循环() do 
					延时(500)
				end
			end
			走到(227.885,-42.8283,-131.01,1)
			范围采集(5)
			走到(217.064, -64.8082, -129.86,1)
		end
		潜行()
		走到(230.196, -76.4038, -129.621,1)
		while 坐标范围怪物数量(246.533, -100.661, -129.598,30,"卫士",1) >0 and 可循环() do 
			延时(500)
		end
		走到(240.654, -84.1444, -129.621)
		走到(251.573, -111.409, -129.596)
		走到(262.83, -139.474, -131.159,1)
		走到(256.235, -156.09, -131.126,1)
		走到(235.44, -179.335, -131.363)
		走到(235.51, -192.886, -130.92,1)
	end
	if 在坐标范围(235.51, -192.886, -130.92,15) then
		潜行()
		while 坐标范围怪物数量(217.818, -195.726, -131.094,20,"卫士",1) >0 and 可循环() do 
			延时(500)
		end
		走到(217.818, -195.726, -131.094)
		if 坐标范围有采集物(209.111,-181.189,-131.517,5) then
			走到(205.382, -181.946, -131.159,1)
			范围采集(5)
			while 坐标范围怪物数量(217.818, -195.726, -131.094,20,"卫士",1) >0 and 可循环() do 
				延时(500)
			end
		end
		走到(207.377, -193.926, -131.158,1)
	end
	if 在坐标范围(207.377, -193.926, -131.158,15) then
		潜行()
		走到(206.876, -199.064, -131.159)
		走到(202.665, -206.059, -131.159)
		走到(206.599, -221.108, -131.159,1)
		while 坐标范围怪物数量(225.553, -238.045, -130.947,30,"卫士",1) >0 and 可循环() do 
			延时(500)
		end
		走到(217.239, -231.757, -131.144,1)
		走到(221.483, -268.067, -131.159,1)
		走到(229.846, -274.617, -131.159,1)
	end
	if 在坐标范围(229.846, -274.617, -131.159,15) then
		潜行()
		if 坐标范围有采集物(235.807, -278.045, -131.595,5) then
			走到(234.304, -278.493, -131.359,1)
			移动("右",200)
			范围采集(5)
			潜行()
			走到(229.846, -274.617, -131.159,1)
		end
		while 坐标范围怪物数量(270.191, -269.882, -122.889,30,"卫士",1) >0 and 可循环() do 
			延时(500)
		end
		朝向坐标(234.458, -278.237, -131.159)
		按键("w",1)
		for io=1,5 do 
			延时(500)
			按键("space")
			延时(500)
		end
		按键("w",2)
		走到(268.065, -280.095, -122.785)
		走到(295.908, -267.855, -120.124,1)
	end
	if 在坐标范围(295.908, -267.855, -120.124,15) then
		if 坐标范围有采集物(281.733,-340.384,-117.223,5) then
			while 坐标范围怪物数量(311.265, -272.11, -119.124,25,"卫士",1) >0 and 可循环() do 
				延时(500)
			end
			潜行()
			走到(305.177, -268.544, -120.03)
			走到(311.265, -272.11, -119.124)
			走到(319.016, -292.456, -118.046)
			走到(314.072, -306.898, -116.699)
			走到(300.951, -325.212, -116.676)
			走到(281.733,-340.384,-117.223,1)
			范围采集(5)
			走到(298.511, -326.776, -116.676,1)
			while 坐标范围怪物数量(311.265, -272.11, -119.124,35,"卫士",1) >0 and 可循环() do 
				延时(500)
			end
			走到(305.617, -319.671, -116.676)
			走到(315.511, -304.192, -116.822)
			走到(319.084, -290.997, -118.075)
			走到(310.029, -270.456, -119.46)
			走到(302.78, -268.312, -120.112)
			走到(295.215, -268.651, -120.087,1)
		end
		while 坐标范围怪物数量(281.136, -246.508, -120.795,35,"卫士",1) >0 and 可循环() do 
			延时(500)
		end
		闪现走到(266.83, -230.435, -114.132)
		走到(257.515, -220.495, -110.944)
		走到(261.052, -197.048, -111.03,1)
	end
	if 在坐标范围(261.052, -197.048, -111.03,15) then
		if 坐标范围有采集物(328.773, -195.41, -59.8991,5) then
			while 坐标范围怪物数量(251.521, -200.028, -111.031,25,"卫士",1) >0 and 可循环() do 
				延时(500)
			end
			走到(242.521, -202.028, -111.031,1)
			while 坐标范围怪物数量(217.35, -194.205, -108.66,20,"卫士",1) >0 and 可循环() do 
				延时(500)
			end
			潜行()
			走到(217.35, -194.205, -108.66,1)
			走到(196.285, -179.53, -111.314)
			走到(200.804, -155.763, -107.438)
			走到(209.115, -142.957, -101.29)
			走到(223.035, -135.893, -94.4366)
			走到(236.083, -125.121, -88.5892)
			走到(250.383, -121.115, -86.3889)
			走到(274.441, -130.866, -83.068)
			走到(283.105, -139.694, -76.9607,1)
			while 坐标范围怪物数量(299.084, -148.814, -70.0149,30,"卫士|原始巨兽",1) >0 and 可循环() do 
				延时(500)
			end
			
			走到(293.129, -152.953, -69.1358)
			走到(305.387, -174.569, -59.8991)
			走到(321.504, -179.239, -59.8991)
			走到(327.772, -185.366, -59.8991)
			走到(328.773, -195.41, -59.8991,1)
			范围采集(5)
			潜行()
			走到(327.772, -185.366, -59.8991)
			走到(321.504, -179.239, -59.8991)
			走到(310.312, -174.227, -59.8991,1)
			while 坐标范围怪物数量(299.084, -148.814, -70.0149,30,"卫士|原始巨兽",1) >0 and 可循环() do 
				延时(500)
			end
			走到(303.813, -172.9, -59.8991)
			走到(291.793, -150.88, -70.335)
			走到(284.814, -142.039, -75.6978,1)
			走到(273.034, -130.15, -83.3676)
			走到(259.694, -125.34, -85.1164,1)
			while 坐标范围怪物数量(248.322, -120.967, -86.7424,12,"卫士",1) >0 and 可循环() do 
				延时(500)
			end
			走到(248.079, -121.26, -86.7582)
			走到(233.912, -126.516, -89.1151)
			走到(221.342, -137.153, -95.2949)
			走到(206.896, -144.58, -102.384,1,0,0.3)
			while 坐标范围怪物数量(229.511, -189.047, -109.199,30,"卫士",1) >0 and 可循环() do 
				延时(500)
			end
			-------------
			走到(203.35, -151.651, -105.494)
			走到(196.164, -180.448, -111.266,1)
			while 坐标范围怪物数量(217.223, -192.896, -108.697,25,"卫士",1) >0 and 可循环() do 
				延时(500)
			end
			走到(207.836, -185.364, -109.179)
			走到(230.915, -186.85, -109.374)
			走到(245.106, -182.865, -111.031,1)
			if 坐标范围有采集物(277.265,-155.452,-111.292,10) then
				while 坐标范围怪物数量(245.106, -182.865, -111.031,25,"卫士",1) >0 and 可循环() do 
					延时(500)
				end
				走到(263.298, -194.225, -111.031)
				走到(266.177, -185.764, -111.03)
				走到(275.88, -167.47, -110.964,1,1)
				走到(279.947, -160.161, -110.266)
				走到(280.148, -154.756, -110.132,1)
				if 坐标范围有采集物(277.265,-155.452,-111.292,10) then
					范围采集(5)
					潜行()
				end
				走到(268.609, -137.856, -110.942,1)
			end
		else
			走到(266.177, -185.764, -111.03)
			走到(275.88, -167.47, -110.964,1,1)
			走到(279.947, -160.161, -110.266)
			走到(280.148, -154.756, -110.132,1)
			if 坐标范围有采集物(277.265,-155.452,-111.292,10) then
				范围采集(5)
				潜行()
			end
			走到(268.609, -137.856, -110.942,1)
			
		end
	end
	if 在坐标范围(268.609, -137.856, -110.942,10) then
		潜行()
		走到(268.609, -137.856, -110.942,1)
		while 坐标范围怪物数量(251.262, -109.543, -129.596,35,"卫士",1) >0 and 可循环() do 
			延时(500)
		end
		走到(257.878, -130.683, -130.056,1)
	end
	if 在坐标范围(245.106, -182.865, -111.031,10) then
		潜行()
		走到(245.028, -167.641, -130.779)
		走到(251.104, -160.022, -130.653)
		走到(263.223, -140.862, -131.159,1)
		while 坐标范围怪物数量(251.262, -109.543, -129.596,35,"卫士",1) >0 and 可循环() do 
			延时(500)
		end
		走到(257.878, -130.683, -130.056,1)
	end
	if 在坐标范围(257.878, -130.683, -130.056,15) then
		潜行()
		闪现走到(254.18, -83.2105, -129.621,1)
		while 坐标范围怪物数量(238.56, -83.7514, -129.621,25,"卫士",1) >0 and 可循环() do 
			延时(500)
		end
		走到(238.56, -83.7514, -129.621)
		走到(228.661, -74.8441, -129.62)
		走到(216.1, -64.3225, -129.993,1)
		-------------
		while 坐标范围怪物数量(219.936, -59.3658, -130.988,20,"多头怪",1) >0 and 可循环() do 
			延时(500)
		end
		走到(221.197, -53.2703, -130.993)
		闪现走到(267.45, -20.0709, -131.01,1)
		while 坐标范围怪物数量(270.394, 1.7307, -131.01,30,"多头怪",1) >0 and 可循环() do 
			延时(500)
		end
		闪现走到(270.723, 19.0557, -131.01)
		走到(268.937, 29.7406, -131.01,1)
		while 坐标范围怪物数量(276.419, 38.7207, -131.01,15,"多头怪",1) >0 and 可循环() do 
			延时(500)
		end
		走到(285.14, 47.4518, -131.01,1)
		走到(285.33, 69.3466, -131.01,1)
		while 坐标范围怪物数量(307.469, 89.7657, -131.744,20,"多头怪",1) >0 and 可循环() do 
			延时(500)
		end
		走到(323.919, 103.407, -131.762,1)
		走到(328.436, 113.096, -131.762,1)
		while (坐标范围怪物数量(321.346, 125.166, -131.747,20,"多头怪",1) >0 or 坐标范围怪物数量(315.66, 153.719, -131.737,20,"多头怪",1) >0) and 可循环() do 
			延时(500)
		end
		走到(315.66, 153.719, -131.737)
		走到(325.148, 157.122, -131.318)
		走到(343.592, 156.133, -131.737,1)
		while 坐标范围怪物数量(356.961, 146.437, -131.757,20,"多头怪",1) >0 and 可循环() do 
			延时(500)
		end
		走到(359.342, 152.252, -131.739)
		闪现走到(413.384, 143.683, -120.995)
		走到(421.331, 161.674, -117.287)
		走到(415.643, 173.1, -113.247)
		走到(404.961, 176.899, -113.096,1,1)
	end
	if 在坐标范围(404.961, 176.899, -113.096,15) then
		走到(364.683, 207.057, -104.543,1,0,0.3)
		走到(360.647, 213.336, -101.842,1,0,0.3)
		走到(358.806, 219.764, -100.747,1,0,0.3)
		走到(358.006, 226.764, -98.747,1,0,0.3)
	end
	if 在坐标范围(358.006, 226.764, -98.747,15) then
		走到(365.745, 244.505, -94.1311)
		走到(378.57, 243.722, -94.0493,1,1)
		走到(399.838, 255.719, -94.099,1)
	end
	if 在坐标范围(399.838, 255.719, -94.099,15) then
		走到(455.04, 248.802, -94.0481)
		走到(464.121, 238.466, -94.0481)
		if zy == "潜行者" then
			取消BUFF("潜行")
			使用技能("疾跑")
		end
		走到(477.94, 190.6, -94.0481)
		闪现走到(506.884, 155.773, -94.0476)
		走到(503.062, 148.302, -94.0476)
		走到(478.567, 116.575, -94.0344)
		走到(480.483, 101.197, -93.5078)
		if zy == "潜行者" then
			使用技能("伺机待发")
			走到(504.315, 52.3432, -96.3126)
		else
			闪现走到(504.315, 52.3432, -96.3126)
		end
		走到(512.763, 42.2595, -96.3126)
		if zy == "潜行者" then
			使用技能("疾跑")
		end
		走到(531.32, 32.3941, -96.3126)
		走到(553.678, 30.3314, -96.3126)
		走到(563.742, 39.035, -96.3126)
		走到(564.484, 54.2125, -96.3126)
		走到(561.757, 87.2788, -96.3126)
		走到(579.322, 105.629, -95.3717)
		走到(599.722, 115.187, -93.5068)
		走到(607.74, 112.861, -91.776)
		走到(660.085, 83.8363, -86.8602)
		闪现走到(720.424, 48.4957, -88.1498)
		走到(772.382, 46.5656, -88.1498)
		走到(811.368, 31.0346, -88.1043,1)
		走到(803.831, 3.48233, -88.3047,1)
	end
	if 在坐标范围(803.831, 3.48233, -88.3047,15) then
		走到(815.903, -15.141, -88.3247,1)
		while 坐标范围怪物数量(824.446, -30.1665, -88.2694,10,"洞窟",1) > 0 and 可循环() do 
			延时(500)
		end
		走到(832.137, -42.5477, -86.7165)
		走到(827.221, -55.3945, -86.9652)
		走到(834.073, -73.5927, -87.4501)
		走到(847.259, -99.0818, -88.6938)
		走到(835.903, -111.524, -88.7365)
		走到(832.451, -135.015, -88.4139)
		走到(824.831, -148.767, -88.2584)
		走到(828.392, -158.493, -88.2905)
		走到(859.524, -163.908, -86.8495,1)
	end
	if 在坐标范围(859.524, -163.908, -86.8495,15) then
		if zy == "法师" then
			while 坐标范围怪物数量(853.132, -203.358, -77.394,50,"布拉斯",1) > 0 and 可循环() do 
				延时(500)
			end
		else
			潜行()
			while 坐标范围怪物数量(859.43, -197.07, -81.735,20,"布拉斯",1) > 0 and 可循环() do 
				延时(500)
			end
		end
		走到(861.152, -176.275, -86.5483)
		走到(858.431, -188.908, -82.6508,1)
		走到(852.728, -218.704, -74.9087)
		走到(836.995, -225.155, -74.6091)
		走到(818.703, -216.653, -77.1488,1)
		if zy ~= "法师" then
			取消BUFF("潜行")
		end
		while 坐标范围怪物数量(801.292, -213.556, -77.1488,10,"洞窟",1) > 0 and 可循环() do 
			延时(500)
		end
		走到(801.292, -213.556, -77.1488)
		走到(794.233, -208.472, -77.1488)
		走到(789.342, -200.126, -77.1488)
		走到(793.918, -185.654, -74.8709)
		走到(787.019, -188.105, -73.6209)
		走到(777.144, -200.535, -68.1976,1)
	end
	if 在坐标范围(780.176, -197.966, -69.5456,20) then
		走到(775.82, -207.076, -66.0401,1)
		if zy == "法师" then
			闪现走到(795.706, -231.777, -65.0804,1)
		else
			潜行()
			--[[while 坐标范围怪物数量(787.619, -208.508, -65.2968,3,"软泥",1) >0 do 
				延时(500)
			end--]]
			走到(770.552, -206.774, -66.095)
			走到(765.462, -213.855, -64.4506)
			走到(776.911, -228.874, -64.3863)
			走到(793.215, -234.688, -65.9852,1)
		end
		走到(798.618, -241.99, -63.307,1)
	end
	if 在坐标范围(798.618, -241.99, -63.307,15) then
		if zy == "法师" then
			while 技能可用("闪现术") == false and 可循环() do  
				延时(500)
			end
			闪现走到(803.694, -262.502, -59.8751,0,5)
		else
			潜行()
			走到(797.723, -249.55, -61.8066)
			走到(802.45, -261.233, -59.8966)
			取消BUFF("潜行")
		end
		走到(814.102, -270.623, -59.9292)
		走到(832.069, -271.239, -59.45,1)
		--[[if 坐标范围有采集物(813.16,-244.633,-60.6847,5) then
			走到(831.348, -246.831, -59.1099)
			走到(820.77, -244.444, -60.4097,1)
			朝向坐标(817.419, -243.04, -60.6541)
			按键("w",1)
			while 可循环() do 
				if 在坐标范围(817.419, -243.04, -60.6541,1) then
					break
				end
			end
			按键("w",2)
			while 可循环() do 
				打开身边目标()
				延时(1000)
				if 读条中() then
					范围采集(5)
					break
				else
					移动("前",100)
				end
			end
			走到(828.009, -246.672, -59.8706,1)
		end--]]
		走到(844.917, -264.245, -57.6213,1)
	end
	if 在坐标范围(844.917, -264.245, -57.6213,15) then
		走到(852.721, -262.08, -55.023)
		走到(882.014, -246.958, -51.3535,1)
	end
	if 在坐标范围(882.014, -246.958, -51.3535,15) then
		走到(886.566, -240.91, -51.3781,1)
		走到(898.069, -223.056, -51.2247,1)
		走到(911.107, -200.901, -54.1013,1)
	end
	if 在坐标范围(911.107, -200.901, -54.1013,15) then
		if zy ~= "法师" then
			潜行()
		end
		走到(906.023, -190.693, -54.956,1,0,0.3)
		while 可循环() do 
			跳()
			延时(200)
			if zy == "法师" then
				移动("前",200)
			else
				移动("前",400)
			end
			延时(500)
			x,y,z = 当前坐标()
			if z > -54 then
				break
			end
		end
		走到(908.189, -183.801, -52.7117,1)
		走到(905.87, -180.799, -52.7949,1)
		if 坐标范围有采集物(905.87, -180.799, -52.7949,5) then
			范围采集(5)
		end
		走到(894.599, -153.71, -60.7863)
		走到(893.878, -136.902, -60.5254,1)
	end
	if 在坐标范围(893.878, -136.902, -60.5254,15) then
		if zy == "法师" then
			while 技能可用("闪现术") == false and 可循环() do  
				延时(500)
			end
		end
		while 坐标范围怪物数量(908.052, -129.253, -61.33,50,"布拉斯",1) > 0 and 可循环() do 
			延时(500)
		end
		
		走到(908.383, -128.783, -61.4007,1)
		if zy == "法师" then
			闪现到(908.481, -102.474, -61.3974,1)
		else
			潜行()
			延时(500)
			走到(906.519, -104.349, -61.3425,1)
		end
		走到(914.02, -88.1836, -59.5201,1)
		if 坐标范围怪物数量(908.443, -83.3915, -59.1852,30,"布拉斯",1) > 0 then
			while 坐标范围怪物数量(908.443, -83.3915, -59.1852,30,"布拉斯",1) > 0 and 可循环() do 
				延时(500)
			end
		end
		走到(908.443, -83.3915, -59.1852,1)
		走到(907.028, -75.7675, -59.1847,1)
		while 坐标范围怪物数量(902.13, -55.2979, -58.8694,30,"布拉斯",1) > 0 and 可循环() do 
			延时(500)
		end
		走到(902.13, -55.2979, -58.8694,1)
	end
	if 在坐标范围(902.13, -55.2979, -58.8694,20) then
		if 坐标范围有采集物(879.252, -60.7925, -59.1787,5) then
			走到(898.765, -56.2204, -58.868,1)
			朝向坐标(887.812, -55.3604, -58.9746)
			按键("w",1)
			延时(500)
			跳()
			延时(500)
			按键("w",2)
			走到(880.723, -52.1906, -59.1782,1)
			走到(875.104, -53.6775, -59.1788,1)
			走到(873.14, -56.3023, -59.1788,1)
			走到(874.149, -62.5088, -59.1783,1)
			while 可循环() do 
				打开身边目标()
				延时(1000)
				if 读条中() then
					范围采集(5)
					break
				else
					朝向坐标(879.252, -60.7925, -59.1787)
					移动("前",100)
				end
			end
			if zy ~= "法师" then
				潜行()
			end
			走到(873.14, -56.3023, -59.1788,1)
			走到(875.104, -53.6775, -59.1788,1)
			走到(880.723, -52.1906, -59.1782,1)
			走到(887.971, -55.4639, -58.9677,1)
			朝向坐标(898.746, -56.271, -58.8705)
			按键("w",1)
			延时(500)
			跳()
			延时(500)
			按键("w",2)
			走到(902.093, -54.909, -58.8596,1)
		end
		if zy == "法师" then
			走到(910.358, -49.8539, -59.107,1)
			while 技能可用("闪现术") == false and 可循环() do 
				延时(500)
			end
			while 坐标范围怪物数量(910.358, -49.8539, -59.107,40,"布拉斯",1) > 0 and 可循环() do 
				延时(500)
			end
			走到(917.34, -50.3836, -59.3631,1,0,2)
			闪现到(943.03, -57.304, -61.711,1)
			移动("左",300)
		else
			潜行()
			while 坐标范围怪物数量(910.358, -49.8539, -59.107,20,"布拉斯",1) > 0 and 可循环() do 
				延时(500)
			end
			走到(909.88, -50.6513, -59.1026)
			延时(3500)
			走到(933.649, -53.5157, -60.9744,1)
		end
	end
	if 在坐标范围(933.649, -53.5157, -60.9744,20) then
		if zy=="法师" then
			while 技能可用("闪现术") == false and 可循环() do 
				延时(500)
			end
		else
			潜行()
		end
		--坐标boss房间是否有点待定
		走到(944.366, -57.9743, -61.7851,1)
		if zy=="法师" then
			闪现到(968.474, -53.6415, -61.9063,5)
		else
			走到(968.474, -53.6415, -61.9063,1)
		end
		if 坐标范围有采集物(992.155, -1.17419, -62.5435,5) then
			走到(996.5, -13.8504, -62.586)
			走到(992.717, -1.36595, -62.53,1)
			范围采集(5)
			走到(996.5, -13.8504, -62.586)
		end
		走到(968.678, -55.2, -61.906)
		走到(971.278, -71.0045, -61.53,1)
		if zy ~= "法师" then
			潜行()
		end
		while (坐标范围怪物数量(963.383, -89.1351, -62.807,40,"布拉斯",1) > 0 or 坐标范围怪物数量(971.278, -71.0045, -61.53,30,"布拉斯",1) > 0) and 可循环() do 
			延时(500)
		end
		走到(968.551, -77.2031, -61.9383)
		走到(968.292, -83.7752, -61.6401)
		走到(973.295, -94.4516, -63.2458,1)
	end
	if 在坐标范围(973.311, -94.6607, -63.249,20) then
		while 坐标范围怪物数量(972.886, -98.3407, -63.3474,40,"布拉斯",1) > 0 and 可循环() do 
			延时(500)
		end
		if zy~= "法师" then
			潜行()
		else
			while 技能可用("闪现术") == false and 可循环() do 
				延时(500)
			end
		end
		走到(972.886, -98.3407, -63.3474,1)
		if zy== "法师" then
			闪现到(964.911, -121.041, -62.7371,1)
		else
			走到(971.749, -110.228, -63.5574)
			走到(964.911, -121.041, -62.7371,1)
		end
		走到(962.223, -124.358, -62.5153)
		走到(961.672, -134.922, -61.2903,1)
		走到(962.54, -137.83, -60.8213,1)
		if zy == "法师" then
			while 坐标范围怪物数量(947.271, -160.544, -59.7523,40,"布拉斯",1) > 0 and 可循环() do 
				延时(500)
			end
		else
			while 坐标范围怪物数量(939.31, -132.516, -61.0591,20,"布拉斯",1) > 0 and 可循环() do 
				延时(500)
			end
		end
		走到(939.31, -132.516, -61.0591)
		延时(300)
		走到(928.915, -145.549, -60.6455)
		走到(930.052, -155.411, -60.8303,1)
	end
	if 在坐标范围(930.052, -155.411, -60.8303,20) then
		if 坐标范围有采集物(954.38,-157.657,-59.2653,5) then
			while 坐标范围怪物数量(947.271, -160.544, -59.7523,40,"布拉斯",1) > 0 and 可循环() do 
				延时(500)
			end
			走到(948.86, -159.313, -59.8368)
			走到(949.174, -158.719, -59.8272)
			走到(950.887, -159.963, -59.4824,1)
			while 可循环() do 
				打开身边目标()
				延时(500)
				if 读条中() then
					范围采集(5)
					break
				else
					移动("前",110)
				end
			end
		end
		走到(929.266, -155.321, -60.8258,1)
		if zy == "法师" then
			while 技能可用("闪现术") == false and 可循环() do 
				延时(500)
			end
		else
			潜行()
		end
		while 坐标范围怪物数量(949.355, -171.728, -63.4688,30,"布拉斯",1) > 0 and 可循环() do 
			延时(500)
		end
		走到(938.501, -164.379, -61.4795)
		if zy == "法师" then
			闪现走到(957.402, -179.425, -64.7265,1)
		else
			走到(949.355, -171.728, -63.4688)
		end
		走到(964.143, -172.351, -65.64,1)
		if zz == "巨魔" then
			走到(-969.133,-176.158,-66.52,0,0,0.3)
		else
			走到(968.749, -169.797, -66.355,0,0,0.3)
		end
		走到(978.774, -171.289, -67.357,1)
		走到(994.207, -175.786, -67.6288,1)
		if zy== "潜行者" then
			if 战斗中() then
				使用技能("消失")
			end
		end
		走到(995.605, -177.636, -67.6404)
		走到(995.389, -185.756, -67.6411,1,1)
		走到(999.096, -187.506, -67.6303)
		走到(1011.74, -188.487, -66.57,0,1)
		走到(1029.05, -204.731, -68.7453,1)
		走到(1035.33, -210.821, -68.8771,1)
	end
	if 在坐标范围(1035.33, -210.821, -68.8771,20) then
		走到(1038.79, -223.826, -72.2695,1)
		走到(1058.52, -243.973, -72.2624,1)
		走到(1046.14, -269.416, -72.5524)
		走到(1053.6, -282.48, -73.2325)
		走到(1060.46, -300.082, -73.1861,1)
		潜行()
	end
	if 在坐标范围(1060.46, -300.082, -73.1861,10) then
		while 坐标范围怪物数量(1049.97, -307.638, -73.1181,40,"布拉斯",1) > 0 and 可循环() do 
			延时(500)
		end
		走到(1060.69, -307.032, -73.164)
		走到(1055.97, -312.035, -73.1054)
		走到(1049.97, -307.638, -73.1181,1)
	end
	if 在坐标范围(1049.97, -307.638, -73.1181,20) then
		if 坐标范围有采集物(1039.85, -293.908, -71.9609,5) then
			走到(1041.15, -295.845, -71.9604,1)
			范围采集(5)
		end
		if 坐标范围怪物数量(1049.97, -307.638, -73.1181,40,"喷涌幼虫|布拉斯",1) > 0 or 坐标范围怪物数量(1015.87, -313.339, -71.9327,40,"喷涌幼虫|布拉斯",1) > 0 then
			走到(1041.15, -295.845, -71.9604,1)
			while (坐标范围怪物数量(1049.97, -307.638, -73.1181,40,"喷涌幼虫|布拉斯",1) > 0 or 坐标范围怪物数量(1015.87, -313.339, -71.9327,40,"喷涌幼虫|布拉斯",1) > 0) and 可循环() do 
				延时(500)
				if 坐标范围怪物数量(1060.69, -307.032, -73.164,25,"布拉斯",1) > 0 and 坐标范围怪物数量(1006.33, -317.493, -70.447,35,"喷涌幼虫|布拉斯",1) == 0 then
					break
				end
			end
		end
		走到(1049.97, -307.638, -73.1181,1)
		走到(1034.11, -309.207, -71.4936)
		走到(1022.06, -310.287, -71.2563,1,1)
		走到(1015.87, -313.339, -71.9327)
		走到(1006.33, -317.493, -70.447)
		走到(996.111, -336.226, -63.1631)
		走到(992.596, -345.233, -57.7077)
		走到(995.887, -360.109, -51.5791,1)
		潜行()
	end
	if 在坐标范围(994.634, -361.05, -51.0361,10) then
		if zy == "法师" then
			while 坐标范围怪物数量(976.993, -363.113, -50.274,30,"喷涌幼虫|布拉斯",1) > 0 and 可循环() do 
				延时(500)
			end
		else
			while 坐标范围怪物数量(976.993, -363.113, -50.274,15,"喷涌幼虫|布拉斯",1) > 0 and 可循环() do 
				延时(500)
			end
		end
		走到(976.993, -363.113, -50.274)
		走到(974.161, -366.32, -50.0625,1)
		走到(964.249, -364.994, -49.7957,0,1)
		走到(958.201, -354.563, -49.863,0,1)
		走到(953.731, -349.629, -49.9416,1)
		走到(952.021, -346.455, -49.9735,1)
	end
	if 在坐标范围(952.021, -346.455, -49.9735,20) then
		if 可循环() and 坐标范围有采集物(937.502, -394.901, -50.2759,5) then
			if zy == "法师" then
				while 技能可用("闪现术") == false and 可循环() do 
					延时(500)
				end
			else
				潜行()
			end
			while 坐标范围怪物数量(938.552, -343.533, -50.1374,40,"喷涌幼虫|布拉斯",1) > 0 and 可循环() do  
				延时(500)
			end
			走到(933.839, -345.432, -50.1502,1)
			if zy == "法师" then
				闪现到(902.656, -357.885, -50.4155,1)
			else
				走到(902.656, -357.885, -50.4155,1)
			end
			走到(912.081, -375.81, -50.2846)
			走到(934.715, -396.169, -50.2757,1)
			范围采集(5)
			潜行()
			while 坐标范围怪物数量(902.594, -356.7, -50.4359,40,"喷涌幼虫|布拉斯",1) > 0 and 可循环() do 
				延时(500)
			end
			走到(925.588, -389.44, -50.2757)
			走到(908.629, -369.98, -50.3178)
			走到(902.594, -356.7, -50.4359,1)
			走到(946.835, -343.205, -50.067,1)
		end
		if zy == "法师" then
			while 坐标范围怪物数量(938.552, -343.533, -50.1374,40,"喷涌幼虫|布拉斯",1) > 0 and 可循环() do 
				延时(500)
			end
		else
			潜行()
		end
		走到(944.504, -343.503, -50.136,1)
		走到(937.557, -325.617, -49.6703,1)
		if zy == "法师" then
			while 坐标范围怪物数量(902.922, -316.76, -49.1492,30,"布拉斯",1) > 0 and 可循环() do 
				延时(500)
			end
		else
			while 坐标范围怪物数量(902.922, -316.76, -49.1492,20,"布拉斯",1) > 0 and 可循环() do 
				延时(500)
			end
		end
		走到(910.5, -325.991, -49.6151,1)
		走到(902.922, -316.76, -49.1492,1)
	end
	if 在坐标范围(902.922, -316.76, -49.1492,20) then
		if 可循环() and 坐标范围有采集物(930.352, -292.337, -49.7728,10) then
			走到(908.301, -312.407, -51.6008)
			按键("space",1)
			走到(918.81, -296.539, -51.6009,1)
			走到(932.984, -293.234, -49.7174,1)
			按键("space",2)
			走到(932.984, -293.234, -49.7174,1)
			走到(927.454, -292.329, -49.801,1)
			范围采集(5)
			走到(916.071, -293.529, -51.6677,1)
			if zy == "法师" then
				while 坐标范围怪物数量(894.647, -288.799, -46.0677,50,"布拉斯",1) > 0 and 可循环() do 
					延时(500)
				end
			else
				潜行()
				while 坐标范围怪物数量(902.922, -316.76, -49.1492,20,"布拉斯",1) > 0 and 可循环() do 
					延时(500)
				end
				end
			按键("space",1)
			走到(906.672, -323.652, -49.731,1)
			按键("space",2)
		end
		if 坐标范围怪物数量(902.922, -316.76, -49.1492,25,"布拉斯",1) > 0 then
			走到(912.177, -307.086, -51.6008,1)
			按键("space",1)
			延时(2000)
			按键("space",2)
			while 坐标范围怪物数量(902.922, -316.76, -49.1492,30,"布拉斯",1) > 0 and 可循环() do 
				延时(500)
			end
			按键("space",1)
			走到(906.672, -323.652, -49.731,1)
			按键("space",2)
		end
		走到(900.674, -312.238, -48.5198)
		走到(897.845, -302.353, -46.3171)
		走到(902.045, -290.65, -46.1037,1)
	end
	if 在坐标范围(902.045, -290.65, -46.1037,20) then
		if zy == "法师" then
			while (坐标范围怪物数量(902.045, -290.65, -46.1037,30,"布拉斯",1) > 0 or 坐标范围怪物数量(912.061, -252.717, -46.4446,40,"布拉斯",1) > 0) and 可循环() do 
				延时(500)
			end
		else
			潜行()
		end
		走到(899.327, -284.151, -45.9387,1)
		走到(894.34, -272.483, -45.4912)
		走到(896.004, -265.488, -45.5487)
		走到(909.771, -261.663, -46.201,1)
		走到(919.801, -255.714, -46.383,1)
		while 坐标范围怪物数量(919.801, -255.714, -46.383,40,"布拉斯",1) > 0 and 可循环() do 
			延时(500)
		end
		走到(923.031, -253.941, -46.5559,1)
	end
	if 在坐标范围(923.031, -253.941, -46.5559,20) then
		--采集点坐标待定
		if 可循环() and 坐标范围有采集物(959.888, -231.92, -49.4211,5) then
			while 坐标范围怪物数量(919.801, -255.714, -46.383,40,"布拉斯",1) > 0 and 可循环() do 
				延时(500)
			end
			走到(939.539, -239.99, -46.5381)
			走到(960.936, -235.11, -49.3418,1)
			范围采集(5)
			while 坐标范围怪物数量(988.432, -237.906, -47.744,40,"布拉斯",1) > 0 and 可循环() do 
				延时(500)
			end
			走到(988.432, -237.906, -47.744,1)
			走到(992.888, -238.837, -46.8171,1)
			if zy == "法师" then
				闪现到(999.265, -259.227, -45.7115,1)
			else
				潜行()
				走到(999.271, -250.07, -45.7105)
				走到(999.411, -258.899, -45.7105,1)
			end
			走到(986.823, -274.533, -45.7115,1)
			while 坐标范围怪物数量(978.821, -284.776, -45.6487,30,"布拉斯",1) > 0 and 可循环() do 
				延时(500)
			end
			走到(978.821, -284.776, -45.6487,1)
		else
			if zy == "法师" then
				走到(941.564, -262.214, -45.687,1)
				闪现到(964.234, -278.418, -45.5692,1)
				走到(967.081, -290.323, -45.4079)
			else
				潜行()
				走到(929.455, -257.722, -46.4272)
				走到(938.821, -283.226, -46.539)
				走到(946.901, -290.403, -45.9014)
			end
		end
		走到(958.867, -307.259, -45.3414,1)
		走到(970.365, -320.386, -45.8566)
		走到(981.084, -320.447, -45.8073,1)
	end
	if 在坐标范围(981.084, -320.447, -45.8073,20) then
		if zy == "法师" then
			while 坐标范围怪物数量(1001.27, -340.844, -42.0932,30,"布拉斯",1) > 0 and 可循环() do 
				延时(500)
			end
		else
			取消BUFF("潜行")
		end
		使用技能("疾跑")
		走到(995.546, -324.984, -45.0768)
		走到(1007.26, -339.195, -40.8505)
		走到(1050.22, -349.145, -37.9593)
		走到(1051.02, -361.57, -37.5112)
		走到(1066.57, -379.165, -36.2772)
		走到(1061.58, -395.587, -36.2772)
		闪现走到(1045.5, -430.462, -32.0318)
		走到(1022.75, -456.261, -43.299)
		走到(1012.7, -459.052, -43.4768,1)
	end
	if 在坐标范围(1012.7, -459.052, -43.4768,20) then
		while 在副本() do 
			朝向坐标(1000.7, -459.052, -43.4768)
			移动("前",5000)
			延时(2000)
			while 过图中() do 
				延时(500)
			end
			if 在副本() then
				走到(1012.7, -459.052, -43.4768,1)
			else
				break
			end
		end
		取消BUFF("潜行")
	end
end
function 橙门到紫门()
	if 在坐标范围(-1468.2, 2614.21, 76.3804,60) or 在坐标范围(-1533.97, 2735.04, 89.1845,100) or 在坐标范围(-1414.64, 2937.34, 95.31,80) then
		if zy == "法师" then
			使用技能("寒冰护体")
		else
			取消BUFF("潜行")
		end
		路径走到("橙门到紫门",-1533.97, 2735.04, 89.1845)
		if not 战斗中() then
			if 等级() >= 58 and 坐标范围有采集物(-1607.86, 2740.01, 93.7583,5) then
				走到(-1554.47, 2719.89, 88.6002,1)
				走到(-1572.54, 2718.3, 93.163,1)
				闪现走到(-1607.86, 2740.01, 93.7583,1)
				范围采集(5)
				走到(-1572.54, 2718.3, 93.163,1)
				走到(-1554.47, 2719.89, 88.6002,1)
				走到(-1533.97, 2735.04, 89.1845,1)
			end
		end
	end
	if 在坐标范围(-1533.97, 2735.04, 89.1845,60) then
		if zy == "法师" then
			使用技能("寒冰护体")
		end
		路径走到("橙门到紫门",-1472.48, 2808.66, 94.2119)
		if 等级() >= 58 and 坐标范围有采集物(-1444.23, 2787, 93.5738,5) then
			走到(-1466.15, 2803.32, 94.9197)
			走到(-1443.33, 2792.49, 93.7673)
			走到(-1442.11, 2787.97, 93.6862,1)
			范围采集(5)
			走到(-1443.33, 2792.49, 93.7673)
			走到(-1466.15, 2803.32, 94.9197)
			走到(-1472.17, 2806.07, 93.707,1)
		end
	end
	if 在坐标范围(-1472.17, 2806.07, 93.707,50) then
		if zy == "法师" then
			使用技能("寒冰护体")
		end
		路径走到("橙门到紫门",-1495.01, 2885.06, 93.5721)
		if 等级() >= 58 and 坐标范围有采集物(-1515.92, 2887.07, 92.4628,5) then
			走到(-1515.92, 2887.07, 92.4628,1)
			范围采集(5)
			走到(-1495.69, 2885.31, 93.5203,1)
		end
	end
	if 在坐标范围(-1495.01, 2885.06, 93.5721,30) then
		if zy == "法师" then
			使用技能("寒冰护体")
		end
		路径走到("橙门到紫门",-1451.4, 2919.92, 93.3812)
		if 等级() >= 58 and (坐标范围有采集物(-1443.26, 2864.04, 87.9815,5) or 坐标范围有采集物(-1367.06, 2875.51, 76.2107,10)) then
			走到(-1427.47, 2919.17, 93.7397,1)
			走到(-1417.87, 2915.51, 93.8906,1,1)
			走到(-1418.31, 2901.97, 94.466)
			走到(-1431.86, 2891.83, 91.3758)
			走到(-1437.25, 2880.35, 88.4228)
			走到(-1443.4, 2872.59, 88.3139)
			走到(-1445.54, 2864.32, 88.1608)
			走到(-1443.26, 2864.04, 87.9815,1)
			范围采集(5)
			if 坐标范围有采集物(-1367.06, 2875.51, 76.2107,10) then
				走到(-1431.55, 2857.08, 86.4695)
				走到(-1406.66, 2867.28, 79.7339)
				走到(-1380.28, 2880.03, 77.4677)
				走到(-1370.28, 2878.88, 76.8337,1)
				范围采集(10)
				走到(-1390.3, 2877.74, 77.7282)
				走到(-1394.49, 2873.39, 78.2596)
				走到(-1410.46, 2866.36, 80.6863)
				走到(-1416.79, 2871.36, 84.7961)
				走到(-1421.76, 2880.24, 89.3259)
			else
				走到(-1446, 2865.11, 88.2274)
				走到(-1437.5, 2879.91, 88.4082)
			end
			走到(-1420.04, 2896.04, 93.6669)
			走到(-1423.01, 2918.19, 93.7677)
			走到(-1434.82, 2926.02, 94.2313)
			走到(-1415.14, 2938.2, 95.355,1)
		end
	end
	if 在坐标范围(-1451.4, 2919.92, 93.3812,80) then
		路径走到("橙门到紫门",-1414.64, 2937.34, 95.31)
		if not 战斗中() then
			if 等级() >= 58 and 坐标范围有采集物(-1433.11, 2980.8, 100.662,5) then
				走到(-1434.61, 2980.27, 100.653,1)
				范围采集(5)
				走到(-1414.64, 2937.34, 95.31,1)
			end
		end
		if zy == "法师" then
			使用技能("寒冰护体")
		else
			使用技能("疾跑")
		end
		路径走到("橙门到紫门",-1182.86, 2872.28, 85.7709)
		重置副本()
	end
end
function 闪现到(tarx,tary,tarz,d)
	if zy == "法师" then
		结束寻路()
		x,y,z = 当前坐标()
		朝向坐标(tarx,tary,tarz)
		按键("w",1)
		延时(90)
		按键("w",2)
		使用技能("闪现术")
		local fi=0
		for fi=1,50 do 
			延时(100)
			if not 在坐标范围(x,y,z,5) then
				break
			end
		end
	end
	走到(tarx,tary,tarz,1,0,d)
end
function 塞拉摩到剃刀高地()
	if 地图名() == "尘泥沼泽" then
		x,y,z = 当前坐标()
		if y<-4320 then
			路径走到("塞拉摩到剃刀高地",-3829.9, -4520.5, 10.886)
			打开NPC("巴德拉克")
			延时(500)
		end
		路径走到("塞拉摩到剃刀高地",-3829.9, -4520.5, 10.886)
		打开NPC("巴德拉克")
		--[[延时(500)
		坐飞机到("萨兰纳尔")--]]
	end
	if 在飞机上() then
		while 在飞机上() do 
			延时(1000)
		end
		跳()
		延时(1000)
	else
		if HP() > 1 then
			if 地图名() == "尘泥沼泽" or 地图名() == "贫瘠之地" then
				if 在路径范围("塞拉摩到剃刀高地") then
					路径走到("塞拉摩到剃刀高地",-4343.35, -1895.91, 90.1774)
				end
				--[[路径走到("塞拉摩到剃刀高地",-4657.06, -1830.11, 85.3194)
				if 在坐标范围(-4657.06, -1830.11, 85.3194,20) then
					坐船()
				end--]]
				if HP() == 0 then
					释放灵魂()
					虚弱复活()
				end
				if HP() == 1 then
					虚弱复活()
					复活()
				end
			end
		end
		--[[map = 地图名()
		if map == "千针石林" or map == "菲拉斯" then
			路径走到("萨兰纳尔到剃刀高地",-4493.89, -777.58, -40.1399)
			打开NPC("赛希亚娜")
			延时(500)
		end--]]
	end
	--[[map = 地图名()
	while map == "千针石林" or map == "菲拉斯" do
		路径走到("萨兰纳尔到剃刀高地",-4669.17, -1819.6, -44.1768)
		坐船()
		if HP() <= 1 then
			释放灵魂()
			x,y,z = 尸体坐标()
			路径走到("萨兰纳尔到剃刀高地",x,y,z)
			复活()
		end
		map = 地图名()
	end--]]
	map = 地图名()
	if map == "贫瘠之地" or map == "剃刀高地" and not 在副本() then
		if 在坐标范围(-2516.14, -1961.31, 91.7839,30) then
			走到(-2511.89, -1946.26, 91.7839)
			走到(-2533.44, -1924.41, 92.0282,1)
		end
		路径走到("陶阿祖营地到剃刀高地",-4659.06, -2526.03, 81.4828)
	end
end
function 塞拉摩到尼耶尔前哨站()
	if 地图名() == "尘泥沼泽" then
		x,y,z = 当前坐标()
		if y<-4300 then
			路径走到("塞拉摩到剃刀高地",-3829.9, -4520.5, 10.886)
			打开NPC("巴德拉克")
			延时(500)
		end
		打开NPC("巴德拉克")
		延时(500)
		坐飞机到("凄凉之地")
	end
	if 在飞机上() then
		while 在飞机上() do 
			延时(1000)
		end
		跳()
		延时(1000)
	else
		if not 在路径范围("塞拉摩到尼耶尔前哨站") and 在坐标范围(-3829.9, -4520.5, 10.886,80) then
			路径走到("塞拉摩到剃刀高地",-3662.4, -4412.22, 10.6594)
		end
		if 在路径范围("塞拉摩到尼耶尔前哨站") then
			路径走到("塞拉摩到尼耶尔前哨站",143.444, 1327.24, 193.499)
			走到(135.789, 1326.32, 193.499,1)
			打开NPC("巴瑞特·克罗斯")
			延时(500)
		end
	end
end
function 湿地到塞拉摩()
	if 地图名()=="湿地" then
		路径走到("铁炉堡到湿地",-3894.06, -603.565, 5.39573)
	end
	if 在坐标范围(-3894.06, -603.565, 5.39573,30) then
		坐船()
	end
end
function 法师传送到(fsmap)
	if 地图名() == fsmap then
		return true
	end
	if zy == "法师" and 背包物品数量("传送符文")>0 then
		if 存在技能("传送："..fsmap) then
			使用技能("传送："..fsmap)
			延时(3000)
			while 读条中() do 
				延时(1000)
			end
			延时(3000)
			while 过图中() do 
				延时(1000)
			end
			if 地图名() == fsmap then
				幽暗城补充材料()
				法师补充()
				return true
			end
		end
	end
	return false
end
function 南海镇到铁炉堡()
	if zhenying == "联盟" then
		if 地图名() == "希尔斯布莱德丘陵" then
			法师传送到("铁炉堡")
		end
		if 地图名() == "希尔斯布莱德丘陵" then
			if not 在飞机上() then
				if 在坐标范围(-851.47, -545.129, 11.0545,220) then
					路径走到("南海镇到血色",-851.47, -545.129, 11.0545)
					自动寻路(-816.025, -573.763, 15.4053)
					打开NPC("罗伯特·埃比斯彻尔")
					延时(1000)
					出售垃圾()
					延时(1000)
					自动寻路(-796.697, -540.717, 16.4009)
				end
			end
			路径走到("南海镇到血色",-715.574, -513.109, 26.3778)
			打开NPC("达尔拉·哈瑞斯")
			延时(500)
			打开NPC("达尔拉·哈瑞斯")
			延时(500)
			if zy == "潜行者" then
				local minc,maxc = 专业信息("草药学")
				num = 背包物品数量("闪光粉")
				if num < 40 or minc >=125 and maxc == 150 or minc >= 200 and maxc == 225 then
					if 坐飞机到("铁炉堡") then
						
					end
				elseif 坐飞机到("湿地") then
				elseif 坐飞机到("铁炉堡") then
				end
			else
				if 坐飞机到("湿地") then
				else
					if zy == "法师" then
						使用技能("传送：铁炉堡")
						延时(3000)
						if 读条中() then
							while 读条中() do 
								延时(1000)
							end
							延时(3000)
							while 过图中() do 
								延时(1000)
							end
						end
					end
					if 地图名() == "希尔斯布莱德丘陵" then
						if 坐飞机到("铁炉堡") then
						
						end
					end
				end
			end
			if 在飞机上() then
				while 在飞机上() do 
					延时(1000)
				end
			else
				自动寻路(-835.725, -545.15, 14.0931)
				路径走到("铁炉堡到南海镇",-4822.53, -1153.34, 502.21)
				打开NPC("格莱斯·瑟登")
				延时(1000)
			end
		end
		if 地图名() == "铁炉堡" then
			if zy == "法师" then
				法师补充()
			end
			if zy == "潜行者" then
				盗贼补充()
			end
			提升草药技能()
			自动寻路(-4822.16, -1153.94, 502.209)
		end
	end

end
function 法师补充()
	if 地图名() == "铁炉堡" then
		if zy == "法师" then
			if not 存在技能("传送：铁炉堡") then
				自动寻路(-4607.09, -914.721, 501.062)
				打开NPC("贝尔斯塔弗·风暴之眼")
				延时(1000)
				对话选项(1)
				延时(1000)
				学习技能(0)
			end
			local num = 背包物品数量("传送符文")
			if 存在技能("召唤餐桌") then
				num2 = 背包物品数量("魔粉")
			else
				num2 = 100
			end
			if num < 6 or num2 < 20 then
				自动寻路(-4714.27, -961.584, 505.288)
				打开NPC("吉恩")
				延时(1000)
				if num < 6 then
					购买物品(7,20-num)
				end
				延时(1000)
				if num2 < 20 then
					购买物品(9,20-num2)
				end
				延时(1000)
				自动寻路(-4704.26, -937.205, 501.673)
			end
		end
	end
end
function 南海镇到湿地()
	if zhenying == "联盟" then
		if 地图名() == "希尔斯布莱德丘陵" then
			法师传送到("铁炉堡")
		end
		if 地图名() == "希尔斯布莱德丘陵" then
			if not 在飞机上() then
				if 在坐标范围(-851.47, -545.129, 11.0545,220) then
					路径走到("南海镇到血色",-851.47, -545.129, 11.0545)
					自动寻路(-816.025, -573.763, 15.4053)
					打开NPC("罗伯特·埃比斯彻尔")
					延时(1000)
					出售垃圾()
					延时(1000)
					自动寻路(-796.697, -540.717, 16.4009)
				end
			end
			路径走到("南海镇到血色",-715.574, -513.109, 26.3778)
			打开NPC("达尔拉·哈瑞斯")
			延时(500)
			打开NPC("达尔拉·哈瑞斯")
			延时(500)
			if zy == "潜行者" then
				local minc,maxc = 专业信息("草药学")
				num = 背包物品数量("闪光粉")
				if num < 40 or minc >=125 and maxc == 150 or minc >= 200 and maxc == 225 then
					if 坐飞机到("铁炉堡") then
						
					end
				elseif 坐飞机到("湿地") then
				elseif 坐飞机到("铁炉堡") then
				end
			else
				if 坐飞机到("湿地") then
				else
					if zy == "法师" then
						使用技能("传送：铁炉堡")
						延时(3000)
						if 读条中() then
							while 读条中() do 
								延时(1000)
							end
							延时(3000)
							while 过图中() do 
								延时(1000)
							end
						end
					end
					if 地图名() == "希尔斯布莱德丘陵" then
						if 坐飞机到("铁炉堡") then
						
						end
					end
				end
			end
			if 在飞机上() then
				while 在飞机上() do 
					延时(1000)
				end
			else
				自动寻路(-835.725, -545.15, 14.0931)
				路径走到("铁炉堡到南海镇",-4822.53, -1153.34, 502.21)
				打开NPC("格莱斯·瑟登")
				延时(1000)
			end
		end
		if 地图名() == "铁炉堡" then
			if zy == "法师" then
				法师补充()
			end
			if zy == "潜行者" then
				盗贼补充()
			end
			提升草药技能()
			自动寻路(-4822.16, -1153.94, 502.209)
			if 打开NPC("格莱斯·瑟登") then
				延时(500)
			elseif 打开NPC("格莱斯·瑟登") then
				延时(500)
			end
			if 坐飞机到("湿地") then
				
			end
			if not 在飞机上() then
				铁炉堡到湿地()
			end
		end
		while 在飞机上() do 
			延时(1000)
		end
	end
end
function 南海镇到剃刀高地()
	if zhenying == "联盟" then
		南海镇到湿地()
		if HP() > 1 then
			湿地到塞拉摩()
			塞拉摩到剃刀高地()
		end
	end
end
function 塞拉摩到铁炉堡()
	if 地图名() == "尘泥沼泽" then
		法师传送到("铁炉堡")
	end
	if 地图名() == "尘泥沼泽" then
		路径走到("塞拉摩到剃刀高地",-4004.16, -4728.56, 5.11052)
		坐船()
	end
	if 地图名() == "湿地" then
		路径走到("铁炉堡到湿地",-3792.75, -784.293, 9.27279)
		if 在坐标范围(-3792.75, -784.293, 9.27279,10) then
			打开NPC("谢尔雷·布隆迪尔")
			延时(500)
			打开NPC("谢尔雷·布隆迪尔")
			延时(500)
			if 坐飞机到("铁炉堡") then
				
			end
		end
	end
	while 在飞机上() do 
		延时(1000)
	end
	if 地图名() == "湿地" then
		路径走到("铁炉堡到湿地",-4957.48, -981.727, 501.62)
	end
	if 地图名() == "铁炉堡" then
		法师补充()
		盗贼补充()
		提升草药技能()
	end
	while 在飞机上() do 
		延时(1000)
	end
end
function 铁炉堡到湿地()
	if 地图名() == "铁炉堡" then
		自动寻路(-4822.16, -1153.94, 502.209)
		if 打开NPC("格莱斯·瑟登") then
			延时(500)
		elseif 打开NPC("格莱斯·瑟登") then
			延时(500)
		end
		if 坐飞机到("湿地") then
			
		end
		if not 在飞机上() then
			自动寻路(-4952.31, -983.833, 501.596)
		end
	end
	while 在飞机上() do 
		延时(1000)
	end
	if 在路径范围("铁炉堡到湿地") then
		路径走到("铁炉堡到湿地",-3792.75, -784.293, 9.27279)
	end
	if 在坐标范围(-3792.75, -784.293, 9.27279,10) then
		打开NPC("谢尔雷·布隆迪尔")
		延时(500)
	end
end 
function 雷霆崖补充材料(bd)
	if 地图名() == "雷霆崖" then
		if 在路径范围("雷霆崖到飞机点") then
			路径走到("雷霆崖到飞机点",-1252.88, 65.2824, 127.355)
		end
		if bd == nil then
			if 炉石位置() ~= "雷霆崖" and 炉石位置()~="幽暗城" then  --
				路径走到("雷霆崖旅店到草药训练师",-1299.39, 38.8743, 129.209)
				while 炉石位置() ~= "雷霆崖" do 
					打开NPC("旅店老板帕拉")
					延时(1000)
					对话选项(1)
					延时(1000)
					运行宏("/run ConfirmBinder()/n/click StaticPopup1Button1")
					延时(1000)
				end
				路径走到("雷霆崖旅店到草药训练师",-1252.88, 65.2824, 127.355)
			end
		end
		路径走到("雷霆崖旅店到草药训练师",-1252.88, 65.2824, 127.355)
		走到(-1236.92, 99.2891, 129.194,1)
		打开NPC("陶尔·石蹄")
		延时(1000)
		出售垃圾()
		走到(-1252.88, 65.2824, 127.355,1)
		if zy == "法师" then
			x,y,z = 当前坐标()
			if z > 110 and z < 134 then
				local num = 背包物品数量("传送符文")
				if 存在技能("召唤餐桌") then
					num2 = 背包物品数量("魔粉")
				else
					num2 = 100
				end
				if num < 5 or num2<20 then
					清除目标()
					运行宏("/target 切比")
					延时(500)
					while 背包物品数量("传送符文") < 5 and 有目标() do 
						x,y,z = 目标坐标()
						路径走到("雷霆崖材料商路径",x,y,z)
						if 打开NPC("切比") then
							if num < 5 then
								购买物品(7,20-num)
							end
							if num2 < 20 then
								购买物品(9,20-num2)
							end
							延时(3000)
						end
					end
					清除目标()
					路径走到("雷霆崖材料商路径",-1252.88, 65.2824, 127.355)
				end
			end
		end
		提升草药技能()
	end
end
function 转场玛拉顿()
	local lsmap=炉石位置()
	while 在飞机上() do 
		延时(1000)
	end
	if zhenying == "部落" then
		if zy == "法师" then
			map=地图名()
			if map ~= "凄凉之地" and map~="石爪山脉" and map ~= "玛拉顿" then
				if lsmap == "烈日石居" or lsmap == "葬影村" then
					炉石()
				else
					if 存在技能("传送：雷霆崖") then
						法师传送到("雷霆崖")
					elseif 存在技能("传送：奥格瑞玛") then
						法师传送到("奥格瑞玛")
					end
				end
			end
		end
		if 地图名() == "幽暗城" then
			x,y,z = 当前坐标()
			if z < 50 then
				路径走到("幽暗城法师传送到旅店电梯",1595.18, 176.086, -41.4176)
				坐船()
			end
			路径走到("布瑞尔旅店到幽暗电梯上",2024.18, 289.523, 50.534)
		end
		if 小地图名()=="洛丹伦废墟" then
			路径走到("布瑞尔旅店到幽暗电梯上",2024.18, 289.523, 50.534)
		end
		提瑞斯法林地到奥格()
		if 地图名() == "石爪山脉" and lsmap ~= "烈日石居" then
			路径走到("葬影村飞行点到烈日石居",969.897, 1043.03, 104.446)
			打开NPC("萨尔姆")
			打开NPC("萨尔姆")
			if 坐飞机到("雷霆崖") then
			elseif 坐飞机到("陶拉祖营地") then
			elseif 坐飞机到("十字路口") then
			elseif 坐飞机到("奥格瑞玛") then
			end
		end
		while 在飞机上() do 
			延时(1000)
		end
		if 地图名() == "奥格瑞玛" then
			布瑞尔到陶拉祖营地()
		end
		奥格到雷霆崖()
		if 地图名() == "雷霆崖" then
			雷霆崖补充材料(1)
			if zy == "潜行者" then
				num = 背包物品数量("闪光粉")
				if num < 20 then
					路径走到("雷霆崖到飞机点",-1197.18, 27.5771, 176.948)
					打开NPC("塔尔")
					延时(500)
					打开NPC("塔尔")
					延时(1000)
					if 坐飞机到("奥格瑞玛") then
						while 在飞机上() do 
							延时(1000)
						end
					end
					if 地图名() == "奥格瑞玛" then
						路径走到("奥格飞行点下到法师传送",1656.82, -4357.65, 25.3364)
						奥格补充材料()
						路径走到("奥格飞行点下到法师传送",1674.78, -4322.38, 61.2465)
						if 在坐标范围(1674.78, -4322.38, 61.2465,10) then
							走到(1676.46, -4315.67, 61.5217,1)
							if 打开NPC("多拉斯") then
								延时(500)
							else
								打开NPC("多拉斯")
								延时(500)
							end
							if 坐飞机到("葬影村") then
							elseif 坐飞机到("烈日石居") then
							elseif 坐飞机到("十字路口") then
							end
						end
					end
				end
			end
			while 在飞机上() do 
				延时(1000)
			end
			if 地图名() == "雷霆崖" then
				路径走到("雷霆崖到飞机点",-1197.18, 27.5771, 176.948)
				打开NPC("塔尔")
				延时(500)
				打开NPC("塔尔")
				延时(1000)
				if 坐飞机到("葬影村") then
				elseif 坐飞机到("烈日石居") then
				elseif 坐飞机到("十字路口") then
				end
			end
		end
		while 在飞机上() do 
			延时(1000)
		end
		if lsmap ~= "烈日石居" and lsmap ~= "葬影村" then
			if 地图名() == "雷霆崖" or 在路径范围("十字路口飞机到烈日石居飞机") or 在路径范围("葬影村飞行点到烈日石居") then
				if 在坐标范围(-441.8, -2596.08, 96.06,30) or 在路径范围("十字路口飞机到烈日石居飞机") then
					路径走到("十字路口飞机到烈日石居飞机",966.684, 1038.35, 104.187)
					打开NPC("萨尔姆")
					延时(500)
				end
				if 在坐标范围(966.684, 1038.35, 104.187,20) then
					打开NPC("萨尔姆")
					坐飞机到("葬影村")
				end
				while 在飞机上() do 
					延时(1000)
				end
			end
			if 在坐标范围(966.684, 1038.35, 104.187,20) then
				路径走到("葬影村飞行点到烈日石居",-1769.17, 3262.7, 5.19827)
				打开NPC("萨隆")
				延时(500)
			end
		end
		while 在飞机上() do 
			延时(1000)
		end
	end
	if zhenying == "联盟" then
		while 在飞机上() do 
			延时(1000)
		end
		if zy == "法师" then
			map=地图名()
			if map ~= "凄凉之地" and map~="石爪山脉" and map ~= "玛拉顿" then
				if lsmap == "石爪峰" or lsmap == "尼耶尔前哨站" then
					炉石()
				else
					if 存在技能("传送：铁炉堡") then
						法师传送到("铁炉堡")
					elseif 存在技能("传送：暴风城") then
						法师传送到("暴风城")
						暴风城到铁炉堡()
					end
				end
			end
		end
		if 地图名() == "石爪山脉" and 炉石位置()~="石爪峰" then
			路径走到("石爪峰修理",2682.17, 1467.43, 233.56)
			打开NPC("泰罗伦")
			打开NPC("泰罗伦")
			if 坐飞机到("塞拉摩") then
			elseif 坐飞机到("尼耶尔前哨站") then
			end
			while 在飞机上() do 
				延时(1000)
			end
			if 地图名() == "凄凉之地" or 在坐标范围(2682.17, 1467.43, 233.56,20) then
				if 在坐标范围(2682.17, 1467.43, 233.56,20) then
					路径走到("凄凉之地到石爪峰",146.274, 1322.45, 192.61)
					走到(135.789, 1326.32, 193.499,1)
					打开NPC("巴瑞特·克罗斯")
					打开NPC("巴瑞特·克罗斯")
					延时(1000)
					坐飞机到("塞拉摩")
					while 在飞机上() do 
						延时(1000)
					end
				end
				if 地图名() == "凄凉之地" then
					路径走到("塞拉摩到尼耶尔前哨站",-3829.9, -4520.5, 10.886)
					打开NPC("巴德拉克")
					打开NPC("巴瑞特·克罗斯")
					延时(500)
				end
			end
		end
		if zy == "潜行者" and 背包物品数量("闪光粉")<20 or zy == "法师" and 背包物品数量("传送符文")<3 or 地图名() == "铁炉堡" then
			塞拉摩到铁炉堡()
		end
		铁炉堡到湿地()
		南海镇到湿地()
		湿地到塞拉摩()
		if 地图名() == "尘泥沼泽" then
			mincaiyao,maxcaiyao = 专业信息("草药学")
			if maxcaiyao == 300 then
				while 炉石位置()~= "塞拉摩岛" and 炉石位置()~="铁炉堡" and 炉石位置()~="石爪峰" do
					路径走到("塞拉摩到剃刀高地",-3618, -4470.05, 14.2459)
					打开NPC("旅店老板詹妮")
					延时(1000)
					对话选项(1)
					延时(1000)
					运行宏("/run ConfirmBinder()/n/click StaticPopup1Button1")
					延时(1000)
				end
			end
			塞拉摩到尼耶尔前哨站()
		end
		while 在飞机上() do 
			延时(1000)
		end
	end
	石爪峰修理()
end
function 换绑炉石()
	local lsmap = 炉石位置()
	if zhenying == "联盟" then
		if lsmap == "石爪峰" then
			炉石()
			if 地图名() == "石爪山脉" then
				路径走到("石爪峰修理",2682.17, 1467.43, 233.56)
				打开NPC("泰罗伦")
				打开NPC("泰罗伦")
				if 坐飞机到("塞拉摩") then
				elseif 坐飞机到("尼耶尔前哨站") then
				end
				while 在飞机上() do 
					延时(1000)
				end
			end
			if 地图名() == "凄凉之地" or 在坐标范围(2682.17, 1467.43, 233.56,20) then
				if 在坐标范围(2682.17, 1467.43, 233.56,20) then
					路径走到("凄凉之地到石爪峰",146.274, 1322.45, 192.61)
					走到(135.789, 1326.32, 193.499,1)
					打开NPC("巴瑞特·克罗斯")
					打开NPC("巴瑞特·克罗斯")
					延时(1000)
					坐飞机到("塞拉摩")
					while 在飞机上() do 
						延时(1000)
					end
				end
				if 地图名() == "凄凉之地" then
					路径走到("塞拉摩到尼耶尔前哨站",-3829.9, -4520.5, 10.886)
					打开NPC("巴德拉克")
					延时(500)
				end
			end
			if 地图名() == "尘泥沼泽" then
				while 炉石位置()~= "塞拉摩岛" do
					路径走到("塞拉摩到剃刀高地",-3618, -4470.05, 14.2459)
					打开NPC("旅店老板詹妮")
					延时(1000)
					对话选项(1)
					延时(1000)
					运行宏("/run ConfirmBinder()/n/click StaticPopup1Button1")
					延时(1000)
				end
			end
		end 
	else
		if lsmap == "烈日石居" then
			map = 地图名()
			if map ~= "雷霆崖" and map ~= "莫高雷" then
				炉石()
			end
			if 地图名() == "幽暗城" then
				x,y,z = 当前坐标()
				if z < 50 then
					路径走到("幽暗城法师传送到旅店电梯",1595.18, 176.086, -41.4176)
					坐船()
				end
				路径走到("布瑞尔旅店到幽暗电梯上",2024.18, 289.523, 50.534)
			end
			if 地图名() == "提瑞斯法林地" then
				提瑞斯法林地到奥格()
			end
			if 地图名() == "石爪山脉" then
				路径走到("葬影村飞行点到烈日石居",969.897, 1043.03, 104.446)
				打开NPC("萨尔姆")
				打开NPC("萨尔姆")
				if 坐飞机到("雷霆崖") then
				elseif 坐飞机到("陶拉祖营地") then
				elseif 坐飞机到("十字路口") then
				elseif 坐飞机到("奥格瑞玛") then
				end
			end
			if 在飞机上() then
				while 在飞机上() do 
					延时(1000)
				end
				跳()
				延时(1000)
			end
			奥格到雷霆崖()
			if 地图名() == "雷霆崖" then
				雷霆崖补充材料()
				路径走到("雷霆崖旅店到草药训练师",-1252.88, 65.2824, 127.355)
			end
		end
	end
end
function 奥格到提瑞斯法林地()
	if 地图名() == "奥格瑞玛" or 地图名() == "杜隆塔尔" then
		自动寻路(1331.01, -4617.81, 23.6728)
		路径走到("杜隆塔尔到飞船",1320.49, -4653.19, 53.8842)
		if HP() > 1 then
			if 在坐标范围(1320.49, -4653.19, 53.8842,10) then
				坐船()
			end
		end
	end
	if 地图名() == "提瑞斯法林地" then
		if 在路径范围("幽暗城飞船下") then
			路径走到("幽暗城飞船下",2085.69, 276.997, 57.0526)
			自动寻路(2024.18, 289.523, 50.534)
		end
	end
end
function 换绑雷霆崖()
	if zhenying == "部落" and 炉石位置() ~= "雷霆崖" then
		if 法师传送到("雷霆崖") then
		elseif 法师传送到("奥格瑞玛") then
		else
			if 炉石可用() then
				炉石()
			end
		end
		if 地图名() == "幽暗城" then
			x,y,z = 当前坐标()
			if z < 50 then
				路径走到("幽暗城法师传送到旅店电梯",1595.18, 176.086, -41.4176)
				坐船()
			end
			路径走到("布瑞尔旅店到幽暗电梯上",2024.18, 289.523, 50.534)
		end
		if 地图名() == "提瑞斯法林地" then
			提瑞斯法林地到奥格()
		end
		if 地图名() == "石爪山脉" then
			路径走到("葬影村飞行点到烈日石居",969.897, 1043.03, 104.446)
			打开NPC("萨尔姆")
			打开NPC("萨尔姆")
			if 坐飞机到("雷霆崖") then
			elseif 坐飞机到("陶拉祖营地") then
			elseif 坐飞机到("十字路口") then
			elseif 坐飞机到("奥格瑞玛") then
			end
		end
		if 在飞机上() then
			while 在飞机上() do 
				延时(1000)
			end
			跳()
			延时(1000)
		end
		奥格到雷霆崖()
		if 地图名() == "雷霆崖" then
			雷霆崖补充材料()
			路径走到("雷霆崖旅店到草药训练师",-1252.88, 65.2824, 127.355)
		end
	end
end
function 换绑幽暗城()
	if zhenying == "部落" and 炉石位置() ~= "幽暗城" then
		if 地图名() ~= "提瑞斯法林地" and 地图名() ~= "幽暗城" then
			if 法师传送到("幽暗城") then
			elseif 法师传送到("奥格瑞玛") then
			else
				if 炉石可用() then
					炉石()
				end
			end
		else
			if 炉石可用() then
				炉石()
			end
		end
		if HP()<=1 then
			释放灵魂()
			虚弱复活()
		end
		if 地图名() == "石爪山脉" then
			路径走到("葬影村飞行点到烈日石居",969.897, 1043.03, 104.446)
			打开NPC("萨尔姆")
			打开NPC("萨尔姆")
			if 坐飞机到("奥格瑞玛") then
			end
		end
		if 在飞机上() then
			while 在飞机上() do 
				延时(1000)
			end
			跳()
			延时(1000)
		end
		if 地图名() == "雷霆崖" then
			路径走到("雷霆崖旅店到草药训练师",-1252.88, 65.2824, 127.355)
			路径走到("雷霆崖到飞机点",-1197.18, 27.5771, 176.948)
			打开NPC("塔尔")
			延时(500)
			打开NPC("塔尔")
			延时(1000)
			if 坐飞机到("奥格瑞玛") then
			end
		end
		if 在飞机上() then
			while 在飞机上() do 
				延时(1000)
			end
			跳()
			延时(1000)
		end
		if 地图名() == "奥格瑞玛" then
			if 在坐标范围(1675.53, -4317.13, 61.4881,10) then
				走到(1665.2, -4336.71, 61.2462)
				走到(1666.31, -4345.79, 61.2465)
				走到(1659.19, -4378.68, 23.528,1,1)
			end
		end
		奥格到提瑞斯法林地()
		提瑞斯法林地到幽暗城()
		if 地图名() == "幽暗城" then
			x,y,z = 当前坐标()
			if z <50 then
				路径走到("幽暗城法师传送到旅店电梯",1633.91, 223.737, -43.1026)
				while 炉石位置() ~= "幽暗城" do 
					打开NPC("旅店老板诺曼")
					延时(1000)
					对话选项(1)
					延时(1000)
					运行宏("/run ConfirmBinder()/n/click StaticPopup1Button1")
					延时(1000)
				end
			end
		end
	end
end
function 提瑞斯法林地到幽暗城()
	x,y,z = 当前坐标()
	if 地图名() == "提瑞斯法林地" or 小地图名() == "洛丹伦废墟" or 地图名()=="幽暗城" and z > 50 then
		if not 在路径范围("布瑞尔旅店到幽暗电梯上") then
			if 地图名() == "提瑞斯法林地" then
				自动寻路(2024.18, 289.523, 50.534)
			end
			
		end
		路径走到("布瑞尔旅店到幽暗电梯上",1594.9, 199.673, 55.2423)
		坐船()
	end
	if 地图名() == "幽暗城" then
		x,y,z = 当前坐标()
		if z <50 then
			if zy == "法师" and not 存在技能("传送：幽暗城") then
				路径走到("幽暗城法师传送到旅店电梯",1776.72, 65.3212, -46.3213)
				打开NPC("莱克斯顿·莫泰姆")
				延时(1000)
				对话选项(1)
				延时(1000)
				学习技能(0)
				延时(1000)
			end
			路径走到("幽暗城法师传送到旅店电梯",1633.91, 223.737, -43.1026)
		end
	end
end
function 幽暗城补充材料()
	if 地图名() == "幽暗城" then
		if 在路径范围("幽暗城法师传送到旅店电梯") then
			路径走到("幽暗城法师传送到旅店电梯",1632.76, 243.327, -43.1023)
			走到(1634.53, 258.671, -43.1023,1)
			if 打开NPC("劳伦·纽科布") then
				出售垃圾()
				出售垃圾()
			end
			走到(1632.76, 243.327, -43.1023,1)
		end
		if zy == "潜行者" then
			local num = 背包物品数量("闪光粉")
			if num < 20 then
				if 在路径范围("幽暗城毒药商到旅店") then
					路径走到("幽暗城毒药商到旅店",1548.87, 148.86, -62.1753)
					打开NPC("艾泽基尔·格瑞乌斯")
					延时(1000)
					local ci,i=0,0
					ci=math.modf((40-num)/20)
					for i=1,ci do
						购买物品(5,20)
						延时(1000)
					end
					if (40-num)%20 > 0 then
						购买物品(5,(40-num)%20)
						延时(1000)
					end
					路径走到("幽暗城毒药商到旅店",1633.23, 222.59, -43.1026)
				end
			end
		end
		if zy == "法师" then
			local num = 背包物品数量("传送符文")
			if 存在技能("召唤餐桌") then
				num2 = 背包物品数量("魔粉")
			else
				num2 = 100
			end
			if num < 5 or num2 < 20 then
				if 在路径范围("幽暗城法师传送到旅店电梯") then
					路径走到("幽暗城法师传送到旅店电梯",1626.66, 206.756, -43.1026)
					打开NPC("托马斯·莫丹")
					延时(1000)
					if num < 5 then
						购买物品(7,20-num)
					end
					if num2 < 20 then
						购买物品(9,20-num2)
					end
					延时(1000)
					路径走到("幽暗城法师传送到旅店电梯",1633.23, 222.59, -43.1026)
				end
			end
		elseif zy == "圣骑士" then
			local num = 背包物品数量("王者印记")
			if num < 20 then
				if 在路径范围("幽暗城法师传送到旅店电梯") then
					路径走到("幽暗城法师传送到旅店电梯",1626.66, 206.756, -43.1026)
					打开NPC("托马斯·莫丹")
					延时(1000)
					购买物品(19,100-num)
					延时(1000)
					路径走到("幽暗城法师传送到旅店电梯",1633.23, 222.59, -43.1026)
				end
			end
		end
	end
end
function 换绑铁炉堡()
	if zhenying == "联盟" and 炉石位置() ~= "铁炉堡" then
		if zy=="法师" then
			法师传送到("铁炉堡")
		end 
		if 地图名() ~= "铁炉堡" then
			if 炉石可用() then
				炉石()
			end
		end
		if 地图名() == "暴风城" or 地图名() == "艾尔文森林" then
			暴风城到铁炉堡()
		end
		if 地图名() == "石爪山脉" then
			路径走到("石爪峰修理",2682.17, 1467.43, 233.56)
			打开NPC("泰罗伦")
			打开NPC("泰罗伦")
			if 坐飞机到("塞拉摩") then
			elseif 坐飞机到("尼耶尔前哨站") then
			end
		end
		while 在飞机上() do 
			延时(1000)
		end
		if 地图名() == "凄凉之地" or 在坐标范围(2682.17, 1467.43, 233.56,20) then
			if 在坐标范围(2682.17, 1467.43, 233.56,20) then
				路径走到("凄凉之地到石爪峰",146.274, 1322.45, 192.61)
				走到(135.789, 1326.32, 193.499,1)
				打开NPC("巴瑞特·克罗斯")
				打开NPC("巴瑞特·克罗斯")
				延时(1000)
				坐飞机到("塞拉摩")
				while 在飞机上() do 
					延时(1000)
				end
			end
			if 地图名() == "凄凉之地" then
				路径走到("塞拉摩到尼耶尔前哨站",-3829.9, -4520.5, 10.886)
				打开NPC("巴德拉克")
				延时(500)
			end
		end
		while 在飞机上() do 
			延时(1000)
		end
		if 地图名() == "尘泥沼泽" or 地图名() == "湿地" then
			塞拉摩到铁炉堡()
		end
		if 地图名() == "希尔斯布莱德丘陵" then
			南海镇到铁炉堡()
		end
		if 地图名() == "湿地" then
			路径走到("铁炉堡到湿地",-3792.75, -784.293, 9.27279)
			if 在坐标范围(-3792.75, -784.293, 9.27279,10) then
				打开NPC("谢尔雷·布隆迪尔")
				延时(500)
				打开NPC("谢尔雷·布隆迪尔")
				延时(500)
				if 坐飞机到("铁炉堡") then
					
				end
			end
		end
		while 在飞机上() do 
			延时(1000)
		end
		if 地图名() == "铁炉堡" then
			自动寻路(-4840.17, -859.473, 502.782)
			while 炉石位置() ~= "铁炉堡" do
				打开NPC("旅店老板洛雷·火酒")
				延时(1000)
				对话选项(1)
				延时(1000)
				运行宏("/run ConfirmBinder()/n/click StaticPopup1Button1")
				延时(1000)
			end
			法师补充()
			盗贼补充()
		end
	end
end
function 换绑暴风城()
	if zhenying == "部落" then
		return
	end
	map = 地图名()
	if map~="铁炉堡" and map ~= "暴风城" and map~="艾尔文森林" and not 在副本() and map~="死亡矿井" and map~="西部荒野" and map~="死亡矿井" then
		炉石()
	end
	if 地图名() == "铁炉堡" then
		自动寻路(-4822.16, -1153.94, 502.209)
		if 打开NPC("格莱斯·瑟登") then
			延时(500)
		elseif 打开NPC("格莱斯·瑟登") then
			延时(500)
		end
		if 坐飞机到("暴风城") then
			
		end
	end
	while 在飞机上() do 
		延时(1000)
	end
	while 炉石位置() ~= "暴风城" do
		自动寻路(-8858.53, 659.377, 96.6362)
		路径走到("闪金镇到监狱",-8858.53, 659.377, 96.6362)
		if HP() > 1 then
			走到(-8863.54,666.618,97.9038)
			走到(-8867.04,672.6,97.9,1)
			while 炉石位置() ~= "暴风城" do
				打开NPC("旅店老板奥里森")
				延时(1000)
				对话选项(1)
				延时(1000)
				运行宏("/click StaticPopup1Button1")
				延时(1000)
			end
			走到(-8863.54,666.618,97.9038)
			走到(-8858.53, 659.377, 96.6362)
		else
			释放灵魂()
			x,y,z = 尸体坐标()
			自动寻路(x,y,z,25)
			复活()
		end
	end
end
function 铁炉堡交易_小号()
	if 地图名() == "暴风城" then
		暴风城到铁炉堡()
	end
	if 地图名() == "铁炉堡" then
		if not 在坐标范围(-4888.45, -995.103, 504.758,6) then
			自动寻路(-4888.45, -995.103, 504.758)
		end
		if zy == "法师" then
			销毁物品("法力蓝宝石",1)
			销毁物品("法力红宝石",1)
			销毁物品("法力黄水晶",1)
			销毁物品("法力玛瑙",1)
		end
		交易_小号()
	end
end
function 铁炉堡交易_仓库()
	if 地图名() ~= "铁炉堡" then
		if 炉石位置() == "铁炉堡" then
			炉石()
		else
			if 法师传送到("铁炉堡") then
			else
				if 地图名() == "暴风城" then
					暴风城到铁炉堡()
				end
			end
		end
	end
	if 地图名() == "铁炉堡" then
		if not 在坐标范围(-4888.45, -995.103, 504.758,6) then
			自动寻路(-4888.45, -995.103, 504.758)
		end
		if 交易_仓库() then
			return true
		end
	end
	return false
end
function 幽暗城交易_小号()
	if 地图名() == "幽暗城" then
		if not 在坐标范围(1601.95, 240.435, -52.1443,5) then
			路径走到("幽暗城法师传送到旅店电梯",1601.95, 240.435, -52.1443)
		end
		下马()
		if zy == "法师" then
			销毁物品("法力蓝宝石",1)
			销毁物品("法力红宝石",1)
			销毁物品("法力黄水晶",1)
			销毁物品("法力玛瑙",1)
		end
		交易_小号()
	end
end
function 幽暗城交易_仓库()
	if 地图名() ~= "幽暗城" then
		if 炉石位置() == "幽暗城" then
			炉石()
		else
			if 法师传送到("幽暗城") then
			else
				if 地图名() == "奥格瑞玛" then
					奥格到提瑞斯法林地()
				end
				提瑞斯法林地到幽暗城()
			end
		end
	end
	if 地图名() == "幽暗城" then
		if not 在坐标范围(1601.29, 240.396, -51.1799,5) then
			路径走到("幽暗城法师传送到旅店电梯",1601.29, 240.396, -51.1799)
		end
		if 交易_仓库() then
			return true
		end
	end
	return false
end
function 雷霆崖交易_小号()
	if 地图名() == "雷霆崖" then
		if not 在坐标范围(-1261.44, 24.9744, 128.187,6) then
			if 在路径范围("雷霆崖传送点到电梯") then
				路径走到("雷霆崖传送点到电梯",-1209.47, 130.584, 134.497)
				路径走到("雷霆崖到飞机点",-1251.01, 66.7901, 127.379)
				走到(-1261.51, 45.6542, 127.442,1)
			else
				路径走到("雷霆崖旅店到草药训练师",-1261.51, 45.6542, 127.442)
			end
			路径走到("雷霆崖旅店到银行",-1261.44, 24.9744, 128.187)
		end
		if zy == "法师" then
			销毁物品("法力蓝宝石",1)
			销毁物品("法力红宝石",1)
			销毁物品("法力黄水晶",1)
			销毁物品("法力玛瑙",1)
		end
		交易_小号()
		路径走到("雷霆崖旅店到银行",-1261.51, 45.6542, 127.442)
	end
end
function 雷霆崖交易_仓库()
	if 地图名() ~= "雷霆崖" then
		if 炉石位置() == "雷霆崖" then
			炉石()
		else
			if 法师传送到("雷霆崖") then
			else
				if 地图名() == "奥格瑞玛" then
					奥格到雷霆崖()
				end
			end
		end
	end
	if 地图名() == "雷霆崖" then
		if not 在坐标范围(-1261.23, 22.8048, 128.187,5) then
			if 在路径范围("雷霆崖传送点到电梯") then
				路径走到("雷霆崖传送点到电梯",-1209.47, 130.584, 134.497)
				路径走到("雷霆崖到飞机点",-1251.01, 66.7901, 127.379)
				走到(-1261.51, 45.6542, 127.442,1)
			else
				路径走到("雷霆崖旅店到草药训练师",-1261.51, 45.6542, 127.442)
			end
			路径走到("雷霆崖旅店到银行",-1261.23, 22.8048, 128.187)
		end
		if 交易_仓库() then
			return true
		end
	end
	return false
end
function 副本次数清零()
	置剃刀次数(0)
	置血色次数(0)
	置副本次数("剃刀沼泽",0)
	置副本次数("玛拉顿",0)
	置副本次数("厄运之槌",0)
end
function 在主城()
	local map = 地图名()
	if map == "雷霆崖" or map == "铁炉堡" or map == "幽暗城" or map == "暴风城" then
		return true
	end
	return false
end
function 暴风城巫师圣殿出门()
	if 小地图名()=="巫师圣殿" then
		走到(-9017.31, 885.528, 29.6207,1)
		朝向坐标(-9018.93, 887.626, 29.6207)
		移动("前",2500)
	end
	if 在路径范围("暴风城法师塔下到门口") then
		路径走到("暴风城法师塔下到门口",-8979.27, 871.838, 121.892)
	end
end
function 暴风城到铁炉堡()
	local map = 地图名()
	if zy == "法师" then
		法师传送到("铁炉堡")
	end
	if map=="暴风城" or map == "艾尔文森林" then
		暴风城巫师圣殿出门()
		自动寻路(-8837.28, 488.947, 109.612)
		打开NPC("杜加尔·朗德瑞克")
		延时(1500)
		if 坐飞机到("铁炉堡") then
		else
			自动寻路(-8356.44, 526.738, 91.7971)
			朝向坐标(-8352.91, 522.496, 91.7971)
			移动("前",5000)
			while 过图中() do 
				延时(1000)
			end
		end
	end
	while 在飞机上() do 
		延时(1000)
	end
	if 地图名() == "矿道地铁" then
		if 在坐标范围(67.7607, 2490.98, -4.29649,120) then
			走到(12.9275, 2490.48, -4.07236,1)
			坐船()
		end
	end
	if 地图名() == "铁炉堡" then
		if 职业() == "潜行者" then
			自动寻路(-4640.69, -1131.94, 507.161)
			num = 背包物品数量("闪光粉")
			if num < 40 then
				打开NPC("泰努斯·毒芽")
				延时(1000)
				local tarNum = 40
				if 背包空格() > 40 then
					tarNum=100
				end
				ci=math.modf((tarNum-num)/20)
				for i=1,ci do
					购买物品(5,20)
					延时(1000)
				end
				if (tarNum-num)%20 > 0 then
					购买物品(5,(tarNum-num)%20)
					延时(1000)
				end
			end
		end
		if 职业() == "法师" and not 存在技能("传送：铁炉堡") then
			自动寻路(-4607.09, -914.721, 501.062)
			打开NPC("贝尔斯塔弗·风暴之眼")
			延时(1000)
			对话选项(1)
			延时(1000)
			学习技能(0)
			local num = 背包物品数量("传送符文")
			if num < 8 then
				自动寻路(-4714.27, -961.584, 505.288)
				打开NPC("吉恩")
				延时(1000)
				购买物品(7,20-num)
				延时(1000)
				自动寻路(-4704.26, -937.205, 501.673)
			end
		end
		local minc,maxc = 专业信息("草药学")
		if minc >=125 and maxc == 150 or minc >= 200 and maxc == 225 then
			自动寻路(-4881.28, -1154.66, 505.77)
			打开NPC("雷纳·石枝")
			延时(1000)
			对话选项(1)
			延时(1000)
			学习技能(0)
			自动寻路(-4862.97, -1130.26, 502.18)
		end
		自动寻路(-4821.58, -1154.32, 502.21)
		打开NPC("格莱斯·瑟登")
		延时(500)
	end
end
function AH转金()
	if 地图名() == "幽暗城" then
		if 在路径范围("幽暗城法师传送到旅店电梯") then
			路径走到("幽暗城法师传送到旅店电梯",1636.46, 200.787, -60.7758)
			走到(1648.26, 221.645, -56.8803,1)
			if 打开NPC("拍卖师凯恩") then
				延时(1000)
				拍卖转金()
			end	
			走到(1636.46, 200.787, -60.7758,1)
			路径走到("幽暗城法师传送到旅店电梯",1605.72, 240.141, -52.1517)
			路径走到("幽暗城法师传送到旅店电梯",1631.9, 219.541, -43.1025)
			打开身边目标()
			延时(2000)
			运行宏("/click OpenAllMail")
			延时(5000)
			运行宏("/run CloseMail()")
			延时(1000)
		end
	end
	if 地图名() == "雷霆崖" then
		if not 在坐标范围(-1261.44, 24.9744, 128.187,6) then
			if 在路径范围("雷霆崖传送点到电梯") then
				路径走到("雷霆崖传送点到电梯",-1209.47, 130.584, 134.497)
				路径走到("雷霆崖到飞机点",-1251.01, 66.7901, 127.379)
				走到(-1261.51, 45.6542, 127.442,1)
			else
				路径走到("雷霆崖旅店到草药训练师",-1261.51, 45.6542, 127.442)
			end
		end
		路径走到("雷霆崖旅店到银行",-1263.1, 46.2486, 127.542)
		走到(-1239.77, 74.9604, 129.112)
		走到(-1211.27, 96.5571, 134.388,1)
		if 打开NPC("拍卖师斯塔比") then
			延时(1000)
			拍卖转金()
		end
		走到(-1239.77, 74.9604, 129.112)
		走到(-1263.1, 46.2486, 127.542,1)
		打开身边目标()
		延时(2000)
		运行宏("/click OpenAllMail")
		延时(5000)
		运行宏("/run CloseMail()")
		延时(1000)
	end
	if 地图名() == "铁炉堡" then
		if not 在坐标范围(-4962.56, -904.966, 503.837,3) then
			自动寻路(-4962.56, -904.966, 503.837)
		end
		if 打开NPC("拍卖师雷姆斯") then
			延时(1000)
			拍卖转金()
		end
		自动寻路(-4910.39, -974.689, 501.45)
		打开身边目标()
		延时(2000)
		运行宏("/click OpenAllMail")
		延时(5000)
		运行宏("/run CloseMail()")
		延时(1000)
	end
end
function 邮寄()
	map = 地图名()
	if map == "铁炉堡" then
		自动寻路(-4909.48, -975.208, 501.448)
		发送邮件()
	elseif map == "暴风城" then
		自动寻路(-8876.06, 650.807, 96.0366)
		发送邮件()
	elseif 在路径范围("幽暗城法师传送到旅店电梯") then
		路径走到("幽暗城法师传送到旅店电梯",1633.25, 221.089, -43.1026)
		发送邮件()
	end
end
function 采矿准备()
	if not 存在技能("寻找矿物") then
		if zhenying == "联盟" then
			换绑暴风城()
			if 炉石位置() == "暴风城" then
				炉石()
			end
			if 地图名() == "暴风城" then
				自动寻路(-8422.36, 674.795, 95.6071)
				走到(-8441.14, 701.591, 99.9407)
				走到(-8436.58, 704.314, 99.9453)
				走到(-8431.7, 694.733, 103.364,1)
				打开NPC("吉尔曼·石手")
				延时(1000)
				对话选项(1)
				延时(1000)
				学习技能()
				走到(-8436.58, 704.314, 99.9453)
				走到(-8441.14, 701.591, 99.9407)
				走到(-8435, 692.522, 96.3181,1)
				if 背包物品数量("矿工锄") == 0 then
					走到(-8430.52, 693.598, 96.3181,1)
					打开NPC("布鲁克·石衣")
					延时(1000)
					对话选项(1)
					延时(1000)
					购买物品(1,1)
					延时(1000)
				end
				走到(-8426.12, 678.995, 96.3181)
				走到(-8421.32, 672.682, 94.681,1)
			end
		else
			换绑幽暗城()
			if not 在路径范围("幽暗城旅馆到采矿训练师") then
				if 炉石位置() == "幽暗城" then
					炉石()
				end
				路径走到("幽暗城法师传送到旅店电梯",1633.98, 227.535, -43.1026)
			end
			if 在路径范围("幽暗城旅馆到采矿训练师") then
				路径走到("幽暗城旅馆到采矿训练师",1639.84, 336.79, -62.1748)
				打开NPC("布罗姆·基里安")
				延时(1000)
				学习技能()
			end
			if 背包物品数量("矿工锄") == 0 then
				路径走到("幽暗城旅馆到采矿训练师",1642.9, 331.829, -62.1855)
				打开NPC("莎拉·基里安")
				延时(1000)
				购买物品(1,1)
				延时(1000)
			end
			if 背包物品数量("铜矿石")>0 then
				if not 在路径范围("幽暗城旅馆到采矿训练师") then
					路径走到("幽暗城法师传送到旅店电梯",1633.98, 227.535, -43.1026)
				end
				if 在路径范围("幽暗城旅馆到采矿训练师") then
					路径走到("幽暗城旅馆到采矿训练师",1696.37, 296.435, -62.1545)
					下马()
					运行宏("/run CloseTradeSkill()")
					延时(1500)
					运行宏("/cast 熔炼")
					延时(1500)
					聊天输入("/run for i=1,50 do n,_,c=GetTradeSkillInfo(i) if n and n=='熔炼铜锭' and c>0 then DoTradeSkill(i,c) break end end")
					while 背包物品数量("铜矿石") > 0 do 
						延时(3000)
					end
					运行宏("/run CloseTradeSkill()")
				end
			end
			提升草药技能()
			minck,maxck = 专业信息("采矿")
			if minck>=65 and 背包物品数量("锡矿石") > 0 then
				路径走到("幽暗城旅馆到采矿训练师",1696.37, 296.435, -62.1545)
				下马()
				运行宏("/run CloseTradeSkill()")
				延时(1500)
				运行宏("/cast 熔炼")
				延时(1500)
				if 背包物品数量("锡矿石")>0 then
					聊天输入("/run for i=1,50 do n,_,c=GetTradeSkillInfo(i) if n and n=='熔炼锡锭' and c>0 then DoTradeSkill(i,c) break end end")
					while 背包物品数量("锡矿石") > 0 do 
						延时(3000)
					end
					跳()
					延时(1000)
				end
				if 背包物品数量("铜锭") > 0 and 背包物品数量("锡锭") > 0 then
					聊天输入("/run for i=1,50 do n,_,c=GetTradeSkillInfo(i) if n and n=='熔炼青铜' and c>0 then DoTradeSkill(i,c) break end end")
					while 背包物品数量("铜锭") > 0 and 背包物品数量("锡锭") > 0 do 
						延时(3000)
					end
				end
				运行宏("/run CloseTradeSkill()")
			end
			路径走到("幽暗城旅馆到采矿训练师",1633.98, 227.535, -43.1026)
			邮寄()
			执行脚本("部落买马.lua")
		end
	end
	minck,maxck = 专业信息("采矿")
	if 地图名() == "暴风城" then
		if minck<90 and (背包物品数量("铜矿石")>0 or 背包物品数量("锡矿石")>0) then
			提升草药技能()
			if 背包物品数量("铜矿石")>0 then
				自动寻路(-8425.02, 628.259, 95.6957)
				下马()
				运行宏("/run CloseTradeSkill()")
				延时(1500)
				运行宏("/cast 熔炼")
				延时(1500)
				聊天输入("/run for i=1,50 do n,_,c=GetTradeSkillInfo(i) if n and n=='熔炼铜锭' and c>0 then DoTradeSkill(i,c) break end end")
				while 背包物品数量("铜矿石") > 0 do 
					延时(3000)
				end
			end
			提升草药技能()
			if 背包物品数量("锡矿石")>0 then
				自动寻路(-8425.02, 628.259, 95.6957)
				下马()
				运行宏("/run CloseTradeSkill()")
				延时(1500)
				运行宏("/cast 熔炼")
				延时(1500)
				聊天输入("/run for i=1,50 do n,_,c=GetTradeSkillInfo(i) if n and n=='熔炼锡锭' and c>0 then DoTradeSkill(i,c) break end end")
				while 背包物品数量("锡矿石") > 0 do 
					延时(3000)
				end
				跳()
				延时(1000)
			end
			if 背包物品数量("铜锭") > 0 and 背包物品数量("锡锭") > 0 then
				自动寻路(-8425.02, 628.259, 95.6957)
				下马()
				运行宏("/run CloseTradeSkill()")
				延时(1500)
				运行宏("/cast 熔炼")
				延时(1500)
				聊天输入("/run for i=1,50 do n,_,c=GetTradeSkillInfo(i) if n and n=='熔炼青铜' and c>0 then DoTradeSkill(i,c) break end end")
				while 背包物品数量("铜锭") > 0 and 背包物品数量("锡锭") > 0 do 
					延时(3000)
				end
			end
			运行宏("/run CloseTradeSkill()")
			提升草药技能()
			邮寄()
		end
		执行脚本("人类买马.lua")
	elseif 地图名() == "幽暗城" then
		if minck<90 and (背包物品数量("铜矿石")>0 or 背包物品数量("锡矿石")>0) then
			提升草药技能()
			if not 在路径范围("幽暗城旅馆到采矿训练师") then
				路径走到("幽暗城法师传送到旅店电梯",1633.98, 227.535, -43.1026)
			end
			if 在路径范围("幽暗城旅馆到采矿训练师") then
				路径走到("幽暗城旅馆到采矿训练师",1696.37, 296.435, -62.1545)
				下马()
				运行宏("/run CloseTradeSkill()")
				延时(1500)
				运行宏("/cast 熔炼")
				延时(1500)
				if 背包物品数量("铜矿石")>0 then
					聊天输入("/run for i=1,50 do n,_,c=GetTradeSkillInfo(i) if n and n=='熔炼铜锭' and c>0 then DoTradeSkill(i,c) break end end")
					while 背包物品数量("铜矿石") > 0 do 
						延时(3000)
					end
				end
				提升草药技能()
				路径走到("幽暗城旅馆到采矿训练师",1696.37, 296.435, -62.1545)
				下马()
				运行宏("/run CloseTradeSkill()")
				延时(1500)
				运行宏("/cast 熔炼")
				延时(1500)
				if 背包物品数量("锡矿石")>0 then
					聊天输入("/run for i=1,50 do n,_,c=GetTradeSkillInfo(i) if n and n=='熔炼锡锭' and c>0 then DoTradeSkill(i,c) break end end")
					while 背包物品数量("锡矿石") > 0 do 
						延时(3000)
					end
					跳()
					延时(1000)
				end
				if 背包物品数量("铜锭") > 0 and 背包物品数量("锡锭") > 0 then
					聊天输入("/run for i=1,50 do n,_,c=GetTradeSkillInfo(i) if n and n=='熔炼青铜' and c>0 then DoTradeSkill(i,c) break end end")
					while 背包物品数量("铜锭") > 0 and 背包物品数量("锡锭") > 0 do 
						延时(3000)
					end
				end
				运行宏("/run CloseTradeSkill()")
			end
			提升草药技能()
			路径走到("幽暗城旅馆到采矿训练师",1633.98, 227.535, -43.1026)
			邮寄()
		end
		执行脚本("部落买马.lua")
	end
end
function 死矿挖矿()
	if 在副本() and 地图名() == "死亡矿井" then
		if zy == "法师" then
			使用技能("奥术智慧")
			延时(1400)
			使用技能("冰甲术")
			延时(1000)
		end
		if 在坐标范围(-16.314, -382.746, 61.6091,40) then
			btime = os.clock()
			回满()
			潜行()
		end
		潜行()
		自动寻路(-61.2773, -376.277, 54.3184)
		while 战斗中() do 
			技能输出()
		end
		潜行()
		采集(-61.2773, -376.277, 54.3184,60)
		潜行()
		自动寻路(-112.293, -380.347, 57.9214)
		while 战斗中() do 
			技能输出()
		end
		潜行()
		采集(-112.293, -380.347, 57.9214,60)
		潜行()
		自动寻路(-127.2, -414.705, 58.1426)
		while 战斗中() do 
			技能输出()
		end
		采集(-127.2, -414.705, 58.1426,40)
		潜行()
		自动寻路(-166.797, -397.639, 57.3244)
		while 战斗中() do 
			技能输出()
		end
		潜行()
		采集(-166.797, -397.639, 57.3244,40)
		潜行()
		自动寻路(-181.257, -423.952, 54.7282)
		延时(1000)
		while 战斗中() do 
			技能输出()
		end
		潜行()
		while 战斗中() do 
			技能输出()
		end
		潜行()
		if zy=="法师" then
			走到(-181.831, -443.168, 54.6261,1)
			闪现走到(-185.269, -457.769, 54.6953,1)
		elseif zy == "潜行者" then
			潜行()
			走到(-181.831, -443.168, 54.6261)
			走到(-185.426, -445.417, 54.7583)
			走到(-187.489, -449.491, 54.9795)
			走到(-184.906, -454.708, 54.6043)
			走到(-185.269, -457.769, 54.6953,1)
		end
		走到(-185.79, -457.505, 54.6811,1,0.1)
		打开身边目标("门轴")
		通灵穿门()
		延时(500)
		while 战斗中() do 
			技能输出()
		end
		潜行()
		if zy == "法师" then
			while 坐标范围怪物数量(-191.49, -452.355, 54.45,8,"拉克佐",1)>0 do 
				延时(500)
			end
		end
		走到(-186.031, -454.048, 54.7544,0,0,0.2)
		走到(-188.014, -452.9, 54.4415)
		走到(-189.156, -454.859, 54.4532)
		走到(-189.544, -460.416, 54.5752)
		走到(-189.271, -466.909, 54.148,1)
		if 战斗中() then
			while 战斗中() and 可循环() do 
				技能输出()
			end
		end
		潜行()
		自动寻路(-180.513, -494.414, 53.9825)
		while 战斗中() do 
			技能输出()
		end
		潜行()
		采集(-180.513, -494.414, 53.9825,50)
		潜行()
		自动寻路(-217.756, -510.385, 51.0622)
		while 战斗中() do 
			技能输出()
		end
		潜行()
		采集(-217.756, -510.385, 51.0622,50)
		潜行()
		自动寻路(-243.147, -488.389, 49.2257)
		while 战斗中() do 
			技能输出()
		end
		潜行()
		采集(-243.147, -488.389, 49.2257,40)
		潜行()
		if 战斗中() then
			while 战斗中() and 可循环() do 
				技能输出()
			end
		end
		潜行()
		自动寻路(-260.319, -482.185, 49.4473)
		if 战斗中() then
			while 战斗中() and 可循环() do 
				技能输出()
			end
			潜行()
			自动寻路(-260.319, -482.185, 49.4473)
		end
		打开身边目标("厚重的门")
		通灵穿门()
		延时(500)
		while 战斗中() do 
			技能输出()
		end
		潜行()
		走到(-271.013, -482.095, 48.9714,1)
		while 战斗中() do 
			技能输出()
		end
		潜行()
		走到(-272.372, -486.561, 49.0836,1)
		if zy == "法师" then
			走到(-271.494, -488.6, 49.3308,1)
			if 选怪("地精木匠",12) then
				朝向坐标(-277.256,-494.085,49.5026)
				按键("w")
				使用技能("寒冰护体")
				延时(1500)
				使用技能("寒冰箭")
				延时(300)
				while 读条中() do 
					延时(300)
				end
				使用技能("火焰冲击")
				延时(1400)
				while 战斗中() do 
					技能输出()
				end
			end
			走到(-278.852, -491.51, 49.2486)
			走到(-281.245, -509.103, 49.4624)
			闪现走到(-281.46, -535.61, 49.4406,1)
		elseif zy == "潜行者" then
			潜行()
			走到(-278.852, -491.51, 49.2486)
			走到(-281.245, -509.103, 49.4624)
			走到(-277.879, -520.469, 49.2886)
			走到(-281.46, -535.61, 49.4406,1)
		end
		while 战斗中() do 
			技能输出()
		end
		潜行()
		走到(-281.302, -535.368, 49.4407)
		走到(-285.991, -533.791, 49.4133,1,0,0.2)
		走到(-287.239, -535.566, 49.4356,1,0,0.2)
		朝向坐标(-287.282,-539.877,49.4321)
		移动("前",1000)
		打开身边目标("门轴")
		通灵穿门()
		延时(500)
		走到(-292.693, -543.364, 49.4402,1)
		潜行()
		while 战斗中() do 
			技能输出()
		end
		回满()
		潜行()
		自动寻路(-288.997, -569.893, 49.1464)
		while 战斗中() do 
			技能输出()
		end
		潜行()
		采集(-288.997, -569.893, 49.1464,60)
		潜行()
		自动寻路(-269.205, -577.518, 50.2097)
		while 战斗中() do 
			技能输出()
		end
		潜行()
		采集(-269.205, -577.518, 50.2097,60)
		自动寻路(-244.681, -578.658, 51.1499)
		while 战斗中() do 
			技能输出()
		end
		打开身边目标()
		通灵穿门()
		延时(500)
		while 战斗中() do 
			技能输出()
		end
		潜行()
		路径走到("死亡矿井地精锻造厂",-188.813, -568.997, 20.9769)
		if zy == "法师" then
			闪现走到(-169.647, -571.396, 19.3154,1)
		else
			走到(-169.647, -571.396, 19.3154,1)
		end
		while 战斗中() do 
			技能输出()
		end
		潜行()
		走到(-169.647, -571.396, 19.3154,1)
		走到(-169.431, -574.04, 19.3154,1)
		走到(-172.104, -574.692, 19.3154)
		走到(-171.314, -577.581, 19.3144,1)
		朝向坐标(-165.404,-576.924,19.3064)
		移动("前",1000)
		打开身边目标("门轴")
		通灵穿门()
		延时(500)
		while 战斗中() do 
			技能输出()
		end
		走到(-162.237, -579.646, 19.3154,1)
		while 战斗中() do 
			技能输出()
		end
		潜行()
		走到(-148.782, -573.115, 18.9698,1)
		while 战斗中() do 
			技能输出()
		end
		潜行()
		采集(-148.782, -573.115, 18.9698,50)
		潜行()
		自动寻路(-130.259, -609.491, 14.1264)
		while 战斗中() do 
			技能输出()
		end
		潜行()
		采集(-130.259, -609.491, 14.1264,100)
		while 战斗中() do 
			技能输出()
		end	
		潜行()
		自动寻路(-101.487, -617.523, 14.8851)
		延时(1500)
		while 战斗中() do 
			技能输出()
		end	
		潜行()
		走到(-99.4857, -614.68, 14.7988,1,1)
		清理低价物品()
		销毁低价物品()
		销毁物品("劣质的石头",1)
		销毁物品("肉排",1)
		销毁物品("冰镇牛奶",1)
		销毁物品("达拉然奶酪",1)
		if HP() > 1 then
			return true
		end
	end
	return false
end
function 奥达曼复活()
	if HP() == 0 then
		释放灵魂()
	end
	if HP() == 1 then
		if 在路径范围("奥达曼后门复活") then
			路径走到("奥达曼后门复活",-6621.73, -3765.47, 266.393)
		elseif 在路径范围("丹莫罗到奥达曼后门") then
			路径走到("丹莫罗到奥达曼后门",-6621.73, -3765.47, 266.393)
		end
		if 在坐标范围(-6621.73, -3765.47, 266.393,10) then
			重置副本()
			fbtime = fbtime + 1
			朝向坐标(-6620.73, -3765.47, 266.393)
			移动("前",5000)
			while 过图中() do 
				延时(1000)
			end
		end
	end
end
function 奥达曼挖矿_后门开始() -- 
	if 在副本() and 地图名() == "奥达曼" then
		使用技能("寻找矿物")
		if 在坐标范围(-213.418, 383.276, -38.6929,25) and HP()>1 then
			btime = os.clock()
			自动寻路(-186.175, 389.747, -37.2002)
			打开身边目标("挨卡莫克之门")
			--通灵穿门()
			延时(500)
			潜行()
			自动寻路(-157.619, 378.748, -37.9886)
		end
		if 在坐标范围(-157.619, 378.748, -37.9886,25) and HP()>1 then
			潜行()
			自动寻路(-134.153, 363.47, -42.6773)
			if minck<250 then
				采集(-134.153, 363.47, -42.6773,15)
			end
		end
		if 在坐标范围(-134.153, 363.47, -42.6773,25) and HP()>1 then
			潜行()
			if 等级() > 60 and 坐标范围有矿草(-91.0352,340.874,-47.6441,6) then
				自动寻路(-87.334,334.691,-48.115)
				范围选怪(-87.334,334.691,-48.115,5,"土灵")
				延时(300)
				朝向坐标(-84.334,334.691,-48.115)
				按键("w")
				延时(300)
				运行宏("/cast 闷棍")
				延时(800)
				走到(-89.334,334.691,-48.115,1)
				走到(-91.2388,340.715,-47.1,1,0,0.2)
				移动("右",200)
				if 战斗中() == false then
					for i=1,8 do
						if 坐标范围有矿草(-91.0352,340.874,-47.6441,6) and HP()>1 and not 有目标() then
							打开身边目标("矿")
							延时(300)
							while 读条中() do 
								延时(100)
							end
							延时(1000)
						else
							break
						end
					end
				end
				if 战斗中() then
					使用技能("消失")
					延时(500)
					if 战斗中() then
						运行宏("/cast 伺机待发")
						延时(500)
						运行宏("/cast 消失")
					end
				end
				清除目标()
			end
			if minck<250 and 坐标范围有矿草(-101.574, 308.107, -49.9423,5) then
				自动寻路(-101.574, 308.107, -49.9423)
				范围采集(5)
				潜行()
			end
			自动寻路(-55.8984, 376.737, -49.7881)
			自动寻路(-7.02926, 375.745, -43.7449)
		end
		if 在坐标范围(-7.02926, 375.745, -43.7449,30) and HP()>1 then
			潜行()
			范围采集(5)
			潜行()
			if 坐标范围有矿草(1.2088, 401.026, -45.831,5) then
				自动寻路(1.2088, 401.026, -46.2675)
				延时(300)
				走到(1.2088, 401.026, -46.2675,1)
				范围采集(5)
				潜行()
			end
			if minck<250 and 坐标范围有矿草(-8.9069, 399.833, -46.1882,4) then
				自动寻路(-6.42069, 400.833, -46.1882)
				范围采集(5)
				潜行()
			end
			自动寻路(27.7031, 361.722, -41.3084)
		end
		if 在坐标范围(27.7031, 361.722, -41.3084,20) and HP()>1 then
			潜行()
			if 坐标范围有矿草(20.1301, 376.137, -39.2186,5) then
				if 等级() < 58 then
					自动寻路(22.3062, 373.936, -40.5292)
					走到(28.058, 376.493, -40.5162,1,0,0.2)
					范围选怪(28.058, 376.493, -40.5162,5,"石窟")
					延时(300)
					朝向坐标(30.4953, 375.172, -40.1389)
					按键("w")
					延时(300)
					运行宏("/cast 闷棍")
					延时(800)
					走到(22.3062, 373.936, -40.5292,1)
					自动寻路(20.1301, 376.137, -39.2186)
					if 战斗中() == false then
						清除目标()
						for i=1,5 do
							if 坐标范围有矿草(20.1301, 376.137, -39.2186,5) and HP()>1 and not 有目标() then
								打开身边目标("矿")
								延时(300)
								while 读条中() do 
									延时(100)
								end
								延时(1000)
							else
								break
							end
						end
						if 战斗中() then
							使用技能("消失")
							延时(500)
							if 战斗中() then
								运行宏("/cast 伺机待发")
								延时(500)
								运行宏("/cast 消失")
							end
							清除目标()
						end
						潜行()
					else
						使用技能("消失")
						延时(500)
						if 战斗中() then
							运行宏("/cast 伺机待发")
							延时(500)
							运行宏("/cast 消失")
						end
						清除目标()
					end
				else
					自动寻路(20.1301, 376.137, -39.2186)
					范围采集(5)
					潜行()
				end
			end
			自动寻路(27.7031, 361.722, -41.3084)
			走到(38.7919, 371.88, -41.7246,1)
			if 坐标范围有矿草(70.1268,443.334,-41.0286,5) then
				自动寻路(69.5231, 407.826, -38.274)
				自动寻路(71.4051, 439.914, -41.0263)
				范围采集(5)
				潜行()
				自动寻路(69.5231, 407.826, -38.274)
			end
			自动寻路(27.7031, 361.722, -41.3084)
			自动寻路(17.8595, 260.41, -34.9882)
		end
		--[[if 在坐标范围(54.2215, 326.777, -42.9379,25) and HP()>1 then
			潜行()
			采集(54.2215, 326.777, -42.9379,15)
			潜行()
			自动寻路(17.8595, 260.41, -34.9882)
		end--]]
		if 在坐标范围(17.8595, 260.41, -34.9882,25) and HP()>1 then
			潜行()
			if minck<250 and 坐标范围有矿草(37.4754, 211.322, -28.3208,5) then
				自动寻路(37.4754, 211.322, -28.3208)
				范围采集(5)
				潜行()
			end
			if 坐标范围有矿草(30.0721, 207.922, -29.0434,5) then
				自动寻路(37.4754, 211.322, -28.3208)
				if 等级() < 56 then
					走到(27.4771,211.323,-30.655,1,0,0.2)
					范围选怪(27.4771,211.323,-30.655,6,"石窟")
					延时(300)
					朝向坐标(25.08,214.22,-30)
					按键("w")
					延时(300)
					运行宏("/cast 闷棍")
					延时(800)
					走到(31.6148,207.929,-28.906,1)
				end
				走到(30.02459, 207.995, -29.0434,1,0,0.2)
				if 战斗中() == false then
					清除目标()
					朝向坐标(29.7458, 208.14, -29.0256)
					移动("前",400)
					for i=1,8 do
						if 坐标范围有矿草(30.0721, 207.922, -29.0434,5) and HP()>1 and not 有目标() then
							打开身边目标("矿")
							延时(300)
							while 读条中() do 
								延时(100)
							end
							延时(1000)
						else
							break
						end
					end
					if 战斗中() then
						使用技能("消失")
						延时(500)
						if 战斗中() then
							运行宏("/cast 伺机待发")
							延时(500)
							运行宏("/cast 消失")
						end
						清除目标()
					end
					潜行()
				else
					使用技能("消失")
					延时(500)
					if 战斗中() then
						运行宏("/cast 伺机待发")
						延时(500)
						运行宏("/cast 消失")
					end
					清除目标()
				end
			end
			自动寻路(-29.7474, 298.136, -45.5336)
		end
		if 在坐标范围(-29.7474, 298.136, -45.5336,25) and HP()>1 then
			范围采集(5)
			潜行()
			自动寻路(-49.6638, 269.813, -49.0191)
		end
		if 在坐标范围(-49.6638, 269.813, -49.0191,25) and HP()>1 then
			潜行()
			if minck<250 and 坐标范围有矿草(-52.1731, 271.609, -46.6138,5) then
				走到(-53.8833, 269.256, -46.5548,1,1)
				范围采集(5)
				潜行()
			end
			自动寻路(-58.9585, 243.011, -48.3246)
		end
		if 在坐标范围(-58.9585, 243.011, -48.3246,35) and HP()>1 then
			潜行()
			if 坐标范围有矿草(-61.17, 200.199, -47.0673,5) then
				while 坐标范围怪物数量(-58.9195, 237.993, -48.3233,8,"石头管理者",1) > 0 and 可循环() do 
					延时(500)
				end
				自动寻路(-62.0237, 198.594, -46.8613)
				范围采集(5)
				潜行()
			end
			if minck < 250 and 坐标范围有矿草(-88.0499, 191.589, -48.3085,5) then
				if 在坐标范围(-58.9585, 243.011, -48.3246,5) and HP()>1 then
					while 坐标范围怪物数量(-58.9195, 237.993, -48.3233,8,"石头管理者",1) > 0 and 可循环() do 
						延时(500)
					end
				end
				自动寻路(-88.0499, 191.589, -48.3085)
				范围采集(5)
				潜行()
			end
			自动寻路(-127.029, 224.646, -48.497)
		end
		if 在坐标范围(-127.029, 224.646, -48.497,25) and HP()>1 then
			潜行()
			if minck<250 and 坐标范围有矿草(-144.895, 210.325, -46.1459,5) then
				自动寻路(-144.895, 210.325, -46.1459)
				范围采集(5)
				潜行()
			end
			自动寻路(-130.886, 270.388, -45.9751)
			while 坐标范围怪物数量(-129.982, 274.855, -46.284,12,"利齿蝙蝠",1) > 0 and 可循环() do 
				延时(500)
			end
			走到(-129.864, 275.491, -46.2127)
			走到(-131.65, 280.547, -45.9293)
			走到(-133.73, 284.293, -46.1653)
			走到(-136.35, 286.85, -46.2927)
			走到(-139.927, 288.693, -46.5533)
			走到(-142.18, 287.256, -46.471,1)
		end
		if 在坐标范围(-142.18, 287.256, -46.471,25) and HP()>1 then
			潜行()
			if 坐标范围有矿草(-137.048, 281.405, -52.349,5) then
				走到(-144.437, 281.076, -49.6226,1,0,0.3)
				走到(-137.782, 283.733, -49.3337,1,0,0.3)
				范围采集(5)
				潜行()
				x,y,z = 当前坐标()
				while z <-46.6 and 可循环() do 
					走到(-142.212, 282.594, -48.7917,1,0,0.1)
					走到(-145.801, 287.011, -46.1812,1,1,0.3)
					x,y,z = 当前坐标()
				end
				潜行()
			end
			if 坐标范围有矿草(-143.672, 251.942, -47.4061,5) then
				自动寻路(-143.672, 251.942, -47.4061)
				范围采集(5)
				潜行()
			end
			自动寻路(-226.317, 244.103, -49.7321)
		end
		if 在坐标范围(-226.317, 244.103, -49.7321,35) and HP()>1 then
			潜行()
			if 坐标范围有矿草(-260.701, 252.359, -47.6772,5) then
				自动寻路(-260.701, 252.359, -47.6772)
				范围采集(5)
				潜行()
			end
			if 坐标范围有矿草(-260.38, 270.742, -49.286,5) then
				自动寻路(-260.38, 270.742, -49.286)
				范围采集(5)
				潜行()
			end
			if minck<250 and 坐标范围有矿草(-250.171, 224.436, -46.1021,5) then
				自动寻路(-250.171, 224.436, -46.1021)
				范围采集(5)
				潜行()
			end
			自动寻路(-289.414, 136.202, -47)
			自动寻路(-309.982, 115.574, -47.557)
		end
		if (在坐标范围(-309.982, 115.574, -47.557,35) or 在坐标范围(-203.444, 91.3464, -48.1035,5)) and HP()>1 then
			潜行()
			if 坐标范围有矿草(-359.403, 143.742, -48.7301,5) then
				自动寻路(-359.403, 143.742, -48.7301)
				范围采集(5)
				潜行()
			end
			if 坐标范围有矿草(-326.238, 87.9674, -51.2493,5) then
				自动寻路(-324.031, 89.747, -50.9223)
				范围采集(5)
				潜行()
				走到(-328.191, 107.635, -53.9766,1)
			end
		end
		潜行()
		自动寻路(-200.139, 89.1131, -48.1083)
		走到(-196.912, 88.1938, -47.186,1,1)
		if 战斗中() then
			使用技能("伺机待发")
			延时(500)
			使用技能("消失")
		end
		走到(-189.97, 88.6195, -48.7935,1,1)
		走到(-183.605, 96.0524, -46.6259,1,0,0.2)
		if 在坐标范围(-183.63, 95.8659, -46.6259,15) and HP()>1 then
			潜行()
			范围采集(5)
			潜行()
			走到(-186.87, 95.4395, -46.7935,1,0,0.2)
			销毁物品("精铁矿石",1)
			if HP() > 1 then
				return true
			end
		end
	end
	return false
end
function 法师天赋()
	if zy == "法师" then
		for i=1,7 do
			if 取天赋点数(1,1)<2 then
				加天赋(1,1)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(1,2)<3 then
				加天赋(1,2)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(1,6)<5 then
				加天赋(1,6)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(3,1)<2 then
				加天赋(3,1)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(3,2)<5 then
				加天赋(3,2)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(3,3)<3 then
				加天赋(3,3)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(3,6)<2 then
				加天赋(3,6)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(3,7)<3 then
				加天赋(3,7)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(3,8)<3 then
				加天赋(3,8)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(3,9)<1 then
				加天赋(3,9)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(3,10)<3 then
				加天赋(3,10)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(3,11)<2 then
				加天赋(3,11)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(3,12)<3 then
				加天赋(3,12)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(3,15)<1 then
				加天赋(3,15)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(3,17)<2 then
				加天赋(3,17)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(3,19)<1 then
				加天赋(3,19)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(3,20)<5 then
				加天赋(3,20)
				延时(500)
			else
				break
			end
		end
		for i=1,5 do
			if 取天赋点数(3,21)<4 then
				加天赋(3,21)
				延时(500)
			else
				break
			end
		end
		for i=1,2 do
			if 取天赋点数(3,22)<1 then
				加天赋(3,22)
				延时(500)
			else
				break
			end
		end
		for i=1,2 do
			if 取天赋点数(1,9)<1 then
				加天赋(1,9)
				延时(500)
			else
				break
			end
		end
		for i=1,3 do
			if 取天赋点数(1,5)<2 then
				加天赋(1,5)
				延时(500)
			else
				break
			end
		end
		for i=1,3 do
			if 取天赋点数(1,7)<2 then
				加天赋(1,7)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(1,12)<3 then
				加天赋(1,12)
				延时(500)
			else
				break
			end
		end
		for i=1,4 do
			if 取天赋点数(1,5)<4 then
				加天赋(1,5)
				延时(500)
			else
				break
			end
		end
	end
end
function 盗贼天赋()
	if zy == "潜行者" then
		for i=1,7 do
			if 取天赋点数(3,1)<5 then
				加天赋(3,1)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(3,4)<2 then
				加天赋(3,4)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(3,5)<5 then
				加天赋(3,5)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(3,6)<2 then
				加天赋(3,6)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(3,7)<1 then
				加天赋(3,7)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(3,9)<3 then
				加天赋(3,9)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(3,10)<2 then
				加天赋(3,10)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(3,13)<1 then
				加天赋(3,13)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(1,1)<3 then
				加天赋(1,1)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(2,2)<2 then
				加天赋(2,2)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(2,3)<5 then
				加天赋(2,3)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(2,5)<5 then
				加天赋(2,5)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(2,6)<5 then
				加天赋(2,6)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(2,7)<2 then
				加天赋(2,7)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(2,11)<5 then
				加天赋(2,11)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(2,14)<1 then
				加天赋(2,14)
				延时(500)
			else
				break
			end
		end
		for i=1,7 do
			if 取天赋点数(2,18)<2 then
				加天赋(2,18)
				延时(500)
			else
				break
			end
		end
	end
end
function 队友掉线()
	if duiyoufs ~= nil then
		if duiyoufs ~= "" and 是否离线(duiyoufs) then
			return true
		end
	end
	return false
end
function 刚进游戏()
	local num=上号时间()
	if num > 0 and num < 3*60*1000 then
		return true
	end
	return false
end
function 上鸟()
	local name = 飞行坐骑名()
	if name ~= "" then
		if not 在马上() then 
			使用物品(name)
			延时(1000)
			while 读条中() do 
				延时(100)
			end
			延时(200)
		end
		按键("space",1)
		延时(200)
		按键("space",2)
	end
end
function 虚空风暴沿路开飞行点()
	while 在飞机上() do 
		延时(1000)
	end
	if 在坐标范围(3078.83, 3600.97, 144.066,10) then
		上鸟()
		按键("space",1)
		延时(3000)
		按键("space",2)
		if 在飞行() then
			if zhenying == "联盟" then
				路径走到("52区到托什雷的基地",1862.74, 5528.48, 276.575)
				打开NPC("里普·派兹拉姆")
				下马()
				延时(500)
				if 打开NPC("里普·派兹拉姆") then
					if 坐飞机到("泰雷多尔") then
						while 在飞机上() do 
							延时(1000)
						end
					end
				end
				while 在飞机上() do 
					延时(1000)
				end
				if 在坐标范围(1862.74, 5528.48, 276.575,10) then
					上鸟()
					按键("space",1)
					延时(3000)
					按键("space",2)
					路径走到("托什雷的基地到泰雷多尔",210.869, 6064.73, 148.316)
					打开NPC("蒙希")
					延时(500)
					if zy=="法师" and not 存在技能("传送：沙塔斯") then
						下马()
						if 打开NPC("蒙希") then
							if 坐飞机到("沙塔斯") then
								
							end
							
						end
						while 在飞机上() do 
							延时(1000)
						end
						if 在坐标范围(210.869, 6064.73, 148.316,20) then
							上鸟()
							按键("space",1)
							延时(2000)
							按键("space",2)
							路径走到("泰雷多尔到沙塔斯城",-1833.22, 5299.61, -12.4272)
							打开NPC("努特拉尔")
							延时(500)
							按键("space",1)
							延时(1000)
							按键("space",2)
							走到(-1831.91, 5367.71, -3.51305)
							走到(-1847.11, 5406.17, -6.4291)
							走到(-1880.06, 5382.71, -12.4274)
							走到(-1884.44, 5368.67, -12.4274,1)
							if 打开NPC("艾欧莉娅") then
								延时(1000)
								对话选项(1)
								延时(1000)
								学习技能()
							end
						end
					end
				end
			else
				路径走到("52区到雷神要塞",2448.24, 6021.4, 154.533)
				打开NPC("安努克·绿蹄")
				下马()
				延时(500)
				if 打开NPC("安努克·绿蹄") then
					if 坐飞机到("萨布拉金") then
						while 在飞机上() do 
							延时(1000)
						end
					end
				end
				while 在飞机上() do 
					延时(1000)
				end
				if 在坐标范围(2448.24, 6021.4, 154.533,20) then
					上鸟()
					按键("space",1)
					延时(3000)
					按键("space",2)
					路径走到("雷神要塞到萨布拉金",222.662, 7812.96, 22.658)
					打开NPC("杜迦")
					延时(500)
					if zy=="法师" and not 存在技能("传送：沙塔斯") then
						下马()
						if 打开NPC("杜迦") then
							if 坐飞机到("沙塔斯") then
								
							end
						end
						while 在飞机上() do 
							延时(1000)
						end
						if 在坐标范围(222.662, 7812.96, 22.658,20) then
							上鸟()
							按键("space",1)
							延时(3000)
							按键("space",2)
							路径走到("萨布拉金到沙塔斯城",-1832.16, 5299.07, -12.4266)
							打开NPC("努特拉尔")
							延时(500)
							按键("space",1)
							延时(800)
							按键("space",2)
							走到(-1831.91, 5367.71, -3.51305)
							走到(-1847.11, 5406.17, -6.4291)
							走到(-1880.06, 5382.71, -12.4274)
							走到(-1884.44, 5368.67, -12.4274,1)
							if 打开NPC("艾欧莉娅") then
								延时(1000)
								对话选项(1)
								延时(1000)
								学习技能()
							end
							
							走到(-1880.06, 5382.71, -12.4274)
							走到(-1844.85, 5389.96, -7.54359)
							走到(-1825.83, 5350.36, -9.57736)
							走到(-1833.05, 5298.6, -12.427,1)
						end
						
					end
				end
			end
		else
			提示("没有飞行坐骑")
		end
	end
end